nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>AES_TST_DB[%s]</name>
          <description>IEE AES Test Mode Data Buffer</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AES_TST_DB0</name>
              <description>AES test mode data buffer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MIPI_DSI__DSI_HOST</name>
      <description>no description available</description>
      <alternatePeripheral>AUDIO_PLL</alternatePeripheral>
      <groupName>DSI_HOST</groupName>
      <baseAddress>0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DSI_HOST_CFG_NUM_LANES</name>
          <description>no description available</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_num_lanes</name>
              <description>Sets the number of active lanes that are to be used for transmitting data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_cfg_num_lanes_0</name>
                  <description>1 lane</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_num_lanes_1</name>
                  <description>2 lanes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_num_lanes_2</name>
                  <description>3 lanes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_num_lanes_3</name>
                  <description>4 lanes</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_NONCONTINUOUS_CLK</name>
          <description>no description available</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_noncontinuous_clk</name>
              <description>Sets the Host Controller into non-continuous MIPI clock mode. When in non-continuous clock mode, the high speed clock will transistion into low power mode between transmissions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_cfg_noncontinuous_clk_0</name>
                  <description>Continuous high speed clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_noncontinuous_clk_1</name>
                  <description>Non-Continuous high speed clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_T_PRE</name>
          <description>no description available</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_t_pre</name>
              <description>Sets the number of byte clock periods ('clk_byte' input) that the controller will wait after enabling the clock lane for HS operation before enabling the data lanes for HS operation. This setting represents the TCLK-PRE DPHY timing parameter. The minimum value for this port is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_T_POST</name>
          <description>no description available</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_t_post</name>
              <description>Sets the number of byte clock periods ('clk_byte' input) to wait before putting the clock lane into LP mode after the data lanes have been detected to be in Stop State. This setting represents the DPHY timing parameters TLPX + TCLK-PREPARE + TCLK-ZERO + TCLK-PRE requirement for the clock lane before the data lane is allowed to change from LP11 to start a high speed transmission. The minimum value for this port is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_TX_GAP</name>
          <description>no description available</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_tx_gap</name>
              <description>Sets the number of byte clock periods ('clk_byte' input) that the controller will wait after the clock lane has been put into LP mode before enabling the clock lane for HS mode again. This setting represents the THS-EXIT DPHY timing parameter. The minimum value for this port is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_AUTOINSERT_EOTP</name>
          <description>no description available</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_autoinsert_eotp</name>
              <description>Enables the Host Controller to automatically insert an EoTp short packet when switching from HS to LP mode. 1'b0 - EoTp is not automatically inserted 1'b1 - EoTp is automatically inserted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_EXTRA_CMDS_AFTER_EOTP</name>
          <description>no description available</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_extra_cmds_after_eotp</name>
              <description>Configures the DSI Host Controller to send extra End Of Transmission Packets after the end of a packet. The value is the number of extra EOTP packets sent.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_HTX_TO_COUNT</name>
          <description>no description available</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_htx_to_count</name>
              <description>Sets the value of the DSI Host High Speed TX timeout count in clk_byte clock periods that once reached will initiate a timeout error and follow the recovery procedure documented in the DSI specification.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_LRX_H_TO_COUNT</name>
          <description>no description available</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_lrx_h_to_count</name>
              <description>Sets the value of the DSI Host low power RX timeout count in clk_byte clock periods that once reached will initiate a timeout error and follow the recovery procedure documented in the DSI specification.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_BTA_H_TO_COUNT</name>
          <description>no description available</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_bta_h_to_count</name>
              <description>Sets the value of the DSI Host Bus Turn Around (BTA) timeout in clk_byte clock periods that once reached will initiate a timeout error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_TWAKEUP</name>
          <description>no description available</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_twakeup</name>
              <description>DPHY Twakeup timing parameter. Sets the number of clk_esc clock periods to keep a clock or data lane in Mark-1 state after exiting ULPS. The MIPI DPHY spec requires a minimum of 1ms in Mark-1 state after leaving ULPS.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_STATUS_OUT</name>
          <description>no description available</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_status_out</name>
              <description>Status Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_RX_ERROR_STATUS</name>
          <description>no description available</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_rx_error_status</name>
              <description>Status Register for Host receive error detection, ECC errors, CRC errors and for timeout indicators.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_rx_error_status_0</name>
                  <description>ECC single bit error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_rx_error_status_1</name>
                  <description>ECC multi bit error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_rx_error_status_2</name>
                  <description>Errored bit position for single bit ECC error</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_rx_error_status_3</name>
                  <description>Errored bit position for single bit ECC error</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_rx_error_status_4</name>
                  <description>Errored bit position for single bit ECC error</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_rx_error_status_5</name>
                  <description>Errored bit position for single bit ECC error</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_rx_error_status_6</name>
                  <description>Errored bit position for single bit ECC error</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_rx_error_status_7</name>
                  <description>CRC error detected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_rx_error_status_8</name>
                  <description>High Speed forward TX timeout detected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_rx_error_status_9</name>
                  <description>Reverse Low power data receive timeout detected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_rx_error_status_10</name>
                  <description>BTA timeout detected</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
