nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>MIPI_DSI__DSI_HOST_DPI_INTFC</name>
      <description>no description available</description>
      <groupName>DSI_HOST_DPI_INTFC</groupName>
      <baseAddress>0x200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x44</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DSI_HOST_CFG_DPI_PIXEL_PAYLOAD_SIZE</name>
          <description>no description available</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_pixel_payload_size</name>
              <description>Maximum number of pixels that should be sent as one DSI packet. Recommended to be evenly divisible by the line size (in pixels).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_PIXEL_FIFO_SEND_LEVEL</name>
          <description>no description available</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_pixel_fifo_send_level</name>
              <description>In order to optimize DSI utility, the DPI bridge buffers a cerntain number of DPI pixels before initiating a DSI packet. This configuration port controls the level at which the DPI Host bridge begins sending pixels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_INTERFACE_COLOR_CODING</name>
          <description>no description available</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_interface_color_coding</name>
              <description>Sets the distribution of RGB bits within the 24-bit d bus, as specified by the DPI specification. 0= 16-bit Configuration 1 1= 16-bit Configuration 2 2= 16-bit Configuration 3 3= 18-bit Configuration 1 4= 18-bit Configuration 2 5= 24-bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_interface_color_coding_0</name>
                  <description>16-bit Configuration 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_interface_color_coding_1</name>
                  <description>16-bit Configuration 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_interface_color_coding_2</name>
                  <description>16-bit Configuration 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_interface_color_coding_3</name>
                  <description>18-bit Configuration 1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_interface_color_coding_4</name>
                  <description>18-bit Configuration 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_interface_color_coding_5</name>
                  <description>24-bit</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_PIXEL_FORMAT</name>
          <description>no description available</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_pixel_format</name>
              <description>Sets the DSI packet type of the pixels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_pixel_format_0</name>
                  <description>16 bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_pixel_format_1</name>
                  <description>18 bit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_pixel_format_2</name>
                  <description>18 bit loosely packed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_pixel_format_3</name>
                  <description>24 bit</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_VSYNC_POLARITY</name>
          <description>no description available</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_vsync_polarity</name>
              <description>Sets polarity of dpi_vsync_input 0 - active low 1 - active high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_HSYNC_POLARITY</name>
          <description>no description available</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_hsync_polarity</name>
              <description>Sets polarity of dpi_hsync_input.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_hsync_polarity_0</name>
                  <description>active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_hsync_polarity_1</name>
                  <description>active high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_VIDEO_MODE</name>
          <description>no description available</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_video_mode</name>
              <description>Select DSI video mode that the host DPI module should generate packets for.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_video_mode_0</name>
                  <description>Non-Burst mode with Sync Pulses</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_video_mode_1</name>
                  <description>Non-Burst mode with Sync Events</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_video_mode_2</name>
                  <description>Burst mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_HFP</name>
          <description>no description available</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_hfp</name>
              <description>Sets the DSI packet payload size, in bytes, of the horizontal front porch blanking packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_HBP</name>
          <description>no description available</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_hbp</name>
              <description>Sets the DSI packet payload size, in bytes, of the horizontal back porch blanking packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_HSA</name>
          <description>no description available</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_hsa</name>
              <description>Sets the DSI packet payload size, in bytes, of the horizontal sync width filler blanking packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_ENABLE_MULT_PKTS</name>
          <description>no description available</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_enable_mult_pkts</name>
              <description>Enable Multiple packets per video line. When enabled, cfg_dpi_pixel_payload_size must be set to exactly half the size of the video line.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_enable_mult_pkts_0</name>
                  <description>Video Line is sent in a single packet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_enable_mult_pkts_1</name>
                  <description>Video Line is sent in two packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_VBP</name>
          <description>no description available</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_vbp</name>
              <description>Sets the number of lines in the vertical back porch.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_VFP</name>
          <description>no description available</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_vfp</name>
              <description>Sets the number of lines in the vertical front porch.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_BLLP_MODE</name>
          <description>no description available</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_bllp_mode</name>
              <description>Optimize bllp periods to Low Power mode when possible.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_bllp_mode_0</name>
                  <description>Blanking packets are sent during BLLP periods</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_bllp_mode_1</name>
                  <description>LP mode is used for BLLP periods</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_USE_NULL_PKT_BLLP</name>
          <description>no description available</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_use_null_pkt_bllp</name>
              <description>Selects type of blanking packet to be sent during bllp region.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_use_null_pkt_bllp_0</name>
                  <description>Blanking packet used in bllp region 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_cfg_dpi_use_null_pkt_bllp_1</name>
                  <description>Null packet used in bllp region</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_VACTIVE</name>
          <description>no description available</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_vactive</name>
              <description>Sets the number of lines in the vertical active aread.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_CFG_DPI_VC</name>
          <description>no description available</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_cfg_dpi_vc</name>
              <description>Sets the Virtual Channel (VC) of packets that will be sent to the receive packet interface. Packets with VC not equal to this value are discarded and the &quot;DSI VC ID Invalid&quot; bit (bit 12) in the DSI error report is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
