nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>MIPI_DSI__DSI_HOST_APB_PKT_IF</name>
      <description>no description available</description>
      <groupName>DSI_HOST_APB_PKT_IF</groupName>
      <baseAddress>0x280</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DSI_HOST_TX_PAYLOAD</name>
          <description>no description available</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_tx_payload</name>
              <description>Tx Payload data write register. Writes to this registers load the payload fifo with 32 bit values.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_PKT_CONTROL</name>
          <description>no description available</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_pkt_control</name>
              <description>Tx packet control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_0</name>
                  <description>Packet word count</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_1</name>
                  <description>Packet word count</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_2</name>
                  <description>Packet word count</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_3</name>
                  <description>Packet word count</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_4</name>
                  <description>Packet word count</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_5</name>
                  <description>Packet word count</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_6</name>
                  <description>Packet word count</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_7</name>
                  <description>Packet word count</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_8</name>
                  <description>Packet word count</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_9</name>
                  <description>Packet word count</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_16</name>
                  <description>Packet Virtual Channel</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_17</name>
                  <description>Packet Virtual Channel</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_18</name>
                  <description>Packet Header DSI Data Type</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_19</name>
                  <description>Packet Header DSI Data Type</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_20</name>
                  <description>Packet Header DSI Data Type</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_21</name>
                  <description>Packet Header DSI Data Type</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_22</name>
                  <description>Packet Header DSI Data Type</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_23</name>
                  <description>Packet Header DSI Data Type</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_24</name>
                  <description>Lp or HS select</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_25</name>
                  <description>perform BTA after packet is sent</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_control_26</name>
                  <description>perform BTA only, no packet tx</description>
                  <value>0x1A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_SEND_PACKET</name>
          <description>no description available</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_send_packet</name>
              <description>Tx send packet, writing to this register causes the packet described in dsi_host_pkt_control to be sent.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_PKT_STATUS</name>
          <description>no description available</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_pkt_status</name>
              <description>Status of APB to packet interface.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_pkt_status_0</name>
                  <description>state machine not idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_status_1</name>
                  <description>Tx packet done</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_status_2</name>
                  <description>dphy direction</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_status_3</name>
                  <description>tx fifo overflow</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_status_4</name>
                  <description>tx fifo underflow</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_status_5</name>
                  <description>rx fifo overflow</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_status_6</name>
                  <description>rx fifo underflow</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_status_7</name>
                  <description>rx packet header has been received</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_status_8</name>
                  <description>all rx packet payload data has been received</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_PKT_FIFO_WR_LEVEL</name>
          <description>no description available</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_pkt_fifo_wr_level</name>
              <description>Write level of APB to pkt interface fifo</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_PKT_FIFO_RD_LEVEL</name>
          <description>no description available</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_pkt_fifo_rd_level</name>
              <description>Read level of APB to pkt interface fifo</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_PKT_RX_PAYLOAD</name>
          <description>no description available</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_pkt_rx_payload</name>
              <description>APB to pkt interface rx payload read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_PKT_RX_PKT_HEADER</name>
          <description>no description available</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_pkt_rx_pkt_header</name>
              <description>APB to pkt interface rx packet header.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_0</name>
                  <description>word count</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_1</name>
                  <description>word count</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_2</name>
                  <description>word count</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_3</name>
                  <description>word count</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_4</name>
                  <description>word count</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_5</name>
                  <description>word count</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_6</name>
                  <description>word count</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_7</name>
                  <description>word count</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_8</name>
                  <description>word count</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_9</name>
                  <description>word count</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_16</name>
                  <description>data type</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_17</name>
                  <description>data type</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_18</name>
                  <description>data type</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_19</name>
                  <description>data type</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_20</name>
                  <description>data type</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_21</name>
                  <description>data type</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_22</name>
                  <description>Virtual Channel</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_pkt_rx_pkt_header_23</name>
                  <description>Virtual Channel</description>
                  <value>0x17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_IRQ_STATUS</name>
          <description>no description available</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_irq_status</name>
              <description>Status of APB to packet interface.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_irq_status_0</name>
                  <description>state machine not idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_1</name>
                  <description>Tx packet done</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_2</name>
                  <description>dphy direction</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_3</name>
                  <description>tx fifo overflow</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_4</name>
                  <description>tx fifo underflow</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_5</name>
                  <description>rx fifo overflow</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_6</name>
                  <description>rx fifo underflow</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_7</name>
                  <description>rx packet header has been received</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_8</name>
                  <description>all rx packet payload data has been received status_out port bit descriptions</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_9</name>
                  <description>map directory to dsi host controller</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_29</name>
                  <description>host bta timeout, host controller host_bta_timeout port</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_30</name>
                  <description>low power rx timeout, host controller lp_rx_timeout port</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status_31</name>
                  <description>high speed tx timeout, host controller hs_tx_timeout port</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_HOST_IRQ_STATUS2</name>
          <description>no description available</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dsi_host_irq_status2</name>
              <description>Status of APB to packet interface part 2, read part 2 first then dsi_host_irq_status. reading dsi_host_irq_status will clear both status and status2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dsi_host_irq_status2_0</name>
                  <description>single bit ecc error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status2_1</name>
                  <description>multi bit ecc error</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dsi_host_irq_status2_2</name>
                  <description>crc error</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reserved</name>
              <description>reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
