nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="AIPSTZ1">
      <name>AIPSTZ2</name>
      <description>AIPSTZ Control Registers</description>
      <groupName>AIPSTZ</groupName>
      <prependToName>AIPSTZ2_</prependToName>
      <baseAddress>0x40400000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="AIPSTZ1">
      <name>AIPSTZ3</name>
      <description>AIPSTZ Control Registers</description>
      <groupName>AIPSTZ</groupName>
      <prependToName>AIPSTZ3_</prependToName>
      <baseAddress>0x40800000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="AIPSTZ1">
      <name>AIPSTZ4</name>
      <description>AIPSTZ Control Registers</description>
      <groupName>AIPSTZ</groupName>
      <prependToName>AIPSTZ4_</prependToName>
      <baseAddress>0x40C00000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>SFA</name>
      <description>Signal Frequency Analyser</description>
      <groupName>SFA</groupName>
      <baseAddress>0x4000C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SFA</name>
        <value>94</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Signal Frequency Analyser (SFA) Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MEASUREMENT MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_0</name>
                  <description>Frequency measurement performed with REF frequency &gt; CUT Frequency.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_1</name>
                  <description>Frequency measurement performed with REF frequency &lt; CUT Frequency.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_2</name>
                  <description>CUT period measurement performed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_3</name>
                  <description>Trigger based measurement performed. Note, each trigger pulse must be held for at least 2 ref_clk cycles.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_START_POL</name>
              <description>Trigger Start Polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_START_POL_0</name>
                  <description>Rising edge of TRIGGER[TRIG_START_SEL] will begin the measurement sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_START_POL_1</name>
                  <description>Falling edge of TRIGGER[TRIG_START_SEL] will begin the measurement sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_END_POL</name>
              <description>Trigger End Polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_END_POL_0</name>
                  <description>Rising edge of TRIGER[TRIG_END_SEL] will end the measurement sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_END_POL_1</name>
                  <description>Falling edge of TRIGGER[TRIG_END_SEL] will end the measurement sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFA_TRIG_MEAS_EN</name>
              <description>SFA Triggered Measurement Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SFA_TRIG_MEAS_EN_0</name>
                  <description>The measurement will start by default with a dummy write to the REF and CUT counters.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFA_TRIG_MEAS_EN_1</name>
                  <description>The measurement will start after receiging a dummy write to the REF_CNT followed by receiving the trigger edge selected by TRIG_START_SEL and TRIG_START_POL.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFA_IRQ_EN</name>
              <description>SFA Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SFA_IRQ_EN_0</name>
                  <description>Interrupts are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFA_IRQ_EN_1</name>
                  <description>Interrupts are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFA_EN</name>
              <description>SFA Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SFA_EN_0</name>
                  <description>The SFA is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFA_EN_1</name>
                  <description>The SFA is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_START_SEL</name>
              <description>Signal MUX For Trigger Based Measurement Start</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG_END_SEL</name>
              <description>Signal MUX For Trigger Based Measurement End</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUT_PREDIV</name>
              <description>CUT_PREDIV</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CUT_PREDIV_0</name>
                  <description>No Divide</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_1</name>
                  <description>No Divide</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_3</name>
                  <description>Divide by 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_4</name>
                  <description>Divide by 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_5</name>
                  <description>Divide by 4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_6</name>
                  <description>Divide by 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_7</name>
                  <description>Divide by 6</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_8</name>
                  <description>Divide by 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_9</name>
                  <description>Divide by 8</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_10</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_11</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_12</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_13</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_14</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_15</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_16</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_17</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_18</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_19</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_20</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_21</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_22</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_23</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_24</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_25</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_26</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_27</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_28</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_29</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_30</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_31</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_32</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_33</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_34</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_35</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_36</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_37</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_38</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_39</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_40</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_41</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_42</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_43</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_44</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_45</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_46</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_47</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_48</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_49</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_50</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_51</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_52</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_53</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_54</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_55</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_56</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_57</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_58</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_59</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_60</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_61</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_62</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_63</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_64</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_65</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_66</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_67</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
