nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
                  <value>0xAA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_171</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xAB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_172</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xAC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_173</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xAD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_174</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xAE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_175</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xAF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_176</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_177</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_178</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_179</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_180</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_181</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_182</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_183</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_184</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_185</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_186</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xBA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_187</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xBB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_188</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xBC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_189</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xBD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_190</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xBE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_191</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xBF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_192</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_193</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_194</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_195</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_196</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_197</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_198</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_199</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_200</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_201</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_202</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xCA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_203</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xCB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_204</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xCC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_205</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xCD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_206</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xCE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_207</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xCF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_208</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_209</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_210</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_211</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_212</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_213</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_214</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_215</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_216</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_217</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_218</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xDA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_219</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xDB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_220</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xDC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_221</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xDD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_222</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xDE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_223</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xDF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_224</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_225</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_226</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_227</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_228</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_229</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_230</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_231</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_232</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_233</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_234</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xEA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_235</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xEB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_236</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xEC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_237</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xED</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_238</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xEE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_239</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xEF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_240</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_241</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_242</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_243</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_244</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_245</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_246</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_247</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_248</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_249</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_250</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_251</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_252</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_253</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_254</name>
                  <description>Divide by 254</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_255</name>
                  <description>Divide by 254</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CUT_SEL</name>
              <description>CUT_SEL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUT_PIN_EN</name>
              <description>CUT_PIN_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_EXT</name>
          <description>Signal Frequency Analyser (SFA) Control Extended</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CUT_CLK_EN</name>
              <description>CUT_CLK_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT_STAT</name>
          <description>Signal Frequency Analyser Count Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_STOPPED</name>
              <description>REF_STOPPED</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CUT_STOPPED</name>
              <description>CUT_STOPPED</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS_STARTED</name>
              <description>Measurement Started Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REF_CNT_TIMEOUT</name>
              <description>Reference Counter Time Out</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFA_IRQ</name>
              <description>SFA Interrupt Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CUT_CNT</name>
          <description>Signal Frequency Analyser Clock Under Test Counter</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CUT_CNT</name>
              <description>CUT_CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
