nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>REF_CNT</name>
          <description>Signal Frequency Analyser Reference Clock Counter</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_CNT</name>
              <description>REF_CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CUT_TARGET</name>
          <description>Signal Frequency Analyser Clock Under Test Target Count</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CUT_TARGET</name>
              <description>CUT_TARGET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_TARGET</name>
          <description>Signal Frequency Analyser Reference Clock Target Count</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_TARGET</name>
              <description>REF_TARGET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_CNT_ST_SAVED</name>
          <description>Signal Frequency Analyser Reference Clock Count Start Saved Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_CNT_ST_SAVED</name>
              <description>REF_CNT_ST_SAVED</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_CNT_END_SAVED</name>
          <description>Signal Frequency Analyser Reference Clock Count End Saved Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_CNT_END_SAVED</name>
              <description>REF_CNT_END_SAVED</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MECC1</name>
      <description>MECC64</description>
      <groupName>MECC</groupName>
      <headerStructName>MECC</headerStructName>
      <baseAddress>0x40014000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x108</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MECC1_INIT</name>
        <value>206</value>
      </interrupt>
      <interrupt>
        <name>MECC1_FATAL_INIT</name>
        <value>207</value>
      </interrupt>
      <interrupt>
        <name>MECC2_FATAL_INIT</name>
        <value>209</value>
      </interrupt>
      <registers>
        <register>
          <name>ERR_STATUS</name>
          <description>Error Interrupt Status Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR0</name>
              <description>Single Bit Error On Ocram Bank0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_ERR0_0</name>
                  <description>Single bit error does not happen on ocram bank0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_ERR0_1</name>
                  <description>Single bit error happens on ocram bank0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGLE_ERR1</name>
              <description>Single Bit Error On Ocram Bank1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_ERR1_0</name>
                  <description>Single bit error does not happen on ocram bank1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_ERR1_1</name>
                  <description>Single bit error happens on ocram bank1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGLE_ERR2</name>
              <description>Single Bit Error On Ocram Bank2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_ERR2_0</name>
                  <description>Single bit error does not happen on ocram bank2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_ERR2_1</name>
                  <description>Single bit error happens on ocram bank2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGLE_ERR3</name>
              <description>Single Bit Error On Ocram Bank3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_ERR3_0</name>
                  <description>Single bit error does not happen on ocram bank3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_ERR3_1</name>
                  <description>Single bit error happens on ocram bank3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTI_ERR0</name>
              <description>Multiple Bits Error On Ocram Bank0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTI_ERR0_0</name>
                  <description>Multiple bits error does not happen on ocram bank0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI_ERR0_1</name>
                  <description>Multiple bits error happens on ocram bank0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTI_ERR1</name>
              <description>Multiple Bits Error On Ocram Bank1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTI_ERR1_0</name>
                  <description>Multiple bits error does not happen on ocram bank1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI_ERR1_1</name>
                  <description>Multiple bits error happens on ocram bank1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTI_ERR2</name>
              <description>Multiple Bits Error On Ocram Bank2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTI_ERR2_0</name>
                  <description>Multiple bits error does not happen on ocram bank2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI_ERR2_1</name>
                  <description>Multiple bits error happens on ocram bank2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTI_ERR3</name>
              <description>Multiple Bits Error On Ocram Bank3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTI_ERR3_0</name>
                  <description>Multiple bits error does not happen on ocram bank3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI_ERR3_1</name>
                  <description>Multiple bits error happens on ocram bank3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRB_ERR0</name>
              <description>AXI Strobe Error On Ocram Bank0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STRB_ERR0_0</name>
                  <description>AXI strobe error does not happen on ocram bank0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STRB_ERR0_1</name>
                  <description>AXI strobe error happens on ocram bank0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRB_ERR1</name>
              <description>AXI Strobe Error On Ocram Bank1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STRB_ERR1_0</name>
                  <description>AXI strobe error does not happen on ocram bank1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STRB_ERR1_1</name>
                  <description>AXI strobe error happens on ocram bank1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRB_ERR2</name>
              <description>AXI Strobe Error On Ocram Bank2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STRB_ERR2_0</name>
                  <description>AXI strobe error does not happen on ocram bank2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STRB_ERR2_1</name>
                  <description>AXI strobe error happens on ocram bank2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRB_ERR3</name>
              <description>AXI Strobe Error On Ocram Bank3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STRB_ERR3_0</name>
                  <description>AXI strobe error does not happen on ocram bank3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STRB_ERR3_1</name>
                  <description>AXI strobe error happens on ocram bank3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_ERR0</name>
              <description>Ocram Access Error On Bank0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_ERR0_0</name>
                  <description>Ocram access error does not happen on ocram bank0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_ERR0_1</name>
                  <description>Ocram access error happens on ocram bank0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_ERR1</name>
              <description>Ocram Access Error On Bank1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_ERR1_0</name>
                  <description>Ocram access error does not happen on ocram bank1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_ERR1_1</name>
                  <description>Ocram access error happens on ocram bank1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_ERR2</name>
              <description>Ocram Access Error On Bank2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_ERR2_0</name>
                  <description>Ocram access error does not happen on ocram bank2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_ERR2_1</name>
                  <description>Ocram access error happens on ocram bank2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_ERR3</name>
              <description>Ocram Access Error On Bank3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_ERR3_0</name>
                  <description>Ocram access error does not happen on ocram bank3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_ERR3_1</name>
                  <description>Ocram access error happens on ocram bank3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
