nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="XECC_FLEXSPI1">
      <name>XECC_FLEXSPI2</name>
      <description>XECC</description>
      <groupName>XECC</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x5C</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="XECC_FLEXSPI1">
      <name>XECC_SEMC</name>
      <description>XECC</description>
      <groupName>XECC</groupName>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x5C</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>FLEXRAM</name>
      <description>FLEXRAM</description>
      <groupName>FLEXRAM</groupName>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x110</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXRAM</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>FLEXRAM_ECC</name>
        <value>98</value>
      </interrupt>
      <registers>
        <register>
          <name>TCM_CTRL</name>
          <description>TCM CRTL Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCM_WWAIT_EN</name>
              <description>TCM Write Wait Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCM_WWAIT_EN_0</name>
                  <description>TCM write fast mode: Write RAM accesses are expected to be finished in 1-cycle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM_WWAIT_EN_1</name>
                  <description>TCM write wait mode: Write RAM accesses are expected to be finished in 2-cycles.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCM_RWAIT_EN</name>
              <description>TCM Read Wait Mode Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCM_RWAIT_EN_0</name>
                  <description>TCM read fast mode: Read RAM accesses are expected to be finished in 1-cycle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM_RWAIT_EN_1</name>
                  <description>TCM read wait mode: Read RAM accesses are expected to be finished in 2-cycles.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE_CLK_ON</name>
              <description>Force RAM Clock Always On</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCRAM_MAGIC_ADDR</name>
          <description>OCRAM Magic Address Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCRAM_WR_RD_SEL</name>
              <description>OCRAM Write Read Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCRAM_WR_RD_SEL_0</name>
                  <description>When OCRAM read access hits magic address, it will generate interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCRAM_WR_RD_SEL_1</name>
                  <description>When OCRAM write access hits magic address, it will generate interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_MAGIC_ADDR</name>
              <description>OCRAM Magic Address</description>
              <bitOffset>1</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTCM_MAGIC_ADDR</name>
          <description>DTCM Magic Address Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTCM_WR_RD_SEL</name>
              <description>DTCM Write Read Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTCM_WR_RD_SEL_0</name>
                  <description>When DTCM read access hits magic address, it will generate interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTCM_WR_RD_SEL_1</name>
                  <description>When DTCM write access hits magic address, it will generate interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCM_MAGIC_ADDR</name>
              <description>DTCM Magic Address</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>17</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCM_MAGIC_ADDR</name>
          <description>ITCM Magic Address Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM_WR_RD_SEL</name>
              <description>ITCM Write Read Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM_WR_RD_SEL_0</name>
                  <description>When ITCM read access hits magic address, it will generate interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM_WR_RD_SEL_1</name>
                  <description>When ITCM write access hits magic address, it will generate interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITCM_MAGIC_ADDR</name>
              <description>ITCM Magic Address</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>17</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
