nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>ITCM_ECC_SINGLE_ERROR_DATA_LSB</name>
          <description>ITCM single-bit ECC Error Data Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM_ECCS_ERRED_DATA_LSB</name>
              <description>ITCM single-bit ECC error data [31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCM_ECC_SINGLE_ERROR_DATA_MSB</name>
          <description>ITCM single-bit ECC Error Data Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM_ECCS_ERRED_DATA_MSB</name>
              <description>ITCM single-bit ECC error data [63:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCM_ECC_MULTI_ERROR_INFO</name>
          <description>ITCM multi-bit ECC Error Information Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM_ECCM_EFW</name>
              <description>ITCM multi-bit ECC error corresponding tcm_wr value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ITCM_ECCM_EFSIZ</name>
              <description>ITCM multi-bit ECC error corresponding tcm access size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ITCM_ECCM_EFMST</name>
              <description>ITCM multi-bit ECC error corresponding tcm_master</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ITCM_ECCM_EFPRT</name>
              <description>ITCM multi-bit ECC error corresponding tcm_priv</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ITCM_ECCM_EFSYN</name>
              <description>ITCM multi-bit ECC error corresponding syndrome</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCM_ECC_MULTI_ERROR_ADDR</name>
          <description>ITCM multi-bit ECC Error Address Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM_ECCM_ERRED_ADDR</name>
              <description>ITCM multi-bit ECC error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCM_ECC_MULTI_ERROR_DATA_LSB</name>
          <description>ITCM multi-bit ECC Error Data Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM_ECCM_ERRED_DATA_LSB</name>
              <description>ITCM multi-bit ECC error data [31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCM_ECC_MULTI_ERROR_DATA_MSB</name>
          <description>ITCM multi-bit ECC Error Data Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM_ECCM_ERRED_DATA_MSB</name>
              <description>ITCM multi-bit ECC error data [63:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0TCM_ECC_SINGLE_ERROR_INFO</name>
          <description>D0TCM single-bit ECC Error Information Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D0TCM_ECCS_EFW</name>
              <description>D0TCM single-bit ECC error corresponding tcm_wr value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D0TCM_ECCS_EFSIZ</name>
              <description>D0TCM single-bit ECC error corresponding tcm access size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D0TCM_ECCS_EFMST</name>
              <description>D0TCM single-bit ECC error corresponding tcm_master</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D0TCM_ECCS_EFPRT</name>
              <description>D0TCM single-bit ECC error corresponding tcm_priv</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D0TCM_ECCS_EFSYN</name>
              <description>D0TCM single-bit ECC error corresponding syndrome</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0TCM_ECC_SINGLE_ERROR_ADDR</name>
          <description>D0TCM single-bit ECC Error Address Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D0TCM_ECCS_ERRED_ADDR</name>
              <description>D0TCM single-bit ECC error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0TCM_ECC_SINGLE_ERROR_DATA</name>
          <description>D0TCM single-bit ECC Error Data Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D0TCM_ECCS_ERRED_DATA</name>
              <description>D0TCM single-bit ECC error data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0TCM_ECC_MULTI_ERROR_INFO</name>
          <description>D0TCM multi-bit ECC Error Information Register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D0TCM_ECCM_EFW</name>
              <description>D0TCM multi-bit ECC error corresponding tcm_wr value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D0TCM_ECCM_EFSIZ</name>
              <description>D0TCM multi-bit ECC error corresponding tcm access size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D0TCM_ECCM_EFMST</name>
              <description>D0TCM multi-bit ECC error corresponding tcm_master</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D0TCM_ECCM_EFPRT</name>
              <description>D0TCM multi-bit ECC error corresponding tcm_priv</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D0TCM_ECCM_EFSYN</name>
              <description>D0TCM multi-bit ECC error corresponding syndrome</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0TCM_ECC_MULTI_ERROR_ADDR</name>
          <description>D0TCM multi-bit ECC Error Address Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D0TCM_ECCM_ERRED_ADDR</name>
              <description>D0TCM multi-bit ECC error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0TCM_ECC_MULTI_ERROR_DATA</name>
          <description>D0TCM multi-bit ECC Error Data Register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D0TCM_ECCM_ERRED_DATA</name>
              <description>D0TCM multi-bit ECC error data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D1TCM_ECC_SINGLE_ERROR_INFO</name>
          <description>D1TCM single-bit ECC Error Information Register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D1TCM_ECCS_EFW</name>
              <description>D1TCM single-bit ECC error corresponding tcm_wr value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D1TCM_ECCS_EFSIZ</name>
              <description>D1TCM single-bit ECC error corresponding tcm access size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D1TCM_ECCS_EFMST</name>
              <description>D1TCM single-bit ECC error corresponding tcm_master</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D1TCM_ECCS_EFPRT</name>
              <description>D1TCM single-bit ECC error corresponding tcm_priv</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D1TCM_ECCS_EFSYN</name>
              <description>D1TCM single-bit ECC error corresponding syndrome</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D1TCM_ECC_SINGLE_ERROR_ADDR</name>
          <description>D1TCM single-bit ECC Error Address Register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D1TCM_ECCS_ERRED_ADDR</name>
              <description>D1TCM single-bit ECC error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D1TCM_ECC_SINGLE_ERROR_DATA</name>
          <description>D1TCM single-bit ECC Error Data Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D1TCM_ECCS_ERRED_DATA</name>
              <description>D1TCM single-bit ECC error data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D1TCM_ECC_MULTI_ERROR_INFO</name>
          <description>D1TCM multi-bit ECC Error Information Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D1TCM_ECCM_EFW</name>
              <description>D1TCM multi-bit ECC error corresponding tcm_wr value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D1TCM_ECCM_EFSIZ</name>
              <description>D1TCM multi-bit ECC error corresponding tcm access size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D1TCM_ECCM_EFMST</name>
              <description>D1TCM multi-bit ECC error corresponding tcm_master</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D1TCM_ECCM_EFPRT</name>
              <description>D1TCM multi-bit ECC error corresponding tcm_priv</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>D1TCM_ECCM_EFSYN</name>
              <description>D1TCM multi-bit ECC error corresponding syndrome</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D1TCM_ECC_MULTI_ERROR_ADDR</name>
          <description>D1TCM multi-bit ECC Error Address Register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D1TCM_ECCM_ERRED_ADDR</name>
              <description>D1TCM multi-bit ECC error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D1TCM_ECC_MULTI_ERROR_DATA</name>
          <description>D1TCM multi-bit ECC Error Data Register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D1TCM_ECCM_ERRED_DATA</name>
              <description>D1TCM multi-bit ECC error data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXRAM_CTRL</name>
          <description>Flexram feature ECC and ocram wait pipeline can be configured through this register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCRAM_RDATA_WAIT_EN</name>
              <description>Read Data Wait Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCRAM_RADDR_PIPELINE_EN</name>
              <description>Read Address Pipeline Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCRAM_WRDATA_PIPELINE_EN</name>
              <description>Write Data Pipeline Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCRAM_WRADDR_PIPELINE_EN</name>
              <description>Write Address Pipeline Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCRAM_ECC_EN</name>
              <description>OCRAM ECC enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCM_ECC_EN</name>
              <description>TCM ECC enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCRAM_PIPELINE_STATUS</name>
          <description>Update pending signal for ocram wait and pipeline enable</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCRAM_RDATA_WAIT_EN_UPDATA_PENDING</name>
              <description>Read Data Wait Enable Pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCRAM_RADDR_PIPELINE_EN_UPDATA_PENDING</name>
              <description>Read Address Pipeline Enable Pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCRAM_WRDATA_PIPELINE_EN_UPDATA_PENDING</name>
              <description>Write Data Pipeline Enable Pending</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCRAM_WRADDR_PIPELINE_EN_UPDATA_PENDING</name>
              <description>Write Address Pipeline Enable Pending</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
