nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>CR2</name>
          <description>DAC Status and Control Register 2</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BFEN</name>
              <description>Buffer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BFEN_0</name>
                  <description>Opamp is not used as buffer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BFEN_1</name>
                  <description>Opamp is used as buffer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OEN</name>
              <description>Optional Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OEN_0</name>
                  <description>Output buffer is not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OEN_1</name>
                  <description>Output buffer is bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BFMS</name>
              <description>Buffer Middle Speed Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BFMS_0</name>
                  <description>Buffer middle speed not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BFMS_1</name>
                  <description>Buffer middle speed selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BFHS</name>
              <description>Buffer High Speed Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BFHS_0</name>
                  <description>Buffer high speed not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BFHS_1</name>
                  <description>Buffer high speed selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IREF2</name>
              <description>Internal PTAT (Proportional To Absolute Temperature) Current Reference Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IREF2_0</name>
                  <description>Internal PTAT Current Reference not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IREF2_1</name>
                  <description>Internal PTAT Current Reference selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IREF1</name>
              <description>Internal ZTC (Zero Temperature Coefficient) Current Reference Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IREF1_0</name>
                  <description>Internal ZTC Current Reference not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IREF1_1</name>
                  <description>Internal ZTC Current Reference selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IREF</name>
              <description>Internal Current Reference Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IREF_0</name>
                  <description>Internal Current Reference not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IREF_1</name>
                  <description>Internal Current Reference selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ITRM</name>
          <description>Internal Current Reference Trim Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM</name>
              <description>Internal Current Trim Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
