nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>BAUD</name>
          <description>LPUART Baud Rate Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SBR</name>
              <description>Baud Rate Modulo Divisor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SBNS</name>
              <description>Stop Bit Number Select</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SBNS_0</name>
                  <description>One stop bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SBNS_1</name>
                  <description>Two stop bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXEDGIE</name>
              <description>RX Input Active Edge Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXEDGIE_0</name>
                  <description>Hardware interrupts from STAT[RXEDGIF] are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXEDGIE_1</name>
                  <description>Hardware interrupt is requested when STAT[RXEDGIF] flag is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LBKDIE</name>
              <description>LIN Break Detect Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LBKDIE_0</name>
                  <description>Hardware interrupts from STAT[LBKDIF] flag are disabled (use polling).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBKDIE_1</name>
                  <description>Hardware interrupt requested when STAT[LBKDIF] flag is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESYNCDIS</name>
              <description>Resynchronization Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESYNCDIS_0</name>
                  <description>Resynchronization during received data word is supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESYNCDIS_1</name>
                  <description>Resynchronization during received data word is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOTHEDGE</name>
              <description>Both Edge Sampling</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTHEDGE_0</name>
                  <description>Receiver samples input data using the rising edge of the baud rate clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTHEDGE_1</name>
                  <description>Receiver samples input data using the rising and falling edge of the baud rate clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MATCFG</name>
              <description>Match Configuration</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MATCFG_0</name>
                  <description>Address Match Wakeup</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MATCFG_1</name>
                  <description>Idle Match Wakeup</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MATCFG_2</name>
                  <description>Match On and Match Off</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MATCFG_3</name>
                  <description>Enables RWU on Data Match and Match On/Off for transmitter CTS input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RIDMAE</name>
              <description>Receiver Idle DMA Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIDMAE_0</name>
                  <description>DMA request disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIDMAE_1</name>
                  <description>DMA request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDMAE</name>
              <description>Receiver Full DMA Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDMAE_0</name>
                  <description>DMA request disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDMAE_1</name>
                  <description>DMA request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDMAE</name>
              <description>Transmitter DMA Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TDMAE_0</name>
                  <description>DMA request disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDMAE_1</name>
                  <description>DMA request enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSR</name>
              <description>Oversampling Ratio</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSR_0</name>
                  <description>Writing 0 to this field results in an oversampling ratio of 16</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_3</name>
                  <description>Oversampling ratio of 4, requires BOTHEDGE to be set.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_4</name>
                  <description>Oversampling ratio of 5, requires BOTHEDGE to be set.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_5</name>
                  <description>Oversampling ratio of 6, requires BOTHEDGE to be set.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_6</name>
                  <description>Oversampling ratio of 7, requires BOTHEDGE to be set.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_7</name>
                  <description>Oversampling ratio of 8.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_8</name>
                  <description>Oversampling ratio of 9.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_9</name>
                  <description>Oversampling ratio of 10.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_10</name>
                  <description>Oversampling ratio of 11.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_11</name>
                  <description>Oversampling ratio of 12.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_12</name>
                  <description>Oversampling ratio of 13.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_13</name>
                  <description>Oversampling ratio of 14.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_14</name>
                  <description>Oversampling ratio of 15.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_15</name>
                  <description>Oversampling ratio of 16.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_16</name>
                  <description>Oversampling ratio of 17.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_17</name>
                  <description>Oversampling ratio of 18.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_18</name>
                  <description>Oversampling ratio of 19.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_19</name>
                  <description>Oversampling ratio of 20.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_20</name>
                  <description>Oversampling ratio of 21.</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_21</name>
                  <description>Oversampling ratio of 22.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_22</name>
                  <description>Oversampling ratio of 23.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_23</name>
                  <description>Oversampling ratio of 24.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_24</name>
                  <description>Oversampling ratio of 25.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_25</name>
                  <description>Oversampling ratio of 26.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_26</name>
                  <description>Oversampling ratio of 27.</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_27</name>
                  <description>Oversampling ratio of 28.</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_28</name>
                  <description>Oversampling ratio of 29.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_29</name>
                  <description>Oversampling ratio of 30.</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_30</name>
                  <description>Oversampling ratio of 31.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR_31</name>
                  <description>Oversampling ratio of 32.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M10</name>
              <description>10-bit Mode select</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M10_0</name>
                  <description>Receiver and transmitter use 7-bit to 9-bit data characters.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M10_1</name>
                  <description>Receiver and transmitter use 10-bit data characters.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAEN2</name>
              <description>Match Address Mode Enable 2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAEN2_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAEN2_1</name>
                  <description>Enables automatic address matching or data matching mode for MATCH[MA2].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAEN1</name>
              <description>Match Address Mode Enable 1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAEN1_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAEN1_1</name>
                  <description>Enables automatic address matching or data matching mode for MATCH[MA1].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
