nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>CTRL</name>
          <description>LPUART Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PT</name>
              <description>Parity Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT_0</name>
                  <description>Even parity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT_1</name>
                  <description>Odd parity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE</name>
              <description>Parity Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PE_0</name>
                  <description>No hardware parity generation or checking.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE_1</name>
                  <description>Parity enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ILT</name>
              <description>Idle Line Type Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ILT_0</name>
                  <description>Idle character bit count starts after start bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILT_1</name>
                  <description>Idle character bit count starts after stop bit.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKE</name>
              <description>Receiver Wakeup Method Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKE_0</name>
                  <description>Configures RWU for idle-line wakeup.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKE_1</name>
                  <description>Configures RWU with address-mark wakeup.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M</name>
              <description>9-Bit or 8-Bit Mode Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_0</name>
                  <description>Receiver and transmitter use 8-bit data characters.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_1</name>
                  <description>Receiver and transmitter use 9-bit data characters.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSRC</name>
              <description>Receiver Source Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSRC_0</name>
                  <description>Provided LOOPS is set, RSRC is cleared, selects internal loop back mode and the LPUART does not use the RXD pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSRC_1</name>
                  <description>Single-wire LPUART mode where the TXD pin is connected to the transmitter output and receiver input.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOZEEN</name>
              <description>Doze Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOZEEN_0</name>
                  <description>LPUART is enabled in Doze mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOZEEN_1</name>
                  <description>LPUART is disabled in Doze mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPS</name>
              <description>Loop Mode Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOOPS_0</name>
                  <description>Normal operation - RXD and TXD use separate pins.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPS_1</name>
                  <description>Loop mode or single-wire mode where transmitter outputs are internally connected to receiver input (see RSRC bit).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLECFG</name>
              <description>Idle Configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLECFG_0</name>
                  <description>1 idle character</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLECFG_1</name>
                  <description>2 idle characters</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLECFG_2</name>
                  <description>4 idle characters</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLECFG_3</name>
                  <description>8 idle characters</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLECFG_4</name>
                  <description>16 idle characters</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLECFG_5</name>
                  <description>32 idle characters</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLECFG_6</name>
                  <description>64 idle characters</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLECFG_7</name>
                  <description>128 idle characters</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7</name>
              <description>7-Bit Mode Select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_0</name>
                  <description>Receiver and transmitter use 8-bit to 10-bit data characters.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_1</name>
                  <description>Receiver and transmitter use 7-bit data characters.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MA2IE</name>
              <description>Match 2 Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MA2IE_0</name>
                  <description>MA2F interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MA2IE_1</name>
                  <description>MA2F interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MA1IE</name>
              <description>Match 1 Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MA1IE_0</name>
                  <description>MA1F interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MA1IE_1</name>
                  <description>MA1F interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBK</name>
              <description>Send Break</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SBK_0</name>
                  <description>Normal transmitter operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SBK_1</name>
                  <description>Queue break character(s) to be sent.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWU</name>
              <description>Receiver Wakeup Control</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWU_0</name>
                  <description>Normal receiver operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWU_1</name>
                  <description>LPUART receiver in standby waiting for wakeup condition.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RE</name>
              <description>Receiver Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RE_0</name>
                  <description>Receiver disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RE_1</name>
                  <description>Receiver enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TE</name>
              <description>Transmitter Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TE_0</name>
                  <description>Transmitter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TE_1</name>
                  <description>Transmitter enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ILIE</name>
              <description>Idle Line Interrupt Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ILIE_0</name>
                  <description>Hardware interrupts from IDLE disabled; use polling.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILIE_1</name>
                  <description>Hardware interrupt requested when IDLE flag is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RIE</name>
              <description>Receiver Interrupt Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIE_0</name>
                  <description>Hardware interrupts from RDRF disabled; use polling.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIE_1</name>
                  <description>Hardware interrupt requested when RDRF flag is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transmission Complete Interrupt Enable for</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCIE_0</name>
                  <description>Hardware interrupts from TC disabled; use polling.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCIE_1</name>
                  <description>Hardware interrupt requested when TC flag is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIE</name>
              <description>Transmit Interrupt Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIE_0</name>
                  <description>Hardware interrupts from TDRE disabled; use polling.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIE_1</name>
                  <description>Hardware interrupt requested when TDRE flag is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEIE</name>
              <description>Parity Error Interrupt Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEIE_0</name>
                  <description>PF interrupts disabled; use polling).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEIE_1</name>
                  <description>Hardware interrupt requested when PF is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FEIE</name>
              <description>Framing Error Interrupt Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FEIE_0</name>
                  <description>FE interrupts disabled; use polling.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEIE_1</name>
                  <description>Hardware interrupt requested when FE is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEIE</name>
              <description>Noise Error Interrupt Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEIE_0</name>
                  <description>NF interrupts disabled; use polling.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEIE_1</name>
                  <description>Hardware interrupt requested when NF is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ORIE</name>
              <description>Overrun Interrupt Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ORIE_0</name>
                  <description>OR interrupts disabled; use polling.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ORIE_1</name>
                  <description>Hardware interrupt requested when OR is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXINV</name>
              <description>Transmit Data Inversion</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXINV_0</name>
                  <description>Transmit data not inverted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXINV_1</name>
                  <description>Transmit data inverted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXDIR</name>
              <description>TXD Pin Direction in Single-Wire Mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXDIR_0</name>
                  <description>TXD pin is an input in single-wire mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXDIR_1</name>
                  <description>TXD pin is an output in single-wire mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R9T8</name>
              <description>Receive Bit 9 / Transmit Bit 8</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R8T9</name>
              <description>Receive Bit 8 / Transmit Bit 9</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
