nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="OTFAD1">
      <name>OTFAD2</name>
      <description>OTFAD</description>
      <alternatePeripheral>FLEXSPI2</alternatePeripheral>
      <groupName>OTFAD</groupName>
      <baseAddress>0x400D0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xDE0</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>SEMC</name>
      <description>SEMC</description>
      <groupName>SEMC</groupName>
      <baseAddress>0x400D4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x154</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SEMC</name>
        <value>132</value>
      </interrupt>
      <registers>
        <register>
          <name>MCR</name>
          <description>Module Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MDIS</name>
              <description>Module Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MDIS_0</name>
                  <description>Module enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDIS_1</name>
                  <description>Module disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DQSMD</name>
              <description>DQS (read strobe) mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DQSMD_0</name>
                  <description>Dummy read strobe loopbacked internally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DQSMD_1</name>
                  <description>Dummy read strobe loopbacked from DQS pad</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPOL0</name>
              <description>WAIT/RDY# polarity for NOR/PSRAM</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WPOL0_0</name>
                  <description>Active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPOL0_1</name>
                  <description>Active high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPOL1</name>
              <description>WAIT/RDY# polarity for NAND</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WPOL1_0</name>
                  <description>Active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPOL1_1</name>
                  <description>Active high</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTO</name>
              <description>Command Execution timeout cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTO</name>
              <description>Bus timeout cycles</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BTO_0</name>
                  <description>255*1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_1</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_2</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_3</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_4</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_5</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_6</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_7</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_8</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_9</name>
                  <description>255*2 - 255*2^30</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTO_31</name>
                  <description>255*2^31</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
