nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>IOCR</name>
          <description>IO Mux Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_A8</name>
              <description>SEMC_A8 output selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_A8_0</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_1</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_2</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_3</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_6</name>
                  <description>PSRAM CE# 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_8</name>
                  <description>PSRAM CE# 1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_9</name>
                  <description>PSRAM CE# 2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_10</name>
                  <description>PSRAM CE# 3</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_11</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_12</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_13</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_14</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_A8_15</name>
                  <description>SDRAM Address bit (A8)</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX0</name>
              <description>SEMC_CSX0 output selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX0_0</name>
                  <description>NOR/PSRAM Address bit 24 (A24)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_6</name>
                  <description>PSRAM CE# 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_8</name>
                  <description>PSRAM CE# 1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_9</name>
                  <description>PSRAM CE# 2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_10</name>
                  <description>PSRAM CE# 3</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_11</name>
                  <description>NOR/PSRAM Address bit 24 (A24)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_12</name>
                  <description>NOR/PSRAM Address bit 24 (A24)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_13</name>
                  <description>NOR/PSRAM Address bit 24 (A24)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_14</name>
                  <description>NOR/PSRAM Address bit 24 (A24)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX0_15</name>
                  <description>NOR/PSRAM Address bit 24 (A24)</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX1</name>
              <description>SEMC_CSX1 output selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX1_0</name>
                  <description>NOR/PSRAM Address bit 25 (A25)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_6</name>
                  <description>PSRAM CE# 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_8</name>
                  <description>PSRAM CE# 1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_9</name>
                  <description>PSRAM CE# 2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_10</name>
                  <description>PSRAM CE# 3</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_11</name>
                  <description>NOR/PSRAM Address bit 25 (A25)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_12</name>
                  <description>NOR/PSRAM Address bit 25 (A25)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_13</name>
                  <description>NOR/PSRAM Address bit 25 (A25)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_14</name>
                  <description>NOR/PSRAM Address bit 25 (A25)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX1_15</name>
                  <description>NOR/PSRAM Address bit 25 (A25)</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX2</name>
              <description>SEMC_CSX2 output selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX2_0</name>
                  <description>NOR/PSRAM Address bit 26 (A26)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_6</name>
                  <description>PSRAM CE# 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_8</name>
                  <description>PSRAM CE# 1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_9</name>
                  <description>PSRAM CE# 2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_10</name>
                  <description>PSRAM CE# 3</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_11</name>
                  <description>NOR/PSRAM Address bit 26 (A26)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_12</name>
                  <description>NOR/PSRAM Address bit 26 (A26)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_13</name>
                  <description>NOR/PSRAM Address bit 26 (A26)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_14</name>
                  <description>NOR/PSRAM Address bit 26 (A26)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX2_15</name>
                  <description>NOR/PSRAM Address bit 26 (A26)</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CSX3</name>
              <description>SEMC_CSX3 output selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CSX3_0</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_4</name>
                  <description>NAND CE#</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_6</name>
                  <description>PSRAM CE# 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_8</name>
                  <description>PSRAM CE# 1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_9</name>
                  <description>PSRAM CE# 2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_10</name>
                  <description>PSRAM CE# 3</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_11</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_12</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_13</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_14</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CSX3_15</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_RDY</name>
              <description>SEMC_RDY function selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_RDY_0</name>
                  <description>NAND Ready/Wait# input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_1</name>
                  <description>SDRAM CS1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_2</name>
                  <description>SDRAM CS2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_3</name>
                  <description>SDRAM CS3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_4</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_5</name>
                  <description>NOR CE#</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_6</name>
                  <description>PSRAM CE# 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_7</name>
                  <description>DBI CSX</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_8</name>
                  <description>PSRAM CE# 1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_9</name>
                  <description>PSRAM CE# 2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_10</name>
                  <description>PSRAM CE# 3</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_11</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_12</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_13</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_14</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_RDY_15</name>
                  <description>NOR/PSRAM Address bit 27 (A27)</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CLKX0</name>
              <description>SEMC_CLKX0 function selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_CLKX0_0</name>
                  <description>Keep low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CLKX0_1</name>
                  <description>NOR clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CLKX0_2</name>
                  <description>SRAM clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_CLKX0_3</name>
                  <description>NOR and SRAM clock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_CLKX1</name>
              <description>SEMC_CLKX1 function selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
