nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SDRAMCR1</name>
          <description>SDRAM control register 1</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x994934</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE2ACT</name>
              <description>PRECHARGE to ACT/Refresh wait time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACT2RW</name>
              <description>ACT to Read/Write wait time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFRC</name>
              <description>Refresh recovery time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRC</name>
              <description>Write recovery time</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEOFF</name>
              <description>CKE OFF minimum time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACT2PRE</name>
              <description>ACT to Precharge minimum time</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRAMCR2</name>
          <description>SDRAM control register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000EEE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRRC</name>
              <description>Self Refresh Recovery time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF2REF</name>
              <description>Refresh to Refresh wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACT2ACT</name>
              <description>ACT to ACT wait time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITO</name>
              <description>SDRAM Idle timeout</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITO_0</name>
                  <description>IDLE timeout period is 256*Prescale period.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_1</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_2</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_3</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_4</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_5</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_6</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_7</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_8</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_9</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRAMCR3</name>
          <description>SDRAM control register 3</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40808000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REN</name>
              <description>Refresh enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REBL</name>
              <description>Refresh burst length</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REBL_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_1</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_2</name>
                  <description>3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_3</name>
                  <description>4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_4</name>
                  <description>5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_5</name>
                  <description>6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_6</name>
                  <description>7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_7</name>
                  <description>8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCALE</name>
              <description>Prescaler timer period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESCALE_0</name>
                  <description>256*16 clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_1</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_2</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_3</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_4</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_5</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_6</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_7</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_8</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_9</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT</name>
              <description>Refresh timer period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT_0</name>
                  <description>256*Prescaler period</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_1</name>
                  <description>RT*Prescaler period</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_2</name>
                  <description>RT*Prescaler period</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_3</name>
                  <description>RT*Prescaler period</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_4</name>
                  <description>RT*Prescaler period</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_5</name>
                  <description>RT*Prescaler period</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_6</name>
                  <description>RT*Prescaler period</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_7</name>
                  <description>RT*Prescaler period</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_8</name>
                  <description>RT*Prescaler period</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_9</name>
                  <description>RT*Prescaler period</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UT</name>
              <description>Refresh urgent threshold</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UT_0</name>
                  <description>256*Prescaler period</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_1</name>
                  <description>UT*Prescaler period</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_2</name>
                  <description>UT*Prescaler period</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_3</name>
                  <description>UT*Prescaler period</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_4</name>
                  <description>UT*Prescaler period</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_5</name>
                  <description>UT*Prescaler period</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_6</name>
                  <description>UT*Prescaler period</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_7</name>
                  <description>UT*Prescaler period</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_8</name>
                  <description>UT*Prescaler period</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_9</name>
                  <description>UT*Prescaler period</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NANDCR0</name>
          <description>NAND control register 0</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS</name>
              <description>Port Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PS_0</name>
                  <description>8bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS_1</name>
                  <description>16bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Select NAND controller mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCEN_0</name>
                  <description>ASYNC mode is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCEN_1</name>
                  <description>SYNC mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BL</name>
              <description>Burst Length</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BL_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_1</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_2</name>
                  <description>4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_3</name>
                  <description>8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_4</name>
                  <description>16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_5</name>
                  <description>32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_6</name>
                  <description>64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_7</name>
                  <description>64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDO</name>
              <description>EDO mode enabled</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDO_0</name>
                  <description>EDO mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDO_1</name>
                  <description>EDO mode enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COL</name>
              <description>Column address bit number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COL_0</name>
                  <description>16</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_1</name>
                  <description>15</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_2</name>
                  <description>14</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_3</name>
                  <description>13</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_4</name>
                  <description>12</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_5</name>
                  <description>11</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_6</name>
                  <description>10</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_7</name>
                  <description>9</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NANDCR1</name>
          <description>NAND control register 1</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CES</name>
              <description>CE setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEH</name>
              <description>CE hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEL</name>
              <description>WE# low time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEH</name>
              <description>WE# high time</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REL</name>
              <description>RE# low time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REH</name>
              <description>RE# high time</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TA</name>
              <description>Turnaround time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEITV</name>
              <description>CE# interval time</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
