nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>GPR13</name>
          <description>GPR13 General Purpose Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QTIMER2_TMR_CNTS_FREEZE</name>
              <description>QTIMER2 timer counter freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER2_TRM0_INPUT_SEL</name>
              <description>QTIMER2 TMR0 input select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER2_TRM1_INPUT_SEL</name>
              <description>QTIMER2 TMR1 input select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER2_TRM2_INPUT_SEL</name>
              <description>QTIMER2 TMR2 input select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER2_TRM3_INPUT_SEL</name>
              <description>QTIMER2 TMR3 input select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR14</name>
          <description>GPR14 General Purpose Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QTIMER3_TMR_CNTS_FREEZE</name>
              <description>QTIMER3 timer counter freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER3_TRM0_INPUT_SEL</name>
              <description>QTIMER3 TMR0 input select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER3_TRM1_INPUT_SEL</name>
              <description>QTIMER3 TMR1 input select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER3_TRM2_INPUT_SEL</name>
              <description>QTIMER3 TMR2 input select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER3_TRM3_INPUT_SEL</name>
              <description>QTIMER3 TMR3 input select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR15</name>
          <description>GPR15 General Purpose Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QTIMER4_TMR_CNTS_FREEZE</name>
              <description>QTIMER4 timer counter freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER4_TRM0_INPUT_SEL</name>
              <description>QTIMER4 TMR0 input select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER4_TRM1_INPUT_SEL</name>
              <description>QTIMER4 TMR1 input select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER4_TRM2_INPUT_SEL</name>
              <description>QTIMER4 TMR2 input select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QTIMER4_TRM3_INPUT_SEL</name>
              <description>QTIMER4 TMR3 input select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR16</name>
          <description>GPR16 General Purpose Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAA03</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXRAM_BANK_CFG_SEL</name>
              <description>FlexRAM bank config source select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CM7_FORCE_HCLK_EN</name>
              <description>CM7 platform AHB clock enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M7_GPC_SLEEP_SEL</name>
              <description>CM7 sleep request selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR17</name>
          <description>GPR17 General Purpose Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXRAM_BANK_CFG_LOW</name>
              <description>FlexRAM bank config value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR18</name>
          <description>GPR18 General Purpose Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXRAM_BANK_CFG_HIGH</name>
              <description>FlexRAM bank config value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
