nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>GPR68</name>
          <description>GPR68 General Purpose Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_SD2_FREEZE</name>
              <description>Compensation code freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SD2_COMPTQ</name>
              <description>COMPEN and COMPTQ control the operating modes of the compensation cell</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SD2_COMPEN</name>
              <description>COMPEN and COMPTQ control the operating modes of the compensation cell</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SD2_FASTFRZ_EN</name>
              <description>Compensation code fast freeze</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SD2_RASRCP</name>
              <description>GPIO_SD_B2 IO bank's 4-bit PMOS compensation codes from core</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SD2_RASRCN</name>
              <description>GPIO_SD_B2 IO bank's 4-bit NMOS compensation codes from core</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SD2_SELECT_NASRC</name>
              <description>GPIO_SD2_NASRC selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SD2_REFGEN_SLEEP</name>
              <description>GPIO_SD_B2 IO bank reference voltage generator cell sleep enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SD2_SUPLYDET_LATCH</name>
              <description>GPIO_SD_B2 IO bank power supply mode latch enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SD2_COMPOK</name>
              <description>GPIO_SD_B2 IO bank compensation OK flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_SD2_NASRC</name>
              <description>GPIO_SD_B2 IO bank compensation codes</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR69</name>
          <description>GPR69 General Purpose Register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_DISP2_HIGH_RANGE</name>
              <description>GPIO_DISP_B2 IO bank supply voltage range selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_DISP2_LOW_RANGE</name>
              <description>GPIO_DISP_B2 IO bank supply voltage range selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_AD0_HIGH_RANGE</name>
              <description>GPIO_AD IO bank supply voltage range selection for GPIO_AD_00 to GPIO_AD_17</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_AD0_LOW_RANGE</name>
              <description>GPIO_AD IO bank supply voltage range selection for GPIO_AD_00 to GPIO_AD_17</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_AD1_HIGH_RANGE</name>
              <description>GPIO_LPSR IO bank supply voltage range selection for GPIO_AD_18 to GPIO_AD_35</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_AD1_LOW_RANGE</name>
              <description>GPIO_LPSR IO bank supply voltage range selection for GPIO_AD_18 to GPIO_AD_35</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUPLYDET_DISP1_SLEEP</name>
              <description>GPIO_DISP_B1 IO bank supply voltage detector sleep mode enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUPLYDET_EMC1_SLEEP</name>
              <description>GPIO_EMC_B1 IO bank supply voltage detector sleep mode enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUPLYDET_EMC2_SLEEP</name>
              <description>GPIO_EMC_B2 IO bank supply voltage detector sleep mode enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUPLYDET_SD1_SLEEP</name>
              <description>GPIO_SD_B1 IO bank supply voltage detector sleep mode enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUPLYDET_SD2_SLEEP</name>
              <description>GPIO_SD_B2 IO bank supply voltage detector sleep mode enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR70</name>
          <description>GPR70 General Purpose Register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC1_IPG_DOZE</name>
              <description>ADC2 doze mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_STOP_REQ</name>
              <description>ADC2 stop request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_IPG_STOP_MODE</name>
              <description>ADC2 stop mode selection, cannot change when ADC2_STOP_REQ is asserted.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_IPG_DOZE</name>
              <description>ADC2 doze mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_STOP_REQ</name>
              <description>ADC2 stop request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_IPG_STOP_MODE</name>
              <description>ADC2 stop mode selection, cannot change when ADC2_STOP_REQ is asserted.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAAM_IPG_DOZE</name>
              <description>CAN3 doze mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAAM_STOP_REQ</name>
              <description>CAAM stop request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN1_IPG_DOZE</name>
              <description>CAN1 doze mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN1_STOP_REQ</name>
              <description>CAN1 stop request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN2_IPG_DOZE</name>
              <description>CAN2 doze mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN2_STOP_REQ</name>
              <description>CAN2 stop request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN3_IPG_DOZE</name>
              <description>CAN3 doze mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN3_STOP_REQ</name>
              <description>CAN3 stop request</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDMA_STOP_REQ</name>
              <description>EDMA stop request</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDMA_LPSR_STOP_REQ</name>
              <description>EDMA_LPSR stop request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET_IPG_DOZE</name>
              <description>ENET doze mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET_STOP_REQ</name>
              <description>ENET stop request</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET1G_IPG_DOZE</name>
              <description>ENET1G doze mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET1G_STOP_REQ</name>
              <description>ENET1G stop request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXIO1_IPG_DOZE</name>
              <description>FLEXIO2 doze mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXIO2_IPG_DOZE</name>
              <description>FLEXIO2 doze mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXSPI1_IPG_DOZE</name>
              <description>FLEXSPI1 doze mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXSPI1_STOP_REQ</name>
              <description>FLEXSPI1 stop request</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXSPI2_IPG_DOZE</name>
              <description>FLEXSPI2 doze mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXSPI2_STOP_REQ</name>
              <description>FLEXSPI2 stop request</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
