nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_08</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_08 SW MUX Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DM0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DM00 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm2_PWMA1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM2_PWM1_A of instance: FLEXPWM2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO8</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO08 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO8</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D08 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO8</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO08 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_08</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_09</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_09 SW MUX Control Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR00 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm2_PWMB1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM2_PWM1_B of instance: FLEXPWM2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt5_CAPTURE1</name>
                  <description>Select mux mode: ALT2 mux port: GPT5_CAPTURE1 of instance: GPT5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO9</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO09 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO9</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D09 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO9</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO09 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_09</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_10</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_10 SW MUX Control Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR1</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR01 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm2_PWMA2</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM2_PWM2_A of instance: FLEXPWM2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt5_CAPTURE2</name>
                  <description>Select mux mode: ALT2 mux port: GPT5_CAPTURE2 of instance: GPT5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO10</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO10 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO10</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D10 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO10</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO10 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_10</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_11</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_11 SW MUX Control Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR2</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR02 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm2_PWMB2</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM2_PWM2_B of instance: FLEXPWM2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt5_COMPARE1</name>
                  <description>Select mux mode: ALT2 mux port: GPT5_COMPARE1 of instance: GPT5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO11</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO11 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO11</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D11 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO11</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO11 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_12</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_12 SW MUX Control Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR3</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR03 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_XBAR1_INOUT4</name>
                  <description>Select mux mode: ALT1 mux port: XBAR1_INOUT04 of instance: XBAR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt5_COMPARE2</name>
                  <description>Select mux mode: ALT2 mux port: GPT5_COMPARE2 of instance: GPT5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO12</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO12 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO12</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D12 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO12</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO12 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_12</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_13</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_13 SW MUX Control Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR4</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR04 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_XBAR1_INOUT5</name>
                  <description>Select mux mode: ALT1 mux port: XBAR1_INOUT05 of instance: XBAR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt5_COMPARE3</name>
                  <description>Select mux mode: ALT2 mux port: GPT5_COMPARE3 of instance: GPT5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO13</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO13 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO13</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D13 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO13</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO13 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_13</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_14</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_14 SW MUX Control Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR5</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR05 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_XBAR1_INOUT6</name>
                  <description>Select mux mode: ALT1 mux port: XBAR1_INOUT06 of instance: XBAR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt5_CLK</name>
                  <description>Select mux mode: ALT2 mux port: GPT5_CLK of instance: GPT5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO14</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO14 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO14</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D14 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO14</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO14 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_14</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
