nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_12</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_12 SW MUX Control Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA27</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA27 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_spdif_OUT</name>
                  <description>Select mux mode: ALT1 mux port: SPDIF_OUT of instance: SPDIF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_TX_DATA1</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_TX_DATA01 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_sai3_RX_BCLK</name>
                  <description>Select mux mode: ALT3 mux port: SAI3_RX_BCLK of instance: SAI3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_A_DQS</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_A_DQS of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO22</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO22 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT32</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT32 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_EMVSIM1_CLK</name>
                  <description>Select mux mode: ALT8 mux port: EMVSIM1_CLK of instance: EMVSIM1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer1_TIMER3</name>
                  <description>Select mux mode: ALT9 mux port: TMR1_TIMER3 of instance: TMR1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO22</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO22 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_12</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_13</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_13 SW MUX Control Register</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA28</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA28 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_TX_EN</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_TX_EN of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_sai3_RX_DATA</name>
                  <description>Select mux mode: ALT3 mux port: SAI3_RX_DATA of instance: SAI3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_A_DATA0</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_A_DATA00 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO23</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO23 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT33</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT33 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_EMVSIM1_RST_B</name>
                  <description>Select mux mode: ALT8 mux port: EMVSIM1_RST of instance: EMVSIM1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer2_TIMER0</name>
                  <description>Select mux mode: ALT9 mux port: TMR2_TIMER0 of instance: TMR2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO23</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO23 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_13</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_14</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_14 SW MUX Control Register</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA29</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA29 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_TX_CLK_IO</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_TX_CLK_IO of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_sai3_TX_DATA</name>
                  <description>Select mux mode: ALT3 mux port: SAI3_TX_DATA of instance: SAI3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_A_DATA1</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_A_DATA01 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO24</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO24 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT34</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT34 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_sfa_ipp_do_atx_clk_under_test</name>
                  <description>Select mux mode: ALT7 mux port: SFA_ipp_do_atx_clk_under_test of instance: sfa</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_EMVSIM1_SVEN</name>
                  <description>Select mux mode: ALT8 mux port: EMVSIM1_SVEN of instance: EMVSIM1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer2_TIMER1</name>
                  <description>Select mux mode: ALT9 mux port: TMR2_TIMER1 of instance: TMR2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO24</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO24 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_14</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_15</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_15 SW MUX Control Register</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA30</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA30 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_RX_DATA0</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_RX_DATA00 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_sai3_TX_BCLK</name>
                  <description>Select mux mode: ALT3 mux port: SAI3_TX_BCLK of instance: SAI3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_A_DATA2</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_A_DATA02 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO25</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO25 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT35</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT35 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_EMVSIM1_PD</name>
                  <description>Select mux mode: ALT8 mux port: EMVSIM1_PD of instance: EMVSIM1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer2_TIMER2</name>
                  <description>Select mux mode: ALT9 mux port: TMR2_TIMER2 of instance: TMR2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO25</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO25 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_15</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_16</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_16 SW MUX Control Register</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA31</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA31 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_XBAR1_INOUT14</name>
                  <description>Select mux mode: ALT1 mux port: XBAR1_INOUT14 of instance: XBAR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_RX_DATA1</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_RX_DATA01 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_sai3_TX_SYNC</name>
                  <description>Select mux mode: ALT3 mux port: SAI3_TX_SYNC of instance: SAI3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_A_DATA3</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_A_DATA03 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO26</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO26 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_EMVSIM1_POWER_FAIL</name>
                  <description>Select mux mode: ALT8 mux port: EMVSIM1_POWER_FAIL of instance: EMVSIM1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer2_TIMER3</name>
                  <description>Select mux mode: ALT9 mux port: TMR2_TIMER3 of instance: TMR2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO26</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO26 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_16</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
