nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_16</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_16 SW MUX Control Register</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_spdif_OUT</name>
                  <description>Select mux mode: ALT0 mux port: SPDIF_OUT of instance: SPDIF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpuart10_RX</name>
                  <description>Select mux mode: ALT1 mux port: LPUART10_RXD of instance: LPUART10</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt1_COMPARE3</name>
                  <description>Select mux mode: ALT2 mux port: GPT1_COMPARE3 of instance: GPT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_B_SCLK</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_B_SCLK of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA9</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA09 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO15</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO15 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_ENET_RX_DATA3</name>
                  <description>Select mux mode: ALT6 mux port: ENET_RX_DATA03 of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO16</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D16 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_1g_MDC</name>
                  <description>Select mux mode: ALT9 mux port: ENET_1G_MDC of instance: ENET_1G</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO15</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO15 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMX2</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM2_X of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_16</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_17</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_17 SW MUX Control Register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_sai1_MCLK</name>
                  <description>Select mux mode: ALT0 mux port: SAI1_MCLK of instance: SAI1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ACMP1_OUT</name>
                  <description>Select mux mode: ALT1 mux port: ACMP1_OUT of instance: ACMP1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt1_CLK</name>
                  <description>Select mux mode: ALT2 mux port: GPT1_CLK of instance: GPT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_A_DQS</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_A_DQS of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA8</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA08 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO16</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO16 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_ENET_RX_DATA2</name>
                  <description>Select mux mode: ALT6 mux port: ENET_RX_DATA02 of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO17</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D17 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_1g_MDIO</name>
                  <description>Select mux mode: ALT9 mux port: ENET_1G_MDIO of instance: ENET_1G</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO16</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO16 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMX3</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM3_X of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_17</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_18</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_18 SW MUX Control Register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_sai1_RX_SYNC</name>
                  <description>Select mux mode: ALT0 mux port: SAI1_RX_SYNC of instance: SAI1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ACMP2_OUT</name>
                  <description>Select mux mode: ALT1 mux port: ACMP2_OUT of instance: ACMP2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpspi1_PCS1</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI1_PCS1 of instance: LPSPI1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_A_SS0_B</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_A_SS0_B of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA7</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA07 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO17</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO17 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_enet_CRS</name>
                  <description>Select mux mode: ALT6 mux port: ENET_CRS of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO18</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D18 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpi2c2_SCL</name>
                  <description>Select mux mode: ALT9 mux port: LPI2C2_SCL of instance: LPI2C2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO17</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO17 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm4_PWMX0</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM4_PWM0_X of instance: FLEXPWM4</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_18</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_19</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_19 SW MUX Control Register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_sai1_RX_BCLK</name>
                  <description>Select mux mode: ALT0 mux port: SAI1_RX_BCLK of instance: SAI1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ACMP3_OUT</name>
                  <description>Select mux mode: ALT1 mux port: ACMP3_OUT of instance: ACMP3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpspi1_PCS2</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI1_PCS2 of instance: LPSPI1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_A_SCLK</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_A_SCLK of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA6</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA06 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO18</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO18 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_enet_COL</name>
                  <description>Select mux mode: ALT6 mux port: ENET_COL of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO19</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D19 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpi2c2_SDA</name>
                  <description>Select mux mode: ALT9 mux port: LPI2C2_SDA of instance: LPI2C2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO18</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO18 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm4_PWMX1</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM4_PWM1_X of instance: FLEXPWM4</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_19</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_20</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_20 SW MUX Control Register</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_sai1_RX_DATA0</name>
                  <description>Select mux mode: ALT0 mux port: SAI1_RX_DATA00 of instance: SAI1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ACMP4_OUT</name>
                  <description>Select mux mode: ALT1 mux port: ACMP4_OUT of instance: ACMP4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpspi1_PCS3</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI1_PCS3 of instance: LPSPI1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_A_DATA0</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_A_DATA00 of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA5</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA05 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO19</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO19 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_ROW7</name>
                  <description>Select mux mode: ALT6 mux port: KPP_ROW07 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO20</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D20 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_qos_1588_EVENT2_OUT</name>
                  <description>Select mux mode: ALT9 mux port: ENET_QOS_1588_EVENT2_OUT of instance: ENET_QOS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO19</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO19 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm4_PWMX2</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM4_PWM2_X of instance: FLEXPWM4</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_20</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
