nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_21</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_21 SW MUX Control Register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_sai1_TX_DATA0</name>
                  <description>Select mux mode: ALT0 mux port: SAI1_TX_DATA00 of instance: SAI1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpspi2_PCS1</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI2_PCS1 of instance: LPSPI2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_A_DATA1</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_A_DATA01 of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA4</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA04 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO20</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO20 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_COL7</name>
                  <description>Select mux mode: ALT6 mux port: KPP_COL07 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO21</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D21 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_qos_1588_EVENT2_IN</name>
                  <description>Select mux mode: ALT9 mux port: ENET_QOS_1588_EVENT2_IN of instance: ENET_QOS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO20</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO20 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm4_PWMX3</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM4_PWM3_X of instance: FLEXPWM4</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_21</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_22</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_22 SW MUX Control Register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_sai1_TX_BCLK</name>
                  <description>Select mux mode: ALT0 mux port: SAI1_TX_BCLK of instance: SAI1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpspi2_PCS2</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI2_PCS2 of instance: LPSPI2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_A_DATA2</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_A_DATA02 of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA3</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA03 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO21</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO21 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_ROW6</name>
                  <description>Select mux mode: ALT6 mux port: KPP_ROW06 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO22</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D22 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_qos_1588_EVENT3_OUT</name>
                  <description>Select mux mode: ALT9 mux port: ENET_QOS_1588_EVENT3_OUT of instance: ENET_QOS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO21</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO21 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_22</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_23</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_23 SW MUX Control Register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_sai1_TX_SYNC</name>
                  <description>Select mux mode: ALT0 mux port: SAI1_TX_SYNC of instance: SAI1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpspi2_PCS3</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI2_PCS3 of instance: LPSPI2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_A_DATA3</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_A_DATA03 of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA2</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA02 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO22</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO22 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_COL6</name>
                  <description>Select mux mode: ALT6 mux port: KPP_COL06 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO23</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D23 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_qos_1588_EVENT3_IN</name>
                  <description>Select mux mode: ALT9 mux port: ENET_QOS_1588_EVENT3_IN of instance: ENET_QOS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO22</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO22 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_23</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_24</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_24 SW MUX Control Register</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpuart1_TX</name>
                  <description>Select mux mode: ALT0 mux port: LPUART1_TXD of instance: LPUART1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpspi2_SCK</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI2_SCK of instance: LPSPI2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_video_mux_CSI_DATA0</name>
                  <description>Select mux mode: ALT2 mux port: VIDEO_MUX_CSI_DATA00 of instance: VIDEO_MUX</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_enet_RX_EN</name>
                  <description>Select mux mode: ALT3 mux port: ENET_RX_EN of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm2_PWMA0</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM2_PWM0_A of instance: FLEXPWM2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO23</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO23 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_ROW5</name>
                  <description>Select mux mode: ALT6 mux port: KPP_ROW05 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO24</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D24 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpi2c4_SCL</name>
                  <description>Select mux mode: ALT9 mux port: LPI2C4_SCL of instance: LPI2C4</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO23</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO23 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_24</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_25</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_25 SW MUX Control Register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpuart1_RX</name>
                  <description>Select mux mode: ALT0 mux port: LPUART1_RXD of instance: LPUART1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpspi2_PCS0</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI2_PCS0 of instance: LPSPI2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_video_mux_CSI_DATA1</name>
                  <description>Select mux mode: ALT2 mux port: VIDEO_MUX_CSI_DATA01 of instance: VIDEO_MUX</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_enet_RX_ER</name>
                  <description>Select mux mode: ALT3 mux port: ENET_RX_ER of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm2_PWMB0</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM2_PWM0_B of instance: FLEXPWM2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO24</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO24 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_COL5</name>
                  <description>Select mux mode: ALT6 mux port: KPP_COL05 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO25</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D25 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpi2c4_SDA</name>
                  <description>Select mux mode: ALT9 mux port: LPI2C4_SDA of instance: LPI2C4</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO24</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO24 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_25</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
