nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_26</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_26 SW MUX Control Register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpuart1_CTS_B</name>
                  <description>Select mux mode: ALT0 mux port: LPUART1_CTS_B of instance: LPUART1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpspi2_SDO</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI2_SOUT of instance: LPSPI2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_semc_CSX1</name>
                  <description>Select mux mode: ALT2 mux port: SEMC_CSX01 of instance: SEMC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ENET_RX_DATA0</name>
                  <description>Select mux mode: ALT3 mux port: ENET_RX_DATA00 of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm2_PWMA1</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM2_PWM1_A of instance: FLEXPWM2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO25</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO25 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_ROW4</name>
                  <description>Select mux mode: ALT6 mux port: KPP_ROW04 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO26</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D26 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_qos_MDC</name>
                  <description>Select mux mode: ALT9 mux port: ENET_QOS_MDC of instance: ENET_QOS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO25</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO25 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_usdhc2_CD_B</name>
                  <description>Select mux mode: ALT11 mux port: USDHC2_CD_B of instance: USDHC2</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_26</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_27</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_27 SW MUX Control Register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpuart1_RTS_B</name>
                  <description>Select mux mode: ALT0 mux port: LPUART1_RTS_B of instance: LPUART1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpspi2_SDI</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI2_SIN of instance: LPSPI2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_semc_CSX2</name>
                  <description>Select mux mode: ALT2 mux port: SEMC_CSX02 of instance: SEMC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ENET_RX_DATA1</name>
                  <description>Select mux mode: ALT3 mux port: ENET_RX_DATA01 of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm2_PWMB1</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM2_PWM1_B of instance: FLEXPWM2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO26</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO26 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_COL4</name>
                  <description>Select mux mode: ALT6 mux port: KPP_COL04 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO27</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D27 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_qos_MDIO</name>
                  <description>Select mux mode: ALT9 mux port: ENET_QOS_MDIO of instance: ENET_QOS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO26</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO26 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_usdhc2_WP</name>
                  <description>Select mux mode: ALT11 mux port: USDHC2_WP of instance: USDHC2</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_27</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_28</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_28 SW MUX Control Register</description>
          <addressOffset>0x17C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpspi1_SCK</name>
                  <description>Select mux mode: ALT0 mux port: LPSPI1_SCK of instance: LPSPI1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpuart5_TX</name>
                  <description>Select mux mode: ALT1 mux port: LPUART5_TXD of instance: LPUART5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_semc_CSX3</name>
                  <description>Select mux mode: ALT2 mux port: SEMC_CSX03 of instance: SEMC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_enet_TX_EN</name>
                  <description>Select mux mode: ALT3 mux port: ENET_TX_EN of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm2_PWMA2</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM2_PWM2_A of instance: FLEXPWM2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO27</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO27 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_ROW3</name>
                  <description>Select mux mode: ALT6 mux port: KPP_ROW03 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO28</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D28 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_video_mux_EXT_DCIC1</name>
                  <description>Select mux mode: ALT9 mux port: VIDEO_MUX_EXT_DCIC1 of instance: VIDEO_MUX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO27</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO27 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_usdhc2_VSELECT</name>
                  <description>Select mux mode: ALT11 mux port: USDHC2_VSELECT of instance: USDHC2</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_28</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_29</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_29 SW MUX Control Register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpspi1_PCS0</name>
                  <description>Select mux mode: ALT0 mux port: LPSPI1_PCS0 of instance: LPSPI1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpuart5_RX</name>
                  <description>Select mux mode: ALT1 mux port: LPUART5_RXD of instance: LPUART5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_REF_CLK1</name>
                  <description>Select mux mode: ALT2 mux port: ENET_REF_CLK1 of instance: ENET</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_enet_TX_CLK</name>
                  <description>Select mux mode: ALT3 mux port: ENET_TX_CLK of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm2_PWMB2</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM2_PWM2_B of instance: FLEXPWM2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO28</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO28 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_COL3</name>
                  <description>Select mux mode: ALT6 mux port: KPP_COL03 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO29</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D29 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_video_mux_EXT_DCIC2</name>
                  <description>Select mux mode: ALT9 mux port: VIDEO_MUX_EXT_DCIC2 of instance: VIDEO_MUX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO28</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO28 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_usdhc2_RESET_B</name>
                  <description>Select mux mode: ALT11 mux port: USDHC2_RESET_B of instance: USDHC2</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_29</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_30</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_30 SW MUX Control Register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpspi1_SDO</name>
                  <description>Select mux mode: ALT0 mux port: LPSPI1_SOUT of instance: LPSPI1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_usb_OTG2_OC</name>
                  <description>Select mux mode: ALT1 mux port: USB_OTG2_OC of instance: USB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_can2_TX</name>
                  <description>Select mux mode: ALT2 mux port: FLEXCAN2_TX of instance: FLEXCAN2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ENET_TX_DATA0</name>
                  <description>Select mux mode: ALT3 mux port: ENET_TX_DATA00 of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpuart3_TX</name>
                  <description>Select mux mode: ALT4 mux port: LPUART3_TXD of instance: LPUART3</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO29</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO29 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_ROW2</name>
                  <description>Select mux mode: ALT6 mux port: KPP_ROW02 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO30</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D30 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_WDOG2_RST_B_DEB</name>
                  <description>Select mux mode: ALT9 mux port: WDOG2_RST_B_DEB of instance: WDOG2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO29</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO29 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_30</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
