nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B1_00</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B1_00 SW MUX Control Register</description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc1_CMD</name>
                  <description>Select mux mode: ALT0 mux port: USDHC1_CMD of instance: USDHC1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_XBAR1_INOUT20</name>
                  <description>Select mux mode: ALT2 mux port: XBAR1_INOUT20 of instance: XBAR1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt4_CAPTURE1</name>
                  <description>Select mux mode: ALT3 mux port: GPT4_CAPTURE1 of instance: GPT4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO3</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO03 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_flexspi2_A_SS0_B</name>
                  <description>Select mux mode: ALT6 mux port: FLEXSPI2_A_SS0_B of instance: FLEXSPI2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_kpp_ROW7</name>
                  <description>Select mux mode: ALT8 mux port: KPP_ROW07 of instance: KPP</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO3</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO03 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B1_00</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B1_01</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B1_01 SW MUX Control Register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc1_CLK</name>
                  <description>Select mux mode: ALT0 mux port: USDHC1_CLK of instance: USDHC1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_XBAR1_INOUT21</name>
                  <description>Select mux mode: ALT2 mux port: XBAR1_INOUT21 of instance: XBAR1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt4_CAPTURE2</name>
                  <description>Select mux mode: ALT3 mux port: GPT4_CAPTURE2 of instance: GPT4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO4</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO04 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_flexspi2_A_SCLK</name>
                  <description>Select mux mode: ALT6 mux port: FLEXSPI2_A_SCLK of instance: FLEXSPI2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_kpp_COL7</name>
                  <description>Select mux mode: ALT8 mux port: KPP_COL07 of instance: KPP</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO4</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO04 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B1_01</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B1_02</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B1_02 SW MUX Control Register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc1_DATA0</name>
                  <description>Select mux mode: ALT0 mux port: USDHC1_DATA0 of instance: USDHC1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_XBAR1_INOUT22</name>
                  <description>Select mux mode: ALT2 mux port: XBAR1_INOUT22 of instance: XBAR1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt4_COMPARE1</name>
                  <description>Select mux mode: ALT3 mux port: GPT4_COMPARE1 of instance: GPT4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO05 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_flexspi2_A_DATA0</name>
                  <description>Select mux mode: ALT6 mux port: FLEXSPI2_A_DATA00 of instance: FLEXSPI2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_kpp_ROW6</name>
                  <description>Select mux mode: ALT8 mux port: KPP_ROW06 of instance: KPP</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_flexspi1_A_SS1_B</name>
                  <description>Select mux mode: ALT9 mux port: FLEXSPI1_A_SS1_B of instance: FLEXSPI1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO5</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO05 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B1_02</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B1_03</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B1_03 SW MUX Control Register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc1_DATA1</name>
                  <description>Select mux mode: ALT0 mux port: USDHC1_DATA1 of instance: USDHC1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_XBAR1_INOUT23</name>
                  <description>Select mux mode: ALT2 mux port: XBAR1_INOUT23 of instance: XBAR1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt4_COMPARE2</name>
                  <description>Select mux mode: ALT3 mux port: GPT4_COMPARE2 of instance: GPT4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO6</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO06 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_flexspi2_A_DATA1</name>
                  <description>Select mux mode: ALT6 mux port: FLEXSPI2_A_DATA01 of instance: FLEXSPI2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_kpp_COL6</name>
                  <description>Select mux mode: ALT8 mux port: KPP_COL06 of instance: KPP</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_flexspi1_B_SS1_B</name>
                  <description>Select mux mode: ALT9 mux port: FLEXSPI1_B_SS1_B of instance: FLEXSPI1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO6</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO06 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B1_03</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B1_04</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B1_04 SW MUX Control Register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc1_DATA2</name>
                  <description>Select mux mode: ALT0 mux port: USDHC1_DATA2 of instance: USDHC1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_XBAR1_INOUT24</name>
                  <description>Select mux mode: ALT2 mux port: XBAR1_INOUT24 of instance: XBAR1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt4_COMPARE3</name>
                  <description>Select mux mode: ALT3 mux port: GPT4_COMPARE3 of instance: GPT4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO7</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO07 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_flexspi2_A_DATA2</name>
                  <description>Select mux mode: ALT6 mux port: FLEXSPI2_A_DATA02 of instance: FLEXSPI2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexspi1_B_SS0_B</name>
                  <description>Select mux mode: ALT8 mux port: FLEXSPI1_B_SS0_B of instance: FLEXSPI1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_qos_1588_EVENT2_AUX_IN</name>
                  <description>Select mux mode: ALT9 mux port: ENET_QOS_1588_EVENT2_AUX_IN of instance: ENET_QOS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO7</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO07 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B1_04</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B1_05</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B1_05 SW MUX Control Register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc1_DATA3</name>
                  <description>Select mux mode: ALT0 mux port: USDHC1_DATA3 of instance: USDHC1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_XBAR1_INOUT25</name>
                  <description>Select mux mode: ALT2 mux port: XBAR1_INOUT25 of instance: XBAR1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt4_CLK</name>
                  <description>Select mux mode: ALT3 mux port: GPT4_CLK of instance: GPT4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO8</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO08 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_flexspi2_A_DATA3</name>
                  <description>Select mux mode: ALT6 mux port: FLEXSPI2_A_DATA03 of instance: FLEXSPI2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexspi1_B_DQS</name>
                  <description>Select mux mode: ALT8 mux port: FLEXSPI1_B_DQS of instance: FLEXSPI1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_qos_1588_EVENT3_AUX_IN</name>
                  <description>Select mux mode: ALT9 mux port: ENET_QOS_1588_EVENT3_AUX_IN of instance: ENET_QOS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO8</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO08 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B1_05</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
