nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_00</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_00 SW MUX Control Register</description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_DATA3</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_DATA3 of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_B_DATA3</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_B_DATA03 of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_RX_EN</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_RX_EN of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart9_TX</name>
                  <description>Select mux mode: ALT3 mux port: LPUART9_TXD of instance: LPUART9</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi4_SCK</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI4_SCK of instance: LPSPI4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO9</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO09 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO9</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO09 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_00</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_01</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_01 SW MUX Control Register</description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_DATA2</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_DATA2 of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_B_DATA2</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_B_DATA02 of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_RX_CLK</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_RX_CLK of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart9_RX</name>
                  <description>Select mux mode: ALT3 mux port: LPUART9_RXD of instance: LPUART9</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi4_PCS0</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI4_PCS0 of instance: LPSPI4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO10</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO10 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO10</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO10 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_01</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_02</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_02 SW MUX Control Register</description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_DATA1</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_DATA1 of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_B_DATA1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_B_DATA01 of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_RX_DATA0</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_RX_DATA00 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart9_CTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART9_CTS_B of instance: LPUART9</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi4_SDO</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI4_SOUT of instance: LPSPI4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO11</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO11 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO11</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO11 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_02</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_03</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_03 SW MUX Control Register</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_DATA0</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_DATA0 of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_B_DATA0</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_B_DATA00 of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_RX_DATA1</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_RX_DATA01 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart9_RTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART9_RTS_B of instance: LPUART9</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi4_SDI</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI4_SIN of instance: LPSPI4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO12</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO12 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO12</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO12 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_03</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_04</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_04 SW MUX Control Register</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_CLK</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_CLK of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_B_SCLK</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_B_SCLK of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_RX_DATA2</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_RX_DATA02 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_A_SS1_B</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_A_SS1_B of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi4_PCS1</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI4_PCS1 of instance: LPSPI4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO13</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO13 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO13</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO13 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_04</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_05</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_05 SW MUX Control Register</description>
          <addressOffset>0x1C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_CMD</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_CMD of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_A_DQS</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_A_DQS of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_RX_DATA3</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_RX_DATA03 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_B_SS0_B</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_B_SS0_B of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi4_PCS2</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI4_PCS2 of instance: LPSPI4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO14</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO14 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO14</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO14 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_05</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_06</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_06 SW MUX Control Register</description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_RESET_B</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_RESET_B of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_A_SS0_B</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_A_SS0_B of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_TX_DATA3</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_TX_DATA03 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpspi4_PCS3</name>
                  <description>Select mux mode: ALT3 mux port: LPSPI4_PCS3 of instance: LPSPI4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_gpt6_CAPTURE1</name>
                  <description>Select mux mode: ALT4 mux port: GPT6_CAPTURE1 of instance: GPT6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO15</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO15 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO15</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO15 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_06</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
