nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_01</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_01 SW MUX Control Register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_ENABLE</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_ENABLE of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_enet_1g_RX_CLK</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_RX_CLK of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_RX_ER</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_RX_ER of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer1_TIMER1</name>
                  <description>Select mux mode: ALT3 mux port: TMR1_TIMER1 of instance: TMR1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT27</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT27 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO22</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO22 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_CCM_enet_qos_clock_generate_RX_CLK</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_RX_CLK of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_qos_RX_ER</name>
                  <description>Select mux mode: ALT9 mux port: ENET_QOS_RX_ER of instance: ENET_QOS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO22</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO22 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_01</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_02</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_02 SW MUX Control Register</description>
          <addressOffset>0x1EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_HSYNC</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_HSYNC of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_1G_RX_DATA0</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_RX_DATA00 of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpi2c3_SCL</name>
                  <description>Select mux mode: ALT2 mux port: LPI2C3_SCL of instance: LPI2C3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer1_TIMER2</name>
                  <description>Select mux mode: ALT3 mux port: TMR1_TIMER2 of instance: TMR1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT28</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT28 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO23</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO23 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_RX_DATA0</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_RX_DATA00 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpuart1_TX</name>
                  <description>Select mux mode: ALT9 mux port: LPUART1_TXD of instance: LPUART1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO23</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO23 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_02</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_03</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_03 SW MUX Control Register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_VSYNC</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_VSYNC of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_1G_RX_DATA1</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_RX_DATA01 of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpi2c3_SDA</name>
                  <description>Select mux mode: ALT2 mux port: LPI2C3_SDA of instance: LPI2C3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer2_TIMER0</name>
                  <description>Select mux mode: ALT3 mux port: TMR2_TIMER0 of instance: TMR2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT29</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT29 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO24</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO24 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_RX_DATA1</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_RX_DATA01 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpuart1_RX</name>
                  <description>Select mux mode: ALT9 mux port: LPUART1_RXD of instance: LPUART1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO24</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO24 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_03</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_04</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_04 SW MUX Control Register</description>
          <addressOffset>0x1F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA0</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA00 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_1G_RX_DATA2</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_RX_DATA02 of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpuart4_RX</name>
                  <description>Select mux mode: ALT2 mux port: LPUART4_RXD of instance: LPUART4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer2_TIMER1</name>
                  <description>Select mux mode: ALT3 mux port: TMR2_TIMER1 of instance: TMR2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT30</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT30 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO25</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO25 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_RX_DATA2</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_RX_DATA02 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpspi3_SCK</name>
                  <description>Select mux mode: ALT9 mux port: LPSPI3_SCK of instance: LPSPI3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO25</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO25 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_04</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_05</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_05 SW MUX Control Register</description>
          <addressOffset>0x1F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA1</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA01 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_1G_RX_DATA3</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_RX_DATA03 of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpuart4_CTS_B</name>
                  <description>Select mux mode: ALT2 mux port: LPUART4_CTS_B of instance: LPUART4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer2_TIMER2</name>
                  <description>Select mux mode: ALT3 mux port: TMR2_TIMER2 of instance: TMR2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT31</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT31 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO26</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO26 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_RX_DATA3</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_RX_DATA03 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpspi3_SDI</name>
                  <description>Select mux mode: ALT9 mux port: LPSPI3_SIN of instance: LPSPI3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO26</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO26 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_05</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
