nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_11</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_11 SW MUX Control Register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA7</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA07 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_enet_1g_TX_CLK_IO</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_TX_CLK_IO of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_REF_CLK1</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_REF_CLK1 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer4_TIMER2</name>
                  <description>Select mux mode: ALT3 mux port: TMR4_TIMER2 of instance: TMR4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT37</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT37 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO0</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO00 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG5</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG05 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_CCM_enet_qos_clock_generate_TX_CLK</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_TX_CLK of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_CCM_enet_qos_clock_generate_REF_CLK1</name>
                  <description>Select mux mode: ALT9 mux port: ENET_QOS_REF_CLK1 of instance: ENET_QOS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO0</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO00 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_00</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_00 SW MUX Control Register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA8</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA08 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_WDOG1_B</name>
                  <description>Select mux mode: ALT1 mux port: WDOG1_B of instance: WDOG1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_mqs_RIGHT</name>
                  <description>Select mux mode: ALT2 mux port: MQS_RIGHT of instance: MQS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_enet_1g_TX_ER</name>
                  <description>Select mux mode: ALT3 mux port: ENET_1G_TX_ER of instance: ENET_1G</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_sai1_TX_DATA3</name>
                  <description>Select mux mode: ALT4 mux port: SAI1_TX_DATA03 of instance: SAI1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO1</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO01 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG6</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG06 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_TX_ER</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_TX_ER of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO1</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO01 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_00</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_01</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_01 SW MUX Control Register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA9</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA09 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_usdhc1_VSELECT</name>
                  <description>Select mux mode: ALT1 mux port: USDHC1_VSELECT of instance: USDHC1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_mqs_LEFT</name>
                  <description>Select mux mode: ALT2 mux port: MQS_LEFT of instance: MQS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_WDOG2_B</name>
                  <description>Select mux mode: ALT3 mux port: WDOG2_B of instance: WDOG2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_sai1_TX_DATA2</name>
                  <description>Select mux mode: ALT4 mux port: SAI1_TX_DATA02 of instance: SAI1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO2</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO02 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG7</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG07 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_EWM_OUT_B</name>
                  <description>Select mux mode: ALT8 mux port: EWM_OUT_B of instance: EWM</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_CCM_ENET_REF_CLK_25M</name>
                  <description>Select mux mode: ALT9 mux port: CCM_ENET_REF_CLK_25M of instance: CCM</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO2</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO02 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_01</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_02</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_02 SW MUX Control Register</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA10</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA10 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_TX_DATA0</name>
                  <description>Select mux mode: ALT1 mux port: ENET_TX_DATA00 of instance: ENET</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_pit1_TRIGGER3</name>
                  <description>Select mux mode: ALT2 mux port: PIT1_TRIGGER3 of instance: PIT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ARM_TRACE0</name>
                  <description>Select mux mode: ALT3 mux port: ARM_TRACE00 of instance: ARM</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_sai1_TX_DATA1</name>
                  <description>Select mux mode: ALT4 mux port: SAI1_TX_DATA01 of instance: SAI1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO3</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO03 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG8</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG08 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_TX_DATA0</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_TX_DATA00 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO3</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO03 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_02</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_03</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_03 SW MUX Control Register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA11</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA11 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_TX_DATA1</name>
                  <description>Select mux mode: ALT1 mux port: ENET_TX_DATA01 of instance: ENET</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_pit1_TRIGGER2</name>
                  <description>Select mux mode: ALT2 mux port: PIT1_TRIGGER2 of instance: PIT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ARM_TRACE1</name>
                  <description>Select mux mode: ALT3 mux port: ARM_TRACE01 of instance: ARM</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_sai1_MCLK</name>
                  <description>Select mux mode: ALT4 mux port: SAI1_MCLK of instance: SAI1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO4</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO04 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG9</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG09 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_TX_DATA1</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_TX_DATA01 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO4</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO04 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_03</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
