nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_04</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_04 SW MUX Control Register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA12</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA12 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_enet_TX_EN</name>
                  <description>Select mux mode: ALT1 mux port: ENET_TX_EN of instance: ENET</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_pit1_TRIGGER1</name>
                  <description>Select mux mode: ALT2 mux port: PIT1_TRIGGER1 of instance: PIT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ARM_TRACE2</name>
                  <description>Select mux mode: ALT3 mux port: ARM_TRACE02 of instance: ARM</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_sai1_RX_SYNC</name>
                  <description>Select mux mode: ALT4 mux port: SAI1_RX_SYNC of instance: SAI1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO05 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG10</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG10 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_TX_EN</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_TX_EN of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO5</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO05 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_04</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_05</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_05 SW MUX Control Register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA13</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA13 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_enet_TX_CLK</name>
                  <description>Select mux mode: ALT1 mux port: ENET_TX_CLK of instance: ENET</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_REF_CLK1</name>
                  <description>Select mux mode: ALT2 mux port: ENET_REF_CLK1 of instance: ENET</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ARM_TRACE3</name>
                  <description>Select mux mode: ALT3 mux port: ARM_TRACE03 of instance: ARM</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_sai1_RX_BCLK</name>
                  <description>Select mux mode: ALT4 mux port: SAI1_RX_BCLK of instance: SAI1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO6</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO06 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG11</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG11 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_CCM_enet_qos_clock_generate_TX_CLK</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_TX_CLK of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO6</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO06 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_05</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_06</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_06 SW MUX Control Register</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA14</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA14 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_RX_DATA0</name>
                  <description>Select mux mode: ALT1 mux port: ENET_RX_DATA00 of instance: ENET</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpuart7_TX</name>
                  <description>Select mux mode: ALT2 mux port: LPUART7_TXD of instance: LPUART7</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ARM_TRACE_CLK</name>
                  <description>Select mux mode: ALT3 mux port: ARM_TRACE_CLK of instance: ARM</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_sai1_RX_DATA0</name>
                  <description>Select mux mode: ALT4 mux port: SAI1_RX_DATA00 of instance: SAI1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO7</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO07 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_RX_DATA0</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_RX_DATA00 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO7</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO07 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_06</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_07</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_07 SW MUX Control Register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA15</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA15 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_RX_DATA1</name>
                  <description>Select mux mode: ALT1 mux port: ENET_RX_DATA01 of instance: ENET</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpuart7_RX</name>
                  <description>Select mux mode: ALT2 mux port: LPUART7_RXD of instance: LPUART7</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ARM_TRACE_SWO</name>
                  <description>Select mux mode: ALT3 mux port: ARM_TRACE_SWO of instance: ARM</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_sai1_TX_DATA0</name>
                  <description>Select mux mode: ALT4 mux port: SAI1_TX_DATA00 of instance: SAI1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO8</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO08 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_RX_DATA1</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_RX_DATA01 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO8</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO08 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_07</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_08</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_08 SW MUX Control Register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA16</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA16 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_enet_RX_EN</name>
                  <description>Select mux mode: ALT1 mux port: ENET_RX_EN of instance: ENET</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpuart8_TX</name>
                  <description>Select mux mode: ALT2 mux port: LPUART8_TXD of instance: LPUART8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_cm7_imxrt_TXEV</name>
                  <description>Select mux mode: ALT3 mux port: ARM_CM7_EVENTO of instance: CM7</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_sai1_TX_BCLK</name>
                  <description>Select mux mode: ALT4 mux port: SAI1_TX_BCLK of instance: SAI1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO9</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO09 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_RX_EN</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_RX_EN of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpuart1_TX</name>
                  <description>Select mux mode: ALT9 mux port: LPUART1_TXD of instance: LPUART1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO9</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO09 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_08</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_09</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_09 SW MUX Control Register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA17</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA17 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_enet_RX_ER</name>
                  <description>Select mux mode: ALT1 mux port: ENET_RX_ER of instance: ENET</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpuart8_RX</name>
                  <description>Select mux mode: ALT2 mux port: LPUART8_RXD of instance: LPUART8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_cm7_imxrt_RXEV</name>
                  <description>Select mux mode: ALT3 mux port: ARM_CM7_EVENTI of instance: CM7</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_sai1_TX_SYNC</name>
                  <description>Select mux mode: ALT4 mux port: SAI1_TX_SYNC of instance: SAI1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO10</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO10 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_RX_ER</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_RX_ER of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpuart1_RX</name>
                  <description>Select mux mode: ALT9 mux port: LPUART1_RXD of instance: LPUART1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO10</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO10 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_09</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
