nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_10</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_10 SW MUX Control Register</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA18</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA18 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_EMVSIM2_TRXD</name>
                  <description>Select mux mode: ALT1 mux port: EMVSIM2_IO of instance: EMVSIM2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpuart2_TX</name>
                  <description>Select mux mode: ALT2 mux port: LPUART2_TXD of instance: LPUART2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_WDOG2_RST_B_DEB</name>
                  <description>Select mux mode: ALT3 mux port: WDOG2_RST_B_DEB of instance: WDOG2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT38</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT38 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO11</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO11 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpi2c3_SCL</name>
                  <description>Select mux mode: ALT6 mux port: LPI2C3_SCL of instance: LPI2C3</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_RX_ER</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_RX_ER of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_spdif_IN</name>
                  <description>Select mux mode: ALT9 mux port: SPDIF_IN of instance: SPDIF</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO11</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO11 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_10</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_11</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_11 SW MUX Control Register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA19</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA19 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_EMVSIM2_CLK</name>
                  <description>Select mux mode: ALT1 mux port: EMVSIM2_CLK of instance: EMVSIM2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpuart2_RX</name>
                  <description>Select mux mode: ALT2 mux port: LPUART2_RXD of instance: LPUART2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_WDOG1_RST_B_DEB</name>
                  <description>Select mux mode: ALT3 mux port: WDOG1_RST_B_DEB of instance: WDOG1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT39</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT39 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO12</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO12 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpi2c3_SDA</name>
                  <description>Select mux mode: ALT6 mux port: LPI2C3_SDA of instance: LPI2C3</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_CRS</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_CRS of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_spdif_OUT</name>
                  <description>Select mux mode: ALT9 mux port: SPDIF_OUT of instance: SPDIF</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO12</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO12 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_12</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_12 SW MUX Control Register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA20</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA20 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_EMVSIM2_RST_B</name>
                  <description>Select mux mode: ALT1 mux port: EMVSIM2_RST of instance: EMVSIM2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_can1_TX</name>
                  <description>Select mux mode: ALT2 mux port: FLEXCAN1_TX of instance: FLEXCAN1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart2_CTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART2_CTS_B of instance: LPUART2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT40</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT40 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO13</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO13 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpi2c4_SCL</name>
                  <description>Select mux mode: ALT6 mux port: LPI2C4_SCL of instance: LPI2C4</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_COL</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_COL of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpspi4_SCK</name>
                  <description>Select mux mode: ALT9 mux port: LPSPI4_SCK of instance: LPSPI4</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO13</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO13 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_12</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_13</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_13 SW MUX Control Register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA21</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA21 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_EMVSIM2_SVEN</name>
                  <description>Select mux mode: ALT1 mux port: EMVSIM2_SVEN of instance: EMVSIM2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_can1_RX</name>
                  <description>Select mux mode: ALT2 mux port: FLEXCAN1_RX of instance: FLEXCAN1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart2_RTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART2_RTS_B of instance: LPUART2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_enet_REF_CLK1</name>
                  <description>Select mux mode: ALT4 mux port: ENET_REF_CLK1 of instance: ENET</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO14</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO14 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpi2c4_SDA</name>
                  <description>Select mux mode: ALT6 mux port: LPI2C4_SDA of instance: LPI2C4</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_1588_EVENT0_OUT</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_1588_EVENT0_OUT of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpspi4_SDI</name>
                  <description>Select mux mode: ALT9 mux port: LPSPI4_SIN of instance: LPSPI4</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO14</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO14 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_13</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B2_14</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B2_14 SW MUX Control Register</description>
          <addressOffset>0x24C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA22</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA22 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_EMVSIM2_PD</name>
                  <description>Select mux mode: ALT1 mux port: EMVSIM2_PD of instance: EMVSIM2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_WDOG2_B</name>
                  <description>Select mux mode: ALT2 mux port: WDOG2_B of instance: WDOG2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_video_mux_EXT_DCIC1</name>
                  <description>Select mux mode: ALT3 mux port: VIDEO_MUX_EXT_DCIC1 of instance: VIDEO_MUX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_enet_1g_REF_CLK1</name>
                  <description>Select mux mode: ALT4 mux port: ENET_1G_REF_CLK1 of instance: ENET_1G</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux5_IO15</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX5_IO15 of instance: GPIO_MUX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_can1_TX</name>
                  <description>Select mux mode: ALT6 mux port: FLEXCAN1_TX of instance: FLEXCAN1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_1588_EVENT0_IN</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_1588_EVENT0_IN of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpspi4_SDO</name>
                  <description>Select mux mode: ALT9 mux port: LPSPI4_SOUT of instance: LPSPI4</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio11_IO15</name>
                  <description>Select mux mode: ALT10 mux port: GPIO11_IO15 of instance: GPIO11</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B2_14</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
