nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>GPT3_CAPIN1_SELECT_INPUT</name>
          <description>GPT3_CAPIN1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x590</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_06_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B2_06 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_06_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_06 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT3_CAPIN2_SELECT_INPUT</name>
          <description>GPT3_CAPIN2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x594</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_07_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B2_07 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_07_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_07 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT3_CLKIN_SELECT_INPUT</name>
          <description>GPT3_CLKIN_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x598</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_05_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B2_05 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_11_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_11 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KPP_COL_SELECT_INPUT_6</name>
          <description>KPP_COL_SELECT_INPUT_6 DAISY Register</description>
          <addressOffset>0x59C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_23_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_23 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B1_03_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_03 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KPP_COL_SELECT_INPUT_7</name>
          <description>KPP_COL_SELECT_INPUT_7 DAISY Register</description>
          <addressOffset>0x5A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_21_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_21 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B1_01_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_01 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KPP_ROW_SELECT_INPUT_6</name>
          <description>KPP_ROW_SELECT_INPUT_6 DAISY Register</description>
          <addressOffset>0x5A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_22_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_22 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B1_02_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_02 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KPP_ROW_SELECT_INPUT_7</name>
          <description>KPP_ROW_SELECT_INPUT_7 DAISY Register</description>
          <addressOffset>0x5A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_20_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_20 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B1_00_ALT8</name>
                  <description>Selecting Pad: GPIO_SD_B1_00 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C1_LPI2C_SCL_SELECT_INPUT</name>
          <description>LPI2C1_LPI2C_SCL_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x5AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_08_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_08 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_32_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_32 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C1_LPI2C_SDA_SELECT_INPUT</name>
          <description>LPI2C1_LPI2C_SDA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x5B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_09_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_09 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_33_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_33 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C2_LPI2C_SCL_SELECT_INPUT</name>
          <description>LPI2C2_LPI2C_SCL_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x5B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_00_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_B2_00 for Mode: ALT9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_18_ALT9</name>
                  <description>Selecting Pad: GPIO_AD_18 for Mode: ALT9</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C2_LPI2C_SDA_SELECT_INPUT</name>
          <description>LPI2C2_LPI2C_SDA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x5B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_01_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_B2_01 for Mode: ALT9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_19_ALT9</name>
                  <description>Selecting Pad: GPIO_AD_19 for Mode: ALT9</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C3_LPI2C_SCL_SELECT_INPUT</name>
          <description>LPI2C3_LPI2C_SCL_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x5BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_02_ALT2</name>
                  <description>Selecting Pad: GPIO_DISP_B1_02 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_10_ALT6</name>
                  <description>Selecting Pad: GPIO_DISP_B2_10 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C3_LPI2C_SDA_SELECT_INPUT</name>
          <description>LPI2C3_LPI2C_SDA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x5C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_03_ALT2</name>
                  <description>Selecting Pad: GPIO_DISP_B1_03 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_11_ALT6</name>
                  <description>Selecting Pad: GPIO_DISP_B2_11 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C4_LPI2C_SCL_SELECT_INPUT</name>
          <description>LPI2C4_LPI2C_SCL_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x5C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_24_ALT9</name>
                  <description>Selecting Pad: GPIO_AD_24 for Mode: ALT9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_12_ALT6</name>
                  <description>Selecting Pad: GPIO_DISP_B2_12 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C4_LPI2C_SDA_SELECT_INPUT</name>
          <description>LPI2C4_LPI2C_SDA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x5C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_25_ALT9</name>
                  <description>Selecting Pad: GPIO_AD_25 for Mode: ALT9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_13_ALT6</name>
                  <description>Selecting Pad: GPIO_DISP_B2_13 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_LPSPI_PCS_SELECT_INPUT_0</name>
          <description>LPSPI1_LPSPI_PCS_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x5CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_01_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_B2_01 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_29_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_29 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_LPSPI_SCK_SELECT_INPUT</name>
          <description>LPSPI1_LPSPI_SCK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x5D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_00_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_B2_00 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_28_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_28 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_LPSPI_SDI_SELECT_INPUT</name>
          <description>LPSPI1_LPSPI_SDI_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x5D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_03_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_B2_03 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_31_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_31 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI1_LPSPI_SDO_SELECT_INPUT</name>
          <description>LPSPI1_LPSPI_SDO_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x5D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_02_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_B2_02 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_30_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_30 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
