nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>LPUART10_LPUART_RXD_SELECT_INPUT</name>
          <description>LPUART10_LPUART_RXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_16_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_16 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_33_ALT8</name>
                  <description>Selecting Pad: GPIO_AD_33 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART10_LPUART_TXD_SELECT_INPUT</name>
          <description>LPUART10_LPUART_TXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x628</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_15_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_15 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_32_ALT8</name>
                  <description>Selecting Pad: GPIO_AD_32 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART7_LPUART_RXD_SELECT_INPUT</name>
          <description>LPUART7_LPUART_RXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x62C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_01_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_01 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_07_ALT2</name>
                  <description>Selecting Pad: GPIO_DISP_B2_07 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART7_LPUART_TXD_SELECT_INPUT</name>
          <description>LPUART7_LPUART_TXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_00_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_00 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_06_ALT2</name>
                  <description>Selecting Pad: GPIO_DISP_B2_06 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART8_LPUART_RXD_SELECT_INPUT</name>
          <description>LPUART8_LPUART_RXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_03_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_03 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_09_ALT2</name>
                  <description>Selecting Pad: GPIO_DISP_B2_09 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART8_LPUART_TXD_SELECT_INPUT</name>
          <description>LPUART8_LPUART_TXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_02_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_02 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_08_ALT2</name>
                  <description>Selecting Pad: GPIO_DISP_B2_08 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER1_TMR0_INPUT_SELECT_INPUT</name>
          <description>QTIMER1_TMR0_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x63C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_17_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_B1_17 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_09_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_B2_09 for Mode: ALT9</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_00_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_00 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER1_TMR1_INPUT_SELECT_INPUT</name>
          <description>QTIMER1_TMR1_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_38_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_B1_38 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_10_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_B2_10 for Mode: ALT9</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_01_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_01 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER1_TMR2_INPUT_SELECT_INPUT</name>
          <description>QTIMER1_TMR2_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x644</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_11_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_B2_11 for Mode: ALT9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_02_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_02 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER2_TMR0_INPUT_SELECT_INPUT</name>
          <description>QTIMER2_TMR0_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_18_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_B1_18 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_13_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_B2_13 for Mode: ALT9</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_03_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_03 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER2_TMR1_INPUT_SELECT_INPUT</name>
          <description>QTIMER2_TMR1_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x64C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_39_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_B1_39 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_14_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_B2_14 for Mode: ALT9</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_04_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_04 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER2_TMR2_INPUT_SELECT_INPUT</name>
          <description>QTIMER2_TMR2_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x650</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_15_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_B2_15 for Mode: ALT9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_05_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_05 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER3_TMR0_INPUT_SELECT_INPUT</name>
          <description>QTIMER3_TMR0_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x654</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_19_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_B1_19 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_17_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_B2_17 for Mode: ALT9</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_06_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_06 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER3_TMR1_INPUT_SELECT_INPUT</name>
          <description>QTIMER3_TMR1_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x658</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_00_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_B2_00 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_18_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_B2_18 for Mode: ALT9</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_07_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_07 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER3_TMR2_INPUT_SELECT_INPUT</name>
          <description>QTIMER3_TMR2_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x65C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_19_ALT9</name>
                  <description>Selecting Pad: GPIO_EMC_B2_19 for Mode: ALT9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_08_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_08 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER4_TMR0_INPUT_SELECT_INPUT</name>
          <description>QTIMER4_TMR0_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x660</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_20_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_B1_20 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_04_ALT9</name>
                  <description>Selecting Pad: GPIO_AD_04 for Mode: ALT9</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_09_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_09 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER4_TMR1_INPUT_SELECT_INPUT</name>
          <description>QTIMER4_TMR1_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x664</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_01_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_B2_01 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_05_ALT9</name>
                  <description>Selecting Pad: GPIO_AD_05 for Mode: ALT9</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_10_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_10 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
