nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>QTIMER4_TMR2_INPUT_SELECT_INPUT</name>
          <description>QTIMER4_TMR2_INPUT_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x668</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_06_ALT9</name>
                  <description>Selecting Pad: GPIO_AD_06 for Mode: ALT9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_11_ALT3</name>
                  <description>Selecting Pad: GPIO_DISP_B1_11 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI1_IPG_CLK_SAI_MCLK_SELECT_INPUT</name>
          <description>SAI1_IPG_CLK_SAI_MCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x66C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_17_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_17 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_03_ALT4</name>
                  <description>Selecting Pad: GPIO_DISP_B2_03 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI1_SAI_RXBCLK_SELECT_INPUT</name>
          <description>SAI1_SAI_RXBCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x670</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_19_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_19 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_05_ALT4</name>
                  <description>Selecting Pad: GPIO_DISP_B2_05 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI1_SAI_RXDATA_SELECT_INPUT_0</name>
          <description>SAI1_SAI_RXDATA_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x674</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_20_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_20 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_06_ALT4</name>
                  <description>Selecting Pad: GPIO_DISP_B2_06 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI1_SAI_RXSYNC_SELECT_INPUT</name>
          <description>SAI1_SAI_RXSYNC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x678</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_18_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_18 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_04_ALT4</name>
                  <description>Selecting Pad: GPIO_DISP_B2_04 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI1_SAI_TXBCLK_SELECT_INPUT</name>
          <description>SAI1_SAI_TXBCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x67C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_22_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_22 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_08_ALT4</name>
                  <description>Selecting Pad: GPIO_DISP_B2_08 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI1_SAI_TXSYNC_SELECT_INPUT</name>
          <description>SAI1_SAI_TXSYNC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x680</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_23_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_23 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_09_ALT4</name>
                  <description>Selecting Pad: GPIO_DISP_B2_09 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMVSIM1_SIO_SELECT_INPUT</name>
          <description>EMVSIM1_SIO_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x69C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_11_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_B2_11 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_00_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_00 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMVSIM1_IPP_SIMPD_SELECT_INPUT</name>
          <description>EMVSIM1_IPP_SIMPD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x6A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_15_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_B2_15 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_04_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_04 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMVSIM1_POWER_FAIL_SELECT_INPUT</name>
          <description>EMVSIM1_POWER_FAIL_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x6A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_16_ALT8</name>
                  <description>Selecting Pad: GPIO_EMC_B2_16 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_05_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_05 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMVSIM2_SIO_SELECT_INPUT</name>
          <description>EMVSIM2_SIO_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x6A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_06_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_06 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_10_ALT1</name>
                  <description>Selecting Pad: GPIO_DISP_B2_10 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMVSIM2_IPP_SIMPD_SELECT_INPUT</name>
          <description>EMVSIM2_IPP_SIMPD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x6AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_10_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_10 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_14_ALT1</name>
                  <description>Selecting Pad: GPIO_DISP_B2_14 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMVSIM2_POWER_FAIL_SELECT_INPUT</name>
          <description>EMVSIM2_POWER_FAIL_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x6B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_11_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_11 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_15_ALT1</name>
                  <description>Selecting Pad: GPIO_DISP_B2_15 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDIF_SPDIF_IN1_SELECT_INPUT</name>
          <description>SPDIF_SPDIF_IN1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x6B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_11_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B2_11 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_15_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_15 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_10_ALT9</name>
                  <description>Selecting Pad: GPIO_DISP_B2_10 for Mode: ALT9</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_OTG2_OC_SELECT_INPUT</name>
          <description>USB_OTG2_OC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x6B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_06_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_06 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_30_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_30 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_OTG_OC_SELECT_INPUT</name>
          <description>USB_OTG_OC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x6BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_11_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_11 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_35_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_35 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPHY1_USB_ID_SELECT_INPUT</name>
          <description>USBPHY1_USB_ID_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x6C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_09_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_09 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_33_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_33 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPHY2_USB_ID_SELECT_INPUT</name>
          <description>USBPHY2_USB_ID_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x6C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_08_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_08 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_32_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_32 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USDHC1_IPP_CARD_DET_SELECT_INPUT</name>
          <description>USDHC1_IPP_CARD_DET_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x6C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_32_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_32 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_08_ALT2</name>
                  <description>Selecting Pad: GPIO_DISP_B1_08 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
