nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPSPI1">
      <name>LPSPI2</name>
      <description>LPSPI</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x40118000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI2</name>
        <value>39</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPSPI1">
      <name>LPSPI3</name>
      <description>LPSPI</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x4011C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI3</name>
        <value>40</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPSPI1">
      <name>LPSPI4</name>
      <description>LPSPI</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x40120000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI4</name>
        <value>41</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPSPI1">
      <name>LPSPI5</name>
      <description>LPSPI</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x40C2C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI5</name>
        <value>42</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPSPI1">
      <name>LPSPI6</name>
      <description>LPSPI</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x40C30000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI6</name>
        <value>43</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CCM_OBS</name>
      <description>CCM_OBS</description>
      <groupName>CCM_OBS</groupName>
      <baseAddress>0x40150000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2FC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x80</dimIncrement>
          <name>OBSERVE[%s]</name>
          <description>Clock root section.</description>
          <addressOffset>0</addressOffset>
          <register>
            <name>OBSERVE_CONTROL</name>
            <description>Observe control</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SELECT</name>
                <description>Observe signal selector</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>modify</modifiedWriteValues>
              </field>
              <field>
                <name>RAW</name>
                <description>Observe raw signal</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>modify</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RAW_0</name>
                    <description>Select divided signal.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RAW_1</name>
                    <description>Select raw signal.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INV</name>
                <description>Invert</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INV_0</name>
                    <description>Clock phase remain same.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INV_1</name>
                    <description>Invert clock phase before measurement or send to IO.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RESET</name>
                <description>Reset observe divider</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RESET_0</name>
                    <description>Clock phase remain same.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESET_1</name>
                    <description>Invert clock phase before measurement or send to IO.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIVIDE</name>
                <description>Dividerfor observe signal</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OFF</name>
                <description>Turn off</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF_0</name>
                    <description>observe slice is on</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OFF_1</name>
                    <description>observe slice is off</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OBSERVE_CONTROL_SET</name>
            <description>Observe control</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SELECT</name>
                <description>Observe signal selector</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>RAW</name>
                <description>Observe raw signal</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>INV</name>
                <description>Invert</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>RESET</name>
                <description>Reset observe divider</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>DIVIDE</name>
                <description>Dividerfor observe signal</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
              <field>
                <name>OFF</name>
                <description>Turn off</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OBSERVE_CONTROL_CLR</name>
            <description>Observe control</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SELECT</name>
                <description>Observe signal selector</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>RAW</name>
                <description>Observe raw signal</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>INV</name>
                <description>Invert</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>RESET</name>
                <description>Reset observe divider</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>DIVIDE</name>
                <description>Dividerfor observe signal</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OFF</name>
                <description>Turn off</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OBSERVE_CONTROL_TOG</name>
            <description>Observe control</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SELECT</name>
                <description>Observe signal selector</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToToggle</modifiedWriteValues>
              </field>
              <field>
                <name>RAW</name>
                <description>Observe raw signal</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToToggle</modifiedWriteValues>
              </field>
              <field>
                <name>INV</name>
                <description>Invert</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToToggle</modifiedWriteValues>
              </field>
              <field>
                <name>RESET</name>
                <description>Reset observe divider</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToToggle</modifiedWriteValues>
              </field>
              <field>
                <name>DIVIDE</name>
                <description>Dividerfor observe signal</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToToggle</modifiedWriteValues>
              </field>
              <field>
                <name>OFF</name>
                <description>Turn off</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToToggle</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OBSERVE_STATUS0</name>
            <description>Observe status</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SELECT</name>
                <description>no description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RAW</name>
                <description>no description available</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INV</name>
                <description>no description available</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RESET</name>
                <description>no description available</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DIVIDE</name>
                <description>no description available</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OFF</name>
                <description>no description available</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>POWERDOWN</name>
                <description>no description available</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>UPDATE_FORWARD</name>
                <description>no description available</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>BUSY</name>
                <description>Busy</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OBSERVE_STATUS1</name>
            <description>Observe low power status</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
          </register>
          <register>
            <name>OBSERVE_NAME</name>
            <description>Observe name</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
          </register>
          <register>
            <name>OBSERVE_CONFIG</name>
            <description>Observe configuration</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
          </register>
