nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IC</name>
              <description>Inverse Convention</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IC_0</name>
                  <description>Direction convention transfers enabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC_1</name>
                  <description>Inverse convention transfers enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICM</name>
              <description>Initial Character Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ICM_0</name>
                  <description>Initial Character Mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ICM_1</name>
                  <description>Initial Character Mode enabled (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANACK</name>
              <description>Auto NACK Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANACK_0</name>
                  <description>NACK generation on errors disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANACK_1</name>
                  <description>NACK generation on errors enabled (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONACK</name>
              <description>Overrun NACK Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONACK_0</name>
                  <description>NACK generation on overrun is disabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONACK_1</name>
                  <description>NACK generation on overrun is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLSH_RX</name>
              <description>Flush Receiver Bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLSH_RX_0</name>
                  <description>EMV SIM Receiver normal operation (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLSH_RX_1</name>
                  <description>EMV SIM Receiver held in Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLSH_TX</name>
              <description>Flush Transmitter Bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLSH_TX_0</name>
                  <description>EMV SIM Transmitter normal operation (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLSH_TX_1</name>
                  <description>EMV SIM Transmitter held in Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_RST</name>
              <description>Software Reset Bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_RST_0</name>
                  <description>EMV SIM Normal operation (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_RST_1</name>
                  <description>EMV SIM held in Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KILL_CLOCKS</name>
              <description>Kill all internal clocks</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KILL_CLOCKS_0</name>
                  <description>EMV SIM input clock enabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KILL_CLOCKS_1</name>
                  <description>EMV SIM input clock is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOZE_EN</name>
              <description>Doze Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOZE_EN_0</name>
                  <description>DOZE instruction will gate all internal EMV SIM clocks as well as the Smart Card clock when the transmit FIFO is empty (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOZE_EN_1</name>
                  <description>DOZE instruction has no effect on EMV SIM module</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_EN</name>
              <description>STOP Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_EN_0</name>
                  <description>STOP instruction shuts down all EMV SIM clocks (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_EN_1</name>
                  <description>STOP instruction shuts down all clocks except for the Smart Card Clock (SCK) (clock provided to Smart Card)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCV_EN</name>
              <description>Receiver Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCV_EN_0</name>
                  <description>EMV SIM Receiver disabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCV_EN_1</name>
                  <description>EMV SIM Receiver enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XMT_EN</name>
              <description>Transmitter Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XMT_EN_0</name>
                  <description>EMV SIM Transmitter disabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XMT_EN_1</name>
                  <description>EMV SIM Transmitter enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCVR_11</name>
              <description>Receiver 11 ETU Mode Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RCVR_11_0</name>
                  <description>Receiver configured for 12 ETU operation mode (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCVR_11_1</name>
                  <description>Receiver configured for 11 ETU operation mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_DMA_EN</name>
              <description>Receive DMA Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_DMA_EN_0</name>
                  <description>No DMA Read Request asserted for Receiver (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DMA_EN_1</name>
                  <description>DMA Read Request asserted for Receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_DMA_EN</name>
              <description>Transmit DMA Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TX_DMA_EN_0</name>
                  <description>No DMA Write Request asserted for Transmitter (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_DMA_EN_1</name>
                  <description>DMA Write Request asserted for Transmitter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV_CRC_VAL</name>
              <description>Invert bits in the CRC Output Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV_CRC_VAL_0</name>
                  <description>Bits in CRC Output value will not be inverted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_CRC_VAL_1</name>
                  <description>Bits in CRC Output value will be inverted. (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_OUT_FLIP</name>
              <description>CRC Output Value Bit Reversal or Flip</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_OUT_FLIP_0</name>
                  <description>Bits within the CRC output bytes will not be reversed i.e. 15:0 will remain 15:0 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_OUT_FLIP_1</name>
                  <description>Bits within the CRC output bytes will be reversed i.e. 15:0 will become {8:15,0:7}</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_IN_FLIP</name>
              <description>CRC Input Byte's Bit Reversal or Flip Control</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_IN_FLIP_0</name>
                  <description>Bits in the input byte will not be reversed (i.e. 7:0 will remain 7:0) before the CRC calculation (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_IN_FLIP_1</name>
                  <description>Bits in the input byte will be reversed (i.e. 7:0 will become 0:7) before CRC calculation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWT_EN</name>
              <description>Character Wait Time Counter Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CWT_EN_0</name>
                  <description>Character Wait time Counter is disabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CWT_EN_1</name>
                  <description>Character Wait time counter is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LRC_EN</name>
              <description>LRC Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LRC_EN_0</name>
                  <description>8-bit Linear Redundancy Checking disabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LRC_EN_1</name>
                  <description>8-bit Linear Redundancy Checking enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_EN</name>
              <description>CRC Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_EN_0</name>
                  <description>16-bit Cyclic Redundancy Checking disabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_EN_1</name>
                  <description>16-bit Cyclic Redundancy Checking enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XMT_CRC_LRC</name>
              <description>Transmit CRC or LRC Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XMT_CRC_LRC_0</name>
                  <description>No CRC or LRC value is transmitted (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XMT_CRC_LRC_1</name>
                  <description>Transmit LRC or CRC info when FIFO empties (whichever is enabled)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BWT_EN</name>
              <description>Block Wait Time Counter Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BWT_EN_0</name>
                  <description>Disable BWT, BGT Counters (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BWT_EN_1</name>
                  <description>Enable BWT, BGT Counters</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
