nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SM3CTRL2</name>
          <description>Control 2 Register</description>
          <addressOffset>0x124</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_SEL</name>
              <description>Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPBUS</name>
                  <description>The IPBus clock is used as the clock for the local prescaler and counter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_CLK</name>
                  <description>EXT_CLK is used as the clock for the local prescaler and counter.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_CLK</name>
                  <description>Submodule 0's clock (AUX_CLK) is used as the source clock for the local prescaler and counter. This setting should not be used in submodule 0 as it will force the clock to logic 0.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RELOAD_SEL</name>
              <description>Reload Source Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCAL</name>
                  <description>The local RELOAD signal is used to reload registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <description>The master RELOAD signal (from submodule 0) is used to reload registers. This setting should not be used in submodule 0 as it will force the RELOAD signal to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE_SEL</name>
              <description>This read/write bit determines the source of the FORCE OUTPUT signal for this submodule.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCAL</name>
                  <description>The local force signal, CTRL2[FORCE], from this submodule is used to force updates.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <description>The master force signal from submodule 0 is used to force updates. This setting should not be used in submodule 0 as it will hold the FORCE OUTPUT signal to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCAL_RELOAD</name>
                  <description>The local reload signal from this submodule is used to force updates without regard to the state of LDOK.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_RELOAD</name>
                  <description>The master reload signal from submodule0 is used to force updates if LDOK is set. This setting should not be used in submodule0 as it will hold the FORCE OUTPUT signal to logic 0.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCAL_SYNC</name>
                  <description>The local sync signal from this submodule is used to force updates.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_SYNC</name>
                  <description>The master sync signal from submodule0 is used to force updates. This setting should not be used in submodule0 as it will hold the FORCE OUTPUT signal to logic 0.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_FORCE</name>
                  <description>The external force signal, EXT_FORCE, from outside the PWM module causes updates.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_SYNC</name>
                  <description>The external sync signal, EXT_SYNC, from outside the PWM module causes updates.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE</name>
              <description>Force Initialization</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCEN</name>
              <description>FRCEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Initialization from a FORCE_OUT is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Initialization from a FORCE_OUT is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INIT_SEL</name>
              <description>Initialization Control Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X</name>
                  <description>Local sync (PWM_X) causes initialization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_RELOAD</name>
                  <description>Master reload from submodule 0 causes initialization. This setting should not be used in submodule 0 as it will force the INIT signal to logic 0. The submodule counter will only reinitialize when a master reload occurs.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_SYNC</name>
                  <description>Master sync from submodule 0 causes initialization. This setting should not be used in submodule 0 as it will force the INIT signal to logic 0.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_SYNC</name>
                  <description>EXT_SYNC causes initialization.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWMX_INIT</name>
              <description>PWM_X Initial Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM45_INIT</name>
              <description>PWM45 Initial Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM23_INIT</name>
              <description>PWM23 Initial Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEP</name>
              <description>Independent or Complementary Pair Operation</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPLEMENTARY</name>
                  <description>PWM_A and PWM_B form a complementary PWM pair.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEPENDENT</name>
                  <description>PWM_A and PWM_B outputs are independent PWMs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAITEN</name>
              <description>WAIT Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGEN</name>
              <description>Debug Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM3CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x126</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x400</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBLEN</name>
              <description>Double Switching Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Double switching disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Double switching enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBLX</name>
              <description>PWMX Double Switching Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>PWMX double pulse disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>PWMX double pulse enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDMOD</name>
              <description>Load Mode Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_PWM_RELOAD</name>
                  <description>Buffered registers of this submodule are loaded and take effect at the next PWM reload if MCTRL[LDOK] is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTCTRL_LDOK_SET</name>
                  <description>Buffered registers of this submodule are loaded and take effect immediately upon MCTRL[LDOK] being set. In this case it is not necessary to set CTRL[FULL] or CTRL[HALF].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLIT</name>
              <description>Split the DBLPWM signal to PWMA and PWMB</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>DBLPWM is not split. PWMA and PWMB each have double pulses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>DBLPWM is split to PWMA and PWMB.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSC</name>
              <description>Prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Prescaler 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Prescaler 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Prescaler 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>Prescaler 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <description>Prescaler 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTYTWO</name>
                  <description>Prescaler 32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTYFOUR</name>
                  <description>Prescaler 64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HUNDREDTWENTYEIGHT</name>
                  <description>Prescaler 128</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPMODE</name>
              <description>Compare Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EQUAL_TO</name>
                  <description>The VAL* registers and the PWM counter are compared using an &quot;equal to&quot; method. This means that PWM edges are only produced when the counter is equal to one of the VAL* register values. This implies that a PWMA output that is high at the end of a period will maintain this state until a match with VAL3 clears the output in the following period.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EQUAL_TO_OR_GREATER_THAN</name>
                  <description>The VAL* registers and the PWM counter are compared using an &quot;equal to or greater than&quot; method. This means that PWM edges are produced when the counter is equal to or greater than one of the VAL* register values. This implies that a PWMA output that is high at the end of a period could go low at the start of the next period if the starting counter value is greater than (but not necessarily equal to) the new VAL3 value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DT</name>
              <description>Deadtime</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FULL</name>
              <description>Full Cycle Reload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Full-cycle reloads disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Full-cycle reloads enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALF</name>
              <description>Half Cycle Reload</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Half-cycle reloads disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Half-cycle reloads enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDFQ</name>
              <description>Load Frequency</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EVERYPWM</name>
                  <description>Every PWM opportunity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY2PWM</name>
                  <description>Every 2 PWM opportunities</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY3PWM</name>
                  <description>Every 3 PWM opportunities</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY4PWM</name>
                  <description>Every 4 PWM opportunities</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY5PWM</name>
                  <description>Every 5 PWM opportunities</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY6PWM</name>
                  <description>Every 6 PWM opportunities</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY7PWM</name>
                  <description>Every 7 PWM opportunities</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY8PWM</name>
                  <description>Every 8 PWM opportunities</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY9PWM</name>
                  <description>Every 9 PWM opportunities</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY10PWM</name>
                  <description>Every 10 PWM opportunities</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY11PWM</name>
                  <description>Every 11 PWM opportunities</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY12PWM</name>
                  <description>Every 12 PWM opportunities</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY13PWM</name>
                  <description>Every 13 PWM opportunities</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY14PWM</name>
                  <description>Every 14 PWM opportunities</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY15PWM</name>
                  <description>Every 15 PWM opportunities</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVERY16PWM</name>
                  <description>Every 16 PWM opportunities</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SM3VAL0</name>
          <description>Value Register 0</description>
          <addressOffset>0x12A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>VAL0</name>
              <description>Value Register 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM3FRACVAL1</name>
          <description>Fractional Value Register 1</description>
          <addressOffset>0x12C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FRACVAL1</name>
              <description>Fractional Value 1 Register</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
