nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>INT_STATUS_EN</name>
          <description>Interrupt Status Enable</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCSEN</name>
              <description>Command complete status enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCSEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCSEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCSEN</name>
              <description>Transfer complete status enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCSEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCSEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BGESEN</name>
              <description>Block gap event status enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BGESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DINTSEN</name>
              <description>DMA interrupt status enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DINTSEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DINTSEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BWRSEN</name>
              <description>Buffer write ready status enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BWRSEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BWRSEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRRSEN</name>
              <description>Buffer read ready status enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BRRSEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRRSEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINSSEN</name>
              <description>Card insertion status enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CINSSEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CINSSEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRMSEN</name>
              <description>Card removal status enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRMSEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRMSEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CINTSEN</name>
              <description>Card interrupt status enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CINTSEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CINTSEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTESEN</name>
              <description>Re-tuning event status enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPSEN</name>
              <description>Tuning pass status enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TPSEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPSEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CQISEN</name>
              <description>Command queuing status enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CQISEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CQISEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTOESEN</name>
              <description>Command timeout error status enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTOESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTOESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCESEN</name>
              <description>Command CRC error status enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEBESEN</name>
              <description>Command end bit error status enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CEBESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEBESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIESEN</name>
              <description>Command index error status enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CIESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CIESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTOESEN</name>
              <description>Data timeout error status enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTOESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCESEN</name>
              <description>Data CRC error status enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBESEN</name>
              <description>Data end bit error status enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEBESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AC12ESEN</name>
              <description>Auto CMD12 error status enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AC12ESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC12ESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TNESEN</name>
              <description>Tuning error status enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TNESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TNESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAESEN</name>
              <description>DMA error status enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAESEN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAESEN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
