nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>ADMA_ERR_STATUS</name>
          <description>ADMA Error Status</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADMAES</name>
              <description>ADMA error state (when ADMA error is occurred)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADMALME</name>
              <description>ADMA length mismatch error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADMALME_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADMALME_1</name>
                  <description>Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADMADCE</name>
              <description>ADMA descriptor error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADMADCE_0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADMADCE_1</name>
                  <description>Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMA_SYS_ADDR</name>
          <description>ADMA System Address</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADS_ADDR</name>
              <description>ADMA system address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_CTRL</name>
          <description>DLL (Delay Line) Control</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLL_CTRL_ENABLE</name>
              <description>DLL and delay chain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_RESET</name>
              <description>DLL reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_FORCE_UPD</name>
              <description>DLL slave delay line</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_DLY_TARGET0</name>
              <description>DLL slave delay target0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_GATE_UPDATE</name>
              <description>DLL gate update</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_OVERRIDE</name>
              <description>DLL slave override</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_OVERRIDE_VAL</name>
              <description>DLL slave override val</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_DLY_TARGET1</name>
              <description>DLL slave delay target1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_SLV_UPDATE_INT</name>
              <description>Slave delay line update interval</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CTRL_REF_UPDATE_INT</name>
              <description>DLL control loop update interval</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_STATUS</name>
          <description>DLL Status</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLL_STS_SLV_LOCK</name>
              <description>Slave delay-line lock status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLL_STS_REF_LOCK</name>
              <description>Reference DLL lock status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLL_STS_SLV_SEL</name>
              <description>Slave delay line select status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DLL_STS_REF_SEL</name>
              <description>Reference delay line select taps</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_TUNE_CTRL_STATUS</name>
          <description>CLK Tuning Control and Status</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLY_CELL_SET_POST</name>
              <description>Delay cells on the feedback clock between CLK_OUT and CLK_POST</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_CELL_SET_OUT</name>
              <description>Delay cells on the feedback clock between CLK_PRE and CLK_OUT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_CELL_SET_PRE</name>
              <description>delay cells on the feedback clock between the feedback clock and CLK_PRE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NXT_ERR</name>
              <description>NXT error</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAP_SEL_POST</name>
              <description>Delay cells added on the feedback clock between CLK_OUT and CLK_POST</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAP_SEL_OUT</name>
              <description>Delay cells added on the feedback clock between CLK_PRE and CLK_OUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAP_SEL_PRE</name>
              <description>TAP_SEL_PRE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRE_ERR</name>
              <description>PRE error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STROBE_DLL_CTRL</name>
          <description>Strobe DLL control</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STROBE_DLL_CTRL_ENABLE</name>
              <description>Strobe DLL control enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_RESET</name>
              <description>Strobe DLL control reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_SLV_FORCE_UPD</name>
              <description>Strobe DLL control slave force updated</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_SLV_DLY_TARGET</name>
              <description>Strobe DLL Control Slave Delay Target</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_GATE_UPDATE</name>
              <description>Strobe DLL control gate update</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_SLV_OVERRIDE</name>
              <description>Strobe DLL control slave override</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_SLV_OVERRIDE_VAL</name>
              <description>Strobe DLL control slave Override value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_SLV_UPDATE_INT</name>
              <description>Strobe DLL control slave update interval</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STROBE_DLL_CTRL_REF_UPDATE_INT</name>
              <description>Strobe DLL control reference update interval</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STROBE_DLL_STATUS</name>
          <description>Strobe DLL status</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STROBE_DLL_STS_SLV_LOCK</name>
              <description>Strobe DLL status slave lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STROBE_DLL_STS_REF_LOCK</name>
              <description>Strobe DLL status reference lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STROBE_DLL_STS_SLV_SEL</name>
              <description>Strobe DLL status slave select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STROBE_DLL_STS_REF_SEL</name>
              <description>Strobe DLL status reference select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VEND_SPEC</name>
          <description>Vendor Specific Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30007809</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSELECT</name>
              <description>Voltage selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSELECT_0</name>
                  <description>Change the voltage to high voltage range, around 3.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSELECT_1</name>
                  <description>Change the voltage to low voltage range, around 1.8 V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONFLICT_CHK_EN</name>
              <description>Conflict check enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONFLICT_CHK_EN_0</name>
                  <description>Conflict check disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFLICT_CHK_EN_1</name>
                  <description>Conflict check enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AC12_WR_CHKBUSY_EN</name>
              <description>Check busy enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AC12_WR_CHKBUSY_EN_0</name>
                  <description>Do not check busy after auto CMD12 for write data packet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC12_WR_CHKBUSY_EN_1</name>
                  <description>Check busy after auto CMD12 for write data packet</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRC_SDCLK_ON</name>
              <description>Force CLK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRC_SDCLK_ON_0</name>
                  <description>CLK active or inactive is fully controlled by the hardware.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRC_SDCLK_ON_1</name>
                  <description>Force CLK active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC_CHK_DIS</name>
              <description>CRC Check Disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_CHK_DIS_0</name>
                  <description>Check CRC16 for every read data packet and check CRC fields for every write data packet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_CHK_DIS_1</name>
                  <description>Ignore CRC16 check for every read data packet and ignore CRC fields check for every write data packet</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD_BYTE_EN</name>
              <description>Byte access</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMD_BYTE_EN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_BYTE_EN_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
