nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>TCSR3</name>
          <description>Timer Control Status Register</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDRE</name>
              <description>Timer DMA Request Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>DMA request is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>DMA request is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMODE</name>
              <description>Timer Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMR_DIS</name>
                  <description>Timer Channel is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_RE</name>
                  <description>Timer Channel is configured for Input Capture on rising edge.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_FE</name>
                  <description>Timer Channel is configured for Input Capture on falling edge.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_BE</name>
                  <description>Timer Channel is configured for Input Capture on both edges.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_OUT</name>
                  <description>Timer Channel is configured for Output Compare - software only.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_TOGGLE</name>
                  <description>Timer Channel is configured for Output Compare - toggle output on compare.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_CLR</name>
                  <description>Timer Channel is configured for Output Compare - clear output on compare.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_SET_OUT</name>
                  <description>Timer Channel is configured for Output Compare - set output on compare.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_CLR_SET1</name>
                  <description>Timer Channel is configured for Output Compare - set output on compare, clear output on overflow.</description>
                  <value>#10x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_CLR_SET</name>
                  <description>Timer Channel is configured for Output Compare - clear output on compare, set output on overflow.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_OUT_CMP_LOW</name>
                  <description>Timer Channel is configured for Output Compare - pulse output low on compare for one 1588-clock cycle.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_OUT_CMP_HIGH</name>
                  <description>Timer Channel is configured for Output Compare - pulse output high on compare for one 1588-clock cycle.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIE</name>
              <description>Timer Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TF</name>
              <description>Timer Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Input Capture or Output Compare has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Input Capture or Output Compare has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR3</name>
          <description>Timer Compare Capture Register</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCC</name>
              <description>Timer Capture Compare</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
