nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>MAC_HW_FEATURE1</name>
          <description>Optional Features or Functions 1</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x419939A6</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXFIFOSIZE</name>
              <description>MTL Receive FIFO Size This field contains the configured value of MTL Rx FIFO in bytes expressed as Log to base 2 minus 7, that is, Log2(RXFIFO_SIZE) -7:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bf_128B</name>
                  <description>128 bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_256B</name>
                  <description>256 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_512B</name>
                  <description>512 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_1024B</name>
                  <description>1024 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_2048B</name>
                  <description>2048 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_4096B</name>
                  <description>4096 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_8192B</name>
                  <description>8192 bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_16384B</name>
                  <description>16384 bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_32KB</name>
                  <description>32 KB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_64KB</name>
                  <description>64 KB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_128KB</name>
                  <description>128 KB</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_256KB</name>
                  <description>256 KB</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPRAM</name>
              <description>Single Port RAM Enable This bit is set to 1 when the Use single port RAM Feature is selected.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Single Port RAM feature is not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Single Port RAM feature is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFIFOSIZE</name>
              <description>MTL Transmit FIFO Size This field contains the configured value of MTL Tx FIFO in bytes expressed as Log to base 2 minus 7, that is, Log2(TXFIFO_SIZE) -7:</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bf_128B</name>
                  <description>128 bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_256B</name>
                  <description>256 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_512B</name>
                  <description>512 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_1024B</name>
                  <description>1024 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_2048B</name>
                  <description>2048 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_4096B</name>
                  <description>4096 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_8192B</name>
                  <description>8192 bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_16384B</name>
                  <description>16384 bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_32KB</name>
                  <description>32 KB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_64KB</name>
                  <description>64 KB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_128KB</name>
                  <description>128 KB</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSTEN</name>
              <description>One-Step Timestamping Enable This bit is set to 1 when the Enable One-Step Timestamp Feature is selected.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>One-Step Timestamping feature is not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>One-Step Timestamping feature is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTOEN</name>
              <description>PTP Offload Enable This bit is set to 1 when the Enable PTP Timestamp Offload Feature is selected.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>PTP Offload feature is not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>PTP Offload feature is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADVTHWORD</name>
              <description>IEEE 1588 High Word Register Enable This bit is set to 1 when the Add IEEE 1588 Higher Word Register option is selected</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>IEEE 1588 High Word Register option is not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>IEEE 1588 High Word Register option is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR64</name>
              <description>Address Width.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bf_32</name>
                  <description>32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_40</name>
                  <description>40</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_48</name>
                  <description>48</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCBEN</name>
              <description>DCB Feature Enable This bit is set to 1 when the Enable Data Center Bridging option is selected</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>DCB Feature is not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>DCB Feature is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPHEN</name>
              <description>Split Header Feature Enable This bit is set to 1 when the Enable Split Header Structure option is selected</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Split Header Feature is not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Split Header Feature is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSOEN</name>
              <description>TCP Segmentation Offload Enable This bit is set to 1 when the Enable TCP Segmentation Offloading for TCP/IP Packets option is selected</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>TCP Segmentation Offload Feature is not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>TCP Segmentation Offload Feature is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGMEMA</name>
              <description>DMA Debug Registers Enable This bit is set to 1 when the Debug Mode Enable option is selected</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>DMA Debug Registers option is not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>DMA Debug Registers option is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVSEL</name>
              <description>AV Feature Enable This bit is set to 1 when the Enable Audio Video Bridging option is selected.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>AV Feature is not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>AV Feature is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAVSEL</name>
              <description>Rx Side Only AV Feature Enable This bit is set to 1 when the Enable Audio Video Bridging option on Rx Side Only is selected.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Rx Side Only AV Feature is not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Rx Side Only AV Feature is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POUOST</name>
              <description>One Step for PTP over UDP/IP Feature Enable This bit is set to 1 when the Enable One step timestamp for PTP over UDP/IP feature is selected.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>One Step for PTP over UDP/IP Feature is not selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>One Step for PTP over UDP/IP Feature is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HASHTBLSZ</name>
              <description>Hash Table Size This field indicates the size of the hash table:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_HT</name>
                  <description>No hash table</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_64</name>
                  <description>64</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_128</name>
                  <description>128</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_256</name>
                  <description>256</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L3L4FNUM</name>
              <description>Total number of L3 or L4 Filters This field indicates the total number of L3 or L4 filters:</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOFILT</name>
                  <description>No L3 or L4 Filter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_1FILT</name>
                  <description>1 L3 or L4 Filter</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_2FILT</name>
                  <description>2 L3 or L4 Filters</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_3FILT</name>
                  <description>3 L3 or L4 Filters</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_4FILT</name>
                  <description>4 L3 or L4 Filters</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_5FILT</name>
                  <description>5 L3 or L4 Filters</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_6FILT</name>
                  <description>6 L3 or L4 Filters</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_7FILT</name>
                  <description>7 L3 or L4 Filters</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_8FILT</name>
                  <description>8 L3 or L4 Filters</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
