nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>MAC_HW_FEATURE2</name>
          <description>Optional Features or Functions 2</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x44104104</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXQCNT</name>
              <description>Number of MTL Receive Queues This field indicates the number of MTL Receive queues:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bf_1RXQ</name>
                  <description>1 MTL Rx Queue</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_2RXQ</name>
                  <description>2 MTL Rx Queues</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_3RXQ</name>
                  <description>3 MTL Rx Queues</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_4RXQ</name>
                  <description>4 MTL Rx Queues</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_5RXQ</name>
                  <description>5 MTL Rx Queues</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_6RXQ</name>
                  <description>6 MTL Rx Queues</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_7RXQ</name>
                  <description>7 MTL Rx Queues</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_8RXQ</name>
                  <description>8 MTL Rx Queues</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXQCNT</name>
              <description>Number of MTL Transmit Queues This field indicates the number of MTL Transmit queues:</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bf_1TXQ</name>
                  <description>1 MTL Tx Queue</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_2TXQ</name>
                  <description>2 MTL Tx Queues</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_3TXQ</name>
                  <description>3 MTL Tx Queues</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_4TXQ</name>
                  <description>4 MTL Tx Queues</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_5TXQ</name>
                  <description>5 MTL Tx Queues</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_6TXQ</name>
                  <description>6 MTL Tx Queues</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_7TXQ</name>
                  <description>7 MTL Tx Queues</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_8TXQ</name>
                  <description>8 MTL Tx Queues</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXCHCNT</name>
              <description>Number of DMA Receive Channels This field indicates the number of DMA Receive channels:</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bf_1RXCH</name>
                  <description>1 MTL Rx Channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_2RXCH</name>
                  <description>2 MTL Rx Channels</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_3RXCH</name>
                  <description>3 MTL Rx Channels</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_4RXCH</name>
                  <description>4 MTL Rx Channels</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_5RXCH</name>
                  <description>5 MTL Rx Channels</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_6RXCH</name>
                  <description>6 MTL Rx Channels</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_7RXCH</name>
                  <description>7 MTL Rx Channels</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_8RXCH</name>
                  <description>8 MTL Rx Channels</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXCHCNT</name>
              <description>Number of DMA Transmit Channels This field indicates the number of DMA Transmit channels:</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bf_1TXCH</name>
                  <description>1 MTL Tx Channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_2TXCH</name>
                  <description>2 MTL Tx Channels</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_3TXCH</name>
                  <description>3 MTL Tx Channels</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_4TXCH</name>
                  <description>4 MTL Tx Channels</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_5TXCH</name>
                  <description>5 MTL Tx Channels</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_6TXCH</name>
                  <description>6 MTL Tx Channels</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_7TXCH</name>
                  <description>7 MTL Tx Channels</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_8TXCH</name>
                  <description>8 MTL Tx Channels</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPSOUTNUM</name>
              <description>Number of PPS Outputs This field indicates the number of PPS outputs:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PPSO</name>
                  <description>No PPS output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_1_PPSO</name>
                  <description>1 PPS output</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_2_PPSO</name>
                  <description>2 PPS output</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_3_PPSO</name>
                  <description>3 PPS output</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_4_PPSO</name>
                  <description>4 PPS output</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUXSNAPNUM</name>
              <description>Number of Auxiliary Snapshot Inputs This field indicates the number of auxiliary snapshot inputs:</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AUXI</name>
                  <description>No auxiliary input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_1_AUXI</name>
                  <description>1 auxiliary input</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_2_AUXI</name>
                  <description>2 auxiliary input</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_3_AUXI</name>
                  <description>3 auxiliary input</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_4_AUXI</name>
                  <description>4 auxiliary input</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
