nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>CAAM</name>
      <description>CAAM</description>
      <groupName>CAAM</groupName>
      <baseAddress>0x40440000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CAAM_IRQ0</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>CAAM_IRQ1</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>CAAM_IRQ2</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>CAAM_IRQ3</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>CAAM_RECORVE_ERRPR</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>CAAM_RTC</name>
        <value>74</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>RaMD[%s]</name>
          <description>no description available</description>
          <addressOffset>0</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x80</dimIncrement>
            <name>RaMD[%s]</name>
            <description>no description available</description>
            <addressOffset>0x60200</addressOffset>
            <register>
              <dim>32</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>RMD_[%s]</name>
              <description>RTIC Memory Block memoryBlock endianness_full Endian Hash Result Word word</description>
              <addressOffset>0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>RTIC_Hash_Result</name>
                  <description>RTIC_Hash_Result</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>RMaAb[%s]</name>
          <description>no description available</description>
          <addressOffset>0</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x10</dimIncrement>
            <name>RM[%s]</name>
            <description>no description available</description>
            <addressOffset>0x60100</addressOffset>
            <register>
              <name>RMA</name>
              <description>RTIC Memory Block memoryBlock Address segment Register</description>
              <addressOffset>0</addressOffset>
              <size>64</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>MEMBLKADDR</name>
                  <description>Memory Block Address</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>36</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RML</name>
              <description>RTIC Memory Block memoryBlock Length segment Register</description>
              <addressOffset>0xC</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>MEMBLKLEN</name>
                  <description>Memory Block Lengths</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <name>MCFGR</name>
          <description>Master Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x82301</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NORMAL_BURST</name>
              <description>Normal Burst Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALIGNED_32B_TARGET</name>
                  <description>Aligned 32 byte burst size target</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALIGNED_64B_TARGET</name>
                  <description>Aligned 64 byte burst size target</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LARGE_BURST</name>
              <description>Enable Large Bursts</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIPIPE</name>
              <description>AXI Pipeline Depth</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWCACHE</name>
              <description>AXI Write Transaction Attributes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARCACHE</name>
              <description>AXI Read Transaction Attributes</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PS</name>
              <description>Pointer Size. This bit determines the size of address pointers. (see Address pointers).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SML_32Bit_PTRS</name>
                  <description>Pointers fit in one 32-bit word (pointers are 32-bit addresses).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LRG_64BIT_PTRS</name>
                  <description>Pointers require two 32-bit words (pointers are 36-bit addresses).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWT</name>
              <description>Double Word Transpose</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRHD</name>
              <description>Write Handoff Disable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RST</name>
              <description>DMA Reset</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDF</name>
              <description>Watchdog Fast</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDE</name>
              <description>DECO Watchdog Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAGE0_SDID</name>
          <description>Page 0 SDID Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDID</name>
              <description>Security Domain Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCFGR</name>
          <description>Security Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIBLOB</name>
              <description>Private Blob</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRIV_SEC_BOOT_SW</name>
                  <description>Private secure boot software blobs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIV_PROV_TYPE_1</name>
                  <description>Private provisioning type 1 blobs</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIV_PROV_TYPE_2</name>
                  <description>Private provisioning type 2 blobs</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Normal operation blobs</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNGSH0</name>
              <description>Random Number Generator State Handle 0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SH0_ANY_MODE</name>
                  <description>When RNGSH0 is 0, RNG DRNG State Handle 0 can be instantiated in any mode. RNGSH0 is set to 0 only for testing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SH0_RANDOM_MODE</name>
                  <description>When RNGSH0 is 1, RNG DRNG State Handle 0 cannot be instantiated in deterministic (test) mode. RNGSHO should be set to 1 before the RNG is instantiated. If it is currently instantiated in a deterministic mode, it will be un-instantiated. Once this bit has been written to a 1, it cannot be changed to a 0 until the next power on reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCK_TRNG</name>
              <description>Lock TRNG Program Mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VIRT_EN</name>
              <description>Virtualization enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_JR_VIRT</name>
                  <description>Disable job ring virtualization</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_JR_VIRT</name>
                  <description>Enable job ring virtualization</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPMRL</name>
              <description>Manufacturing Protection Message Register Lock</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPPKRC</name>
              <description>Manufacturing Protection Private Key Register Clear</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MPCURVE</name>
              <description>Manufacturing Protection Curve</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>JRaDID[%s]</name>
          <description>no description available</description>
          <addressOffset>0x10</addressOffset>
          <register>
            <name>JRDID_MS</name>
            <description>Job Ring Job_Ring DID Register - most significant half</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIM_DID</name>
                <description>Job Ring Owner's DID</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIM_TZ</name>
                <description>Primary TZ</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SDID_MS</name>
                <description>Security Domain Identifier most significant bits</description>
                <bitOffset>5</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_OWN</name>
                <description>TrustZone SecureWorld</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AMTD</name>
                <description>Allow Make Trusted Descriptor</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LAMTD</name>
                <description>Lock AMTD</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRIM_ICID</name>
                <description>Primary ICID</description>
                <bitOffset>19</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>USE_OUT</name>
                <description>USE_OUT</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LDID</name>
                <description>Lock DIDs</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JRDID_LS</name>
            <description>Job Ring Job_Ring DID Register - least significant half</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>OUT_DID</name>
                <description>Output DID</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_ICID</name>
                <description>Job Ring Output ICID</description>
                <bitOffset>19</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DEBUGCTL</name>
          <description>Debug Control Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STOP</name>
              <description>STOP is written to 1 to request that CAAM stop processing jobs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP_ACK</name>
              <description>STOP_ACK will assert when the job queue controller acknowledges that it is stopped.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
