nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>DMA0_AID_ENB</name>
          <description>DMA0 AXI ID Enable Register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>AID0E</name>
              <description>If AID0E=1 then AXI ID 0 is enabled for this DMA engine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID1E</name>
              <description>If AID1E=1 then AXI ID 1 is enabled for this DMA engine.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID2E</name>
              <description>If AID2E=1 then AXI ID 2 is enabled for this DMA engine.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID3E</name>
              <description>If AID3E=1 then AXI ID 3 is enabled for this DMA engine.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID4E</name>
              <description>If AID4E=1 then AXI ID 4 is enabled for this DMA engine.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID5E</name>
              <description>If AID5E=1 then AXI ID 5 is enabled for this DMA engine.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID6E</name>
              <description>If AID6E=1 then AXI ID 6 is enabled for this DMA engine.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID7E</name>
              <description>If AID7E=1 then AXI ID 7 is enabled for this DMA engine.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID8E</name>
              <description>If AID8E=1 then AXI ID 8 is enabled for this DMA engine.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID9E</name>
              <description>If AID9E=1 then AXI ID 9 is enabled for this DMA engine.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID10E</name>
              <description>If AID10E=1 then AXI ID 10 is enabled for this DMA engine.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID11E</name>
              <description>If AID11E=1 then AXI ID 11 is enabled for this DMA engine.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID12E</name>
              <description>If AID12E=1 then AXI ID 12 is enabled for this DMA engine.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID13E</name>
              <description>If AID13E=1 then AXI ID 13 is enabled for this DMA engine.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID14E</name>
              <description>If AID14E=1 then AXI ID 14 is enabled for this DMA engine.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID15E</name>
              <description>If AID15E=1 then AXI ID 15 is enabled for this DMA engine.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_ARD_TC</name>
          <description>DMA0 AXI Read Timing Check Register</description>
          <addressOffset>0x260</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARSC</name>
              <description>AXI Read Sample Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARLC</name>
              <description>AXI Read Late Count</description>
              <bitOffset>24</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARL</name>
              <description>AXI Read Limit</description>
              <bitOffset>48</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARTL</name>
              <description>AXI Read Timer Last</description>
              <bitOffset>60</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARTT</name>
              <description>AXI Read Timer Test</description>
              <bitOffset>61</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARCT</name>
              <description>AXI Read Counter Test</description>
              <bitOffset>62</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARTCE</name>
              <description>AXI Read Timing Check Enable</description>
              <bitOffset>63</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_ARD_LAT</name>
          <description>DMA0 Read Timing Check Latency Register</description>
          <addressOffset>0x26C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SARL</name>
              <description>Sum of the AXI Read Latencies</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_AWR_TC</name>
          <description>DMA0 AXI Write Timing Check Register</description>
          <addressOffset>0x270</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWSC</name>
              <description>AXI Write Sample Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWLC</name>
              <description>AXI Write Late Count</description>
              <bitOffset>24</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWL</name>
              <description>AXI Write Limit</description>
              <bitOffset>48</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWTT</name>
              <description>AXI Write Timer Test</description>
              <bitOffset>61</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWCT</name>
              <description>AXI Write Counter Test</description>
              <bitOffset>62</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWTCE</name>
              <description>AXI Write Timing Check Enable</description>
              <bitOffset>63</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0_AWR_LAT</name>
          <description>DMA0 Write Timing Check Latency Register</description>
          <addressOffset>0x27C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAWL</name>
              <description>Sum of the AXI Write Latencies</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>MPPKR[%s]</name>
          <description>Manufacturing Protection Private Key Register</description>
          <addressOffset>0x300</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>MPPrivK</name>
              <description>MPPrivK. The 512-bit Manufacturing Protection Private Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>MPMR[%s]</name>
          <description>Manufacturing Protection Message Register</description>
          <addressOffset>0x380</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>MPMSG</name>
              <description>Holds 256 bits of message data that will be prepended to the input data to the MPSIGN operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>MPTESTR[%s]</name>
          <description>Manufacturing Protection Test Register</description>
          <addressOffset>0x3C0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TEST_VALUE</name>
              <description>TEST_VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPECC</name>
          <description>Manufacturing Protection ECC Register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MP_SYNDROME</name>
              <description>This is the syndrome produced by the ECC check on the Manufacturing Protection Key that is programmed in the Security Fuse Processor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYOK</name>
                  <description>The MP Key in the SFP passes the ECC check.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYBAD</name>
                  <description>The MP Key in the SFP fails the ECC check, and this is the ECC failure syndrome.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYBAD</name>
                  <description>The MP Key in the SFP fails the ECC check, and this is the ECC failure syndrome.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYBAD</name>
                  <description>The MP Key in the SFP fails the ECC check, and this is the ECC failure syndrome.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYBAD</name>
                  <description>The MP Key in the SFP fails the ECC check, and this is the ECC failure syndrome.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYBAD</name>
                  <description>The MP Key in the SFP fails the ECC check, and this is the ECC failure syndrome.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYBAD</name>
                  <description>The MP Key in the SFP fails the ECC check, and this is the ECC failure syndrome.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYBAD</name>
                  <description>The MP Key in the SFP fails the ECC check, and this is the ECC failure syndrome.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYBAD</name>
                  <description>The MP Key in the SFP fails the ECC check, and this is the ECC failure syndrome.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEYBAD</name>
                  <description>The MP Key in the SFP fails the ECC check, and this is the ECC failure syndrome.</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MP_ZERO</name>
              <description>This bit indicates if the Manufacturing Protection Key that is programmed in the Security Fuse Processor has an all-zero value</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONZERO</name>
                  <description>The MP Key in the SFP has a non-zero value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLZERO</name>
                  <description>The MP Key in the SFP is all zeros (unprogrammed).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>JDKEKR[%s]</name>
          <description>Job Descriptor Key Encryption Key Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>JDKEK</name>
              <description>The 256-bit Job Descriptor Key Encryption Key used to encrypt and decrypt Black Keys.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TDKEKR[%s]</name>
          <description>Trusted Descriptor Key Encryption Key Register</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TDKEK</name>
              <description>The 256-bit Trusted Descriptor Key Encryption Key used to encrypt and decrypt Black Keys.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TDSKR[%s]</name>
          <description>Trusted Descriptor Signing Key Register</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TDSK</name>
              <description>The 256-bit Trusted Descriptor Signing Key used to sign and verify Trusted Descriptors.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SKNR</name>
          <description>Secure Key Nonce Register</description>
          <addressOffset>0x4E0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SK_NONCE_LS</name>
              <description>Secure Key Nonce - Least Significant Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SK_NONCE_MS</name>
              <description>Secure Key Nonce - Most Significant Bits</description>
              <bitOffset>32</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_STA</name>
          <description>DMA Status Register</description>
          <addressOffset>0x50C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA0_ETIF</name>
              <description>DMA0 External Transactions in Flight</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA0_ITIF</name>
              <description>DMA0 Internal Transactions in Flight</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA0_IDLE</name>
              <description>DMA0 is idle. DMA0's command queue is empty.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_AID_7_4_MAP</name>
          <description>DMA_X_AID_7_4_MAP</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>AID4_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID5_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 5.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID6_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 6.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID7_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 7.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
