nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>DMA_X_AID_3_0_MAP</name>
          <description>DMA_X_AID_3_0_MAP</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>AID0_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID1_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID2_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID3_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 3.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_AID_15_12_MAP</name>
          <description>DMA_X_AID_15_12_MAP</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>AID12_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 12.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID13_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 13.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID14_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 14.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID15_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 15.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_AID_11_8_MAP</name>
          <description>DMA_X_AID_11_8_MAP</description>
          <addressOffset>0x51C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>AID8_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 8.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID9_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 9.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID10_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 10.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID11_BID</name>
              <description>This field shows the CAAM Block ID that uses AXI ID 11.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_AID_15_0_EN</name>
          <description>DMA_X AXI ID Map Enable Register</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>AID0E</name>
              <description>If AID0E=1 then AXI ID 0 is enabled for this DMA engine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID1E</name>
              <description>If AID1E=1 then AXI ID 1 is enabled for this DMA engine.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID2E</name>
              <description>If AID2E=1 then AXI ID 2 is enabled for this DMA engine.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID3E</name>
              <description>If AID3E=1 then AXI ID 3 is enabled for this DMA engine.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID4E</name>
              <description>If AID4E=1 then AXI ID 4 is enabled for this DMA engine.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID5E</name>
              <description>If AID5E=1 then AXI ID 5 is enabled for this DMA engine.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID6E</name>
              <description>If AID6E=1 then AXI ID 6 is enabled for this DMA engine.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID7E</name>
              <description>If AID7E=1 then AXI ID 7 is enabled for this DMA engine.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID8E</name>
              <description>If AID8E=1 then AXI ID 8 is enabled for this DMA engine.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID9E</name>
              <description>If AID9E=1 then AXI ID 9 is enabled for this DMA engine.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID10E</name>
              <description>If AID10E=1 then AXI ID 10 is enabled for this DMA engine.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID11E</name>
              <description>If AID11E=1 then AXI ID 11 is enabled for this DMA engine.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID12E</name>
              <description>If AID12E=1 then AXI ID 12 is enabled for this DMA engine.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID13E</name>
              <description>If AID13E=1 then AXI ID 13 is enabled for this DMA engine.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID14E</name>
              <description>If AID14E=1 then AXI ID 14 is enabled for this DMA engine.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AID15E</name>
              <description>If AID15E=1 then AXI ID 15 is enabled for this DMA engine.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_ARTC_CTL</name>
          <description>DMA_X AXI Read Timing Check Control Register</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ART</name>
              <description>AXI Read Timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARL</name>
              <description>AXI Read Limit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARTL</name>
              <description>AXI Read Timer Last</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARTT</name>
              <description>AXI Read Timer Test</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARCT</name>
              <description>AXI Read Counter Test</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARTCE</name>
              <description>AXI Read Timing Check Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_ARTC_LC</name>
          <description>DMA_X AXI Read Timing Check Late Count Register</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARLC</name>
              <description>AXI Read Late Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_ARTC_SC</name>
          <description>DMA_X AXI Read Timing Check Sample Count Register</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARSC</name>
              <description>AXI Read Sample Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_ARTC_LAT</name>
          <description>DMA_X Read Timing Check Latency Register</description>
          <addressOffset>0x53C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SARL</name>
              <description>Sum of the AXI Read Latencies</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_AWTC_CTL</name>
          <description>DMA_X AXI Write Timing Check Control Register</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWT</name>
              <description>AXI Write Timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWL</name>
              <description>AXI Write Limit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWTT</name>
              <description>AXI Write Timer Test</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWCT</name>
              <description>AXI Write Counter Test</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWTCE</name>
              <description>AXI Write Timing Check Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_AWTC_LC</name>
          <description>DMA_X AXI Write Timing Check Late Count Register</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWLC</name>
              <description>AXI Write Late Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_AWTC_SC</name>
          <description>DMA_X AXI Write Timing Check Sample Count Register</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AWSC</name>
              <description>AXI Write Sample Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_X_AWTC_LAT</name>
          <description>DMA_X Write Timing Check Latency Register</description>
          <addressOffset>0x54C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAWL</name>
              <description>Sum of the AXI Write Latencies</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTMCTL</name>
          <description>RNG TRNG Miscellaneous Control Register</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAMP_MODE</name>
              <description>Sample Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VON_DATA_4_SHIFTER_N_CHECKER</name>
                  <description>use Von Neumann data into both Entropy shifter and Statistical Checker</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAW_DATA_4_SHIFTER_N_CHECKER</name>
                  <description>use raw data into both Entropy shifter and Statistical Checker</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VON_4_SHIFTER_N_RAW_4_CHECKER</name>
                  <description>use Von Neumann data into Entropy shifter. Use raw data into Statistical Checker</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_DIV</name>
              <description>Oscillator Divide</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_NOT_DIVIDED</name>
                  <description>use ring oscillator with no divide</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_DIVIDE_BY_2</name>
                  <description>use ring oscillator divided-by-2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_DIVIDE_BY_4</name>
                  <description>use ring oscillator divided-by-4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_DIVIDE_BY_8</name>
                  <description>use ring oscillator divided-by-8</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK_OUT_EN</name>
              <description>Clock Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRNG_ACC</name>
              <description>TRNG Access Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_DEF</name>
              <description>Reset Defaults</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FORCE_SYSCLK</name>
              <description>Force System Clock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCT_FAIL</name>
              <description>Read only: Frequency Count Fail</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FCT_VAL</name>
              <description>Read only: Frequency Count Valid. Indicates that a valid frequency count may be read from RTFRQCNT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENT_VAL</name>
              <description>Read only: Entropy Valid</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TST_OUT</name>
              <description>Read only: Test point inside ring oscillator.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR</name>
              <description>Read: Error status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TSTOP_OK</name>
              <description>TRNG_OK_TO_STOP</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRGM</name>
              <description>Programming Mode Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTSCMISC</name>
          <description>RNG TRNG Statistical Check Miscellaneous Register</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10022</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRUN_MAX</name>
              <description>LONG RUN MAX LIMIT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTY_CNT</name>
              <description>RETRY COUNT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
