nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SMCR_PG0</name>
          <description>Secure Memory Command Register</description>
          <addressOffset>0xBE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command: 1h: Allocate Page - This command allocates the page specified in the PAGE field to the partition specified in the PRTN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PRTN</name>
              <description>Partition: When an Allocate Page or De-allocate Partition command is issued, the action is performed on the partition indicated in the PRTN field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PAGE</name>
              <description>This is the number of the page to be referenced in field CMD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCSR_PG0</name>
          <description>Secure Memory Command Status Register</description>
          <addressOffset>0xBEC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRTN</name>
              <description>Following a Page Inquiry Command, if the PO field is 10 or 11, this field indicates the partition to which the page specified in the PAGE field is allocated</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO</name>
              <description>Page Owner: Following a Page Inquiry Command, this field indicates if the Page is owned by the entity that issued the inquiry, owned by another entity, or unowned</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVAILABLE</name>
                  <description>Available; Unowned: The entity that issued the inquiry may allocate this page to a partition. No zeroization is needed since it has already been cleared, therefore no interrupt should be expected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_PRESENT_OR_INITIALIZED</name>
                  <description>Page does not exist in this version or is not initialized yet.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNAVAILABLE</name>
                  <description>Another entity owns the page. This page is unavailable to the issuer of the inquiry.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OWNED</name>
                  <description>Owned by the entity making the inquiry. The owner may de-allocate this page if its partition is not marked PSP. If the partition to which the page is allocated is designated as CSP, the page will be zeroized upon de-allocation.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AERR</name>
              <description>Allocation Error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CERR</name>
              <description>Command Error</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No Error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_INCOMPLETE_ERROR</name>
                  <description>Command has not yet completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURITY_FAILURE</name>
                  <description>A security failure occurred.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_OVERFLOW_ERROR</name>
                  <description>Command Overflow. Another command was issued by the same Job Ring owner before the owner's previous command completed. The additional command was ignored.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAGE</name>
              <description>Page</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HT0_JD_ADDR</name>
          <description>Holding Tank 0 Job Descriptor Address</description>
          <addressOffset>0xC00</addressOffset>
          <size>64</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JD_ADDR</name>
              <description>Job Descriptor Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>36</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HT0_SD_ADDR</name>
          <description>Holding Tank 0 Shared Descriptor Address</description>
          <addressOffset>0xC08</addressOffset>
          <size>64</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SD_ADDR</name>
              <description>Shared Descriptor Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>36</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HT0_JQ_CTRL_MS</name>
          <description>Holding Tank 0 Job Queue Control, most-significant half</description>
          <addressOffset>0xC10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID</name>
              <description>Job ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRC</name>
              <description>Job Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JR0</name>
                  <description>Job Ring 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR1</name>
                  <description>Job Ring 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR2</name>
                  <description>Job Ring 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR3</name>
                  <description>Job Ring 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTIC</name>
                  <description>RTIC</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JDDS</name>
              <description>Job Descriptor DID Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_SEQ_DID</name>
                  <description>Non-SEQ DID</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_DID</name>
                  <description>SEQ DID</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMTD</name>
              <description>Allow Make Trusted Descriptor</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOB</name>
              <description>Shared or Burst</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HT_ERROR</name>
              <description>Holding Tank Error. (This field is implemented only in versions of CAAM that support prefetching.)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JD_OR_SD_LENGTH_ERROR</name>
                  <description>Job Descriptor or Shared Descriptor length error</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JD_OR_SD_READ_ERROR</name>
                  <description>AXI_error while reading a Job Ring Shared Descriptor or the remainder of a Job Ring Job Descriptor</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWORD_SWAP</name>
              <description>Double Word Swap.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRC_IN_MS_LS_ORDER</name>
                  <description>DWords are in the order most-significant word, least-significant word.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_IN_LS_MS_ORDER</name>
                  <description>DWords are in the order least-significant word, most-significant word.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHR_FROM</name>
              <description>Share From</description>
              <bitOffset>22</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ILE</name>
              <description>Immediate Little Endian</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_BYTE_SWAP</name>
                  <description>No byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE_SWAP</name>
                  <description>Byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOUR</name>
              <description>Four Words. Job Queue Controller will pass at least 4 words of the descriptor to DECO.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WHL</name>
              <description>Whole Descriptor</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HT0_JQ_CTRL_LS</name>
          <description>Holding Tank 0 Job Queue Control, least-significant half</description>
          <addressOffset>0xC14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIM_DID</name>
              <description>Primary DID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRIM_TZ</name>
              <description>Primary TZ</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECUREWORLD</name>
                  <description>TrustZone NonSecureWorld</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECUREWORLD</name>
                  <description>TrustZone SecureWorld</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIM_ICID</name>
              <description>Primary ICID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DID</name>
              <description>Output DID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_ICID</name>
              <description>Output ICID</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HT0_STATUS</name>
          <description>Holding Tank Status</description>
          <addressOffset>0xC1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PEND_0</name>
              <description>Pending for DECO 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_USE</name>
              <description>In Use</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BC</name>
              <description>Been Changed</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JQ_DEBUG_SEL</name>
          <description>Job Queue Debug Select Register</description>
          <addressOffset>0xC24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HT_SEL</name>
              <description>Holding Tank Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JOB_ID</name>
              <description>Job ID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JRJIDU_LS</name>
          <description>Job Ring Job IDs in Use Register, least-significant half</description>
          <addressOffset>0xDBC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JID00</name>
              <description>Job ID 00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JID01</name>
              <description>Job ID 01</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JID02</name>
              <description>Job ID 02</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JID03</name>
              <description>Job ID 03</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JRJDJIFBC</name>
          <description>Job Ring Job-Done Job ID FIFO BC</description>
          <addressOffset>0xDC0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BC</name>
              <description>Been changed</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JRJDJIF</name>
          <description>Job Ring Job-Done Job ID FIFO</description>
          <addressOffset>0xDC4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JOB_ID_ENTRY</name>
              <description>Job ID entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JRJDS1</name>
          <description>Job Ring Job-Done Source 1</description>
          <addressOffset>0xDE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRC</name>
              <description>Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JRJDDA</name>
          <description>Job Ring Job-Done Descriptor Address 0 Register</description>
          <addressOffset>0xE00</addressOffset>
          <size>64</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JD_ADDR</name>
              <description>Job Descriptor Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>36</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
