nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>CTPR_LS</name>
          <description>Compile Time Parameters Register, least-significant half</description>
          <addressOffset>0xFAC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x6403</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KG_DS</name>
              <description>PK generation and digital signature protcols</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KG_DS_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for Public Key Generation and Digital Signatures.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KG_DS_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for Public Key Generation and Digital Signatures.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLOB</name>
              <description>Blob protocol</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOB_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for encapsulating and decapsulating cryptographic blobs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOB_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for encapsulating and decapsulating cryptographic blobs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIFI</name>
              <description>WiFi protocol</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIFI_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for the WIFI protocol.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIFI_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for the WIFI protocol.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIMAX</name>
              <description>WiMax protocol</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIMAX_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for the WIMAX protocol.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIMAX_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for the WIMAX protocol.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRTP</name>
              <description>SRTP protocol</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRTP_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for the SRTP protocol.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRTP_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for the SRTP protocol.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPSEC</name>
              <description>IPSEC protocols</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPSEC_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for the IPSEC protocol.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPSEC_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for the IPSEC protocol.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IKE</name>
              <description>IKE protocols</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IKE_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for the IKE protocol.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IKE_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for the IKE protocol.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSL_TLS</name>
              <description>SSL/TLS protocol</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSL_TLS_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for the SSL and TLS protocols.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSL_TLS_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for the SSL and TLS protocols.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TLS_PRF</name>
              <description>TLS PRF protocol</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TLS_PRF_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for the TLS protocol pseudo-random function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TLS_PRF_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for the TLS protocol pseudo-random function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MACSEC</name>
              <description>MACSEC protocol</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MACSEC_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for the MACSEC protocol.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MACSEC_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for the MACSEC protocol.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSA</name>
              <description>RSA protocol</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSA_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for RSA encrypt and decrypt operations.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSA_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for RSA encrypt and decrypt operations.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P3G_LTE</name>
              <description>3GPP/LTE protocol</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P3G_LTE_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for 3G and LTE protocols.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3G_LTE_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for 3G and LTE protocols.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBL_CRC</name>
              <description>Double CRC protocol</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBL_CRC_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement specialized support for Double CRC.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBL_CRC_PROTOCOL_EXISTS</name>
                  <description>CAAM implements specialized support for Double CRC.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAN_PROT</name>
              <description>Manufacturing Protection protocol</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAN_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement Manufacturing Protection functions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN_PROTOCOL_EXISTS</name>
                  <description>CAAM implements Manufacturing Protection functions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DKP</name>
              <description>Derived Key Protocol</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DERIVED_KEY_PROTOCOL_ABSENT</name>
                  <description>CAAM does not implement the Derived Key Protocol.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DERIVED_KEY_PROTOCOL_EXISTS</name>
                  <description>CAAM implements the Derived Key Protocol.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMSTA</name>
          <description>Secure Memory Status Register</description>
          <addressOffset>0xFB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATE</name>
              <description>Current State. This field represents the current state of the Secure Memory Controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset State</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INIT</name>
                  <description>Initialize State</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal State</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Fail State</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCERR</name>
              <description>Access Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No error occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAGE_NOT_ALLOCATED_ACCESS_ERROR</name>
                  <description>A bus transaction attempted to access a page in Secure Memory, but the page was not allocated to any partition.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION_NOT_GRANTED_ACCESS_ERROR</name>
                  <description>A bus transaction attempted to access a partition, but the transaction's TrustZone World, DID was not granted access to the partition in the partition's SMAG2/1JR registers.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_NOT_ALLOWED_ACCESS_ERROR</name>
                  <description>A bus transaction attempted to read, but reads from this partition are not allowed.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_NOT_ALLOWED_ACCESS_ERROR</name>
                  <description>A bus transaction attempted to write, but writes to this partition are not allowed.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_KEY_READ_NOT_ALLOWED_ACCESS_ERROR</name>
                  <description>A bus transaction attempted a non-key read, but the only reads permitted from this partition are key reads.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOB_IMPORT_EXPORT_ACCESS_ERROR</name>
                  <description>Secure Memory Blob import or export was attempted, but Secure Memory Blob access is not allowed for this partition.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI_PARTITION_BLOB_IMPORT_EXPORT_ERROR</name>
                  <description>A Descriptor attempted a Secure Memory Blob import or export, but not all of the pages referenced were from the same partition.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_SECURE_MEMORY_ADDRESS_ERROR</name>
                  <description>A memory access was directed to Secure Memory, but the specified address is not implemented in Secure Memory. The address was either outside the address range occupied by Secure Memory, or was within an unimplemented portion of the 4kbyte address block occupied by a 1Kbyte or 2Kbyte Secure Memory page.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAGE_BOUNDARY_CROSSING_ERROR</name>
                  <description>A bus transaction was attempted, but the burst would have crossed a page boundary.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNINITIALIZED_PAGE_ACCESS_ERROR</name>
                  <description>An attempt was made to access a page while it was still being initialized.</description>
                  <value>0xD</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DID</name>
              <description>The DID of the bus master whose access to Secure Memory was denied.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NS</name>
              <description>The TrustZone nonsecure bit of the bus master whose access to Secure Memory was denied</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMR_WP</name>
              <description>Secure Memory Registers Write Protected</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PAGE</name>
              <description>Page</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PART</name>
              <description>Partition</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
