nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>P2SMAG1_JR1</name>
          <description>Secure Memory Access Group Registers</description>
          <addressOffset>0x20A2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Gx_ID00</name>
              <description>Bit set to 1 indicates SecureWorld DID 00 is a member of Access Group x.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID01</name>
              <description>Bit set to 1 indicates SecureWorld DID 01 is a member of Access Group x.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID02</name>
              <description>Bit set to 1 indicates SecureWorld DID 02 is a member of Access Group x (1 or 2).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID03</name>
              <description>Bit set to 1 indicates SecureWorld DID 03 is a member of Access Group x (1 or 2).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID04</name>
              <description>Bit set to 1 indicates SecureWorld DID 04 is a member of Access Group x (1 or 2).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID05</name>
              <description>Bit set to 1 indicates SecureWorld DID 05 is a member of Access Group x (1 or 2).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID06</name>
              <description>Bit set to 1 indicates SecureWorld DID 06 is a member of Access Group x (1 or 2).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID07</name>
              <description>Bit set to 1 indicates SecureWorld DID 07 is a member of Access Group x (1 or 2).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID08</name>
              <description>Bit set to 1 indicates SecureWorld DID 08 is a member of Access Group x (1 or 2).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID09</name>
              <description>Bit set to 1 indicates SecureWorld DID 09 is a member of Access Group x (1 or 2).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID10</name>
              <description>Bit set to 1 indicates SecureWorld DID 10 is a member of Access Group x (1 or 2).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID11</name>
              <description>Bit set to 1 indicates SecureWorld DID 11 is a member of Access Group x (1 or 2).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID12</name>
              <description>Bit set to 1 indicates SecureWorld DID 12 is a member of Access Group x (1 or 2).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID13</name>
              <description>Bit set to 1 indicates SecureWorld DID 13 is a member of Access Group x (1 or 2).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID14</name>
              <description>Bit set to 1 indicates SecureWorld DID 14 is a member of Access Group x (1 or 2).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID15</name>
              <description>Bit set to 1 indicates SecureWorld DID 15 is a member of Access Group x (1 or 2).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID16</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 00 is a member of Access Group x (1 or 2).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID17</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 01 is a member of Access Group x (1 or 2).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID18</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 02 is a member of Access Group x (1 or 2).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID19</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 03 is a member of Access Group x (1 or 2).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID20</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 04 is a member of Access Group x (1 or 2).</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID21</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 05 is a member of Access Group x (1 or 2).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID22</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 06 is a member of Access Group x (1 or 2).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID23</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 07 is a member of Access Group x (1 or 2).</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID24</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 08 is a member of Access Group x (1 or 2).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID25</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 09 is a member of Access Group x (1 or 2).</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID26</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 10 is a member of Access Group x (1 or 2).</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID27</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 11 is a member of Access Group x (1 or 2).</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID28</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 12 is a member of Access Group x (1 or 2).</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID29</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 13 is a member of Access Group x (1 or 2).</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID30</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 14 is a member of Access Group x (1 or 2).</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID31</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 15 is a member of Access Group x (1 or 2).</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P3SDID_JR1</name>
          <description>Partition 3 SDID register</description>
          <addressOffset>0x20A30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDID</name>
              <description>Security Domain Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
