nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>RSTA</name>
          <description>RTIC Status Register</description>
          <addressOffset>0x60004</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x40000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BSY</name>
              <description>RTIC Idle/Busy Status. When busy, the RTIC cannot be written to.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>RTIC Idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>RTIC Busy.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HD</name>
              <description>Hash Once Operation Completed (Hash Done)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOT_AUTH_DISABLED</name>
                  <description>Boot authentication disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT_AUTH_ENABLED</name>
                  <description>Authenticate code/generate reference hash value. This bit cannot be modified during run-time checking mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV</name>
              <description>Security Violation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKS_AUTHENTICATED</name>
                  <description>Memory block contents authenticated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKS_HASH_MISMATCH</name>
                  <description>Memory block hash doesn't match reference value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HE</name>
              <description>Hashing Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCKS_AUTHENTICATED</name>
                  <description>Memory block contents authenticated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKS_HASH_MISMATCH</name>
                  <description>Memory block hash doesn't match reference value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIS</name>
              <description>Memory Integrity Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID_OR_UNKNOWN</name>
                  <description>Memory Block X is valid or state unknown</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORRUPTED</name>
                  <description>Memory Block X has been corrupted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AE</name>
              <description>Address Error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_VALID</name>
                  <description>All reads by RTIC were valid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_ERROR</name>
                  <description>An illegal address was accessed by the RTIC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WE</name>
              <description>RTIC Watchdog Error</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WATCHDOG_GOING</name>
                  <description>No RTIC Watchdog timer error has occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WATCHDOG_ERROR</name>
                  <description>RTIC Watchdog timer has expired prior to completing a round of hashing.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABH</name>
              <description>All Blocks Hashed</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOD</name>
              <description>Hash Once Blocks Disabled</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RTD</name>
              <description>Run Time Blocks Disabled</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CS</name>
              <description>RTIC Current State. Indicates the current state of the RTIC controller.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle State</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_HASH</name>
                  <description>Single Hash State</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_TIME</name>
                  <description>Run-time State</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error State</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCMD</name>
          <description>RTIC Command Register</description>
          <addressOffset>0x6000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CINT</name>
              <description>Clear Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEEP_INTR</name>
                  <description>Do not clear interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_INTR</name>
                  <description>Clear interrupt. This bit cannot be modified during run-time checking mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HO</name>
              <description>Hash once</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOT_AUTH_DISABLED</name>
                  <description>Boot authentication disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT_AUTH_ENABLED</name>
                  <description>Authenticate code/generate reference hash value. This bit cannot be modified during run-time checking mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC</name>
              <description>Run time check</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Run-time checking disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINOUS</name>
                  <description>Verify run-time memory blocks continually</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTD</name>
              <description>Run Time Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Allow Run Time Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Prevent Run Time Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCTL</name>
          <description>RTIC Control Register</description>
          <addressOffset>0x60014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IE</name>
              <description>Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Interrupts disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Interrupts enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RREQS</name>
              <description>RTIC Request Size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOME</name>
              <description>Hash Once Memory Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTME</name>
              <description>Run Time Memory Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTMU</name>
              <description>Run Time Memory Unlock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RALG</name>
              <description>RTIC Algorithm Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RIDLE</name>
              <description>RTIC setting for the IPG_IDLE signal</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTHR</name>
          <description>RTIC Throttle Register</description>
          <addressOffset>0x6001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTHR</name>
              <description>Run Time Mode DMA Throttle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RWDOG</name>
          <description>RTIC Watchdog Timer</description>
          <addressOffset>0x60028</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RWDOG</name>
              <description>Run Time Watchdog Time-Out value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REND</name>
          <description>RTIC Endian Register</description>
          <addressOffset>0x60034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REPO</name>
              <description>RTIC Endian Platform Override</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE_SWAP_BLOCK_A</name>
                  <description>Byte Swap Memory Block A</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBS</name>
              <description>RTIC Byte Swap</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE_SWAP_BLOCK_A</name>
                  <description>Byte Swap Memory Block A</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RHWS</name>
              <description>RTIC Half-Word Swap</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALFWORD_SWAP_BLOCK_A</name>
                  <description>Half-Word Swap Memory Block A</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWS</name>
              <description>RTIC Word Swap</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WORD_SWAP_BLOCK_A</name>
                  <description>Word Swap Memory Block A</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REIR0RTIC</name>
          <description>Recoverable Error Interrupt Record 0 for RTIC</description>
          <addressOffset>0x60E00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TYPE</name>
              <description>This field indicates the type of the recoverable error</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MISS</name>
              <description>If MISS=1, a second recoverable error associated with RTIC occurred before REIR0RTIC was written following a previous RTIC recoverable error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REIR2RTIC</name>
          <description>Recoverable Error Interrupt Record 2 for RTIC</description>
          <addressOffset>0x60E08</addressOffset>
          <size>64</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>This register holds the address associated with the recoverable RTIC error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REIR4RTIC</name>
          <description>Recoverable Error Interrupt Record 4 for RTIC</description>
          <addressOffset>0x60E10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ICID</name>
              <description>This field holds the ICID associated with the recoverable error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DID</name>
              <description>This field holds the DID associated with the recoverable error.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AXCACHE</name>
              <description>This field holds the AXI cache control transaction attribute used for the memory access.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AXPROT</name>
              <description>This field holds the AXI protection transaction attribute used for the memory access.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RWB</name>
              <description>This field specifies whether the memory access was a read or write.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR</name>
              <description>This field holds the AXI error response associated with the recoverable error.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MIX</name>
              <description>This field holds the memory interface index associated with the recoverable error.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REIR5RTIC</name>
          <description>Recoverable Error Interrupt Record 5 for RTIC</description>
          <addressOffset>0x60E14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BID</name>
              <description>This field holds the block identifier (see Internal Block ID) of the source of the AXI transaction associated with the recoverable error</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAFE</name>
              <description>SAFE indicates whether the AXI transaction associated with the recoverable error was a &quot;safe&quot; transaction</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMA</name>
              <description>This field indicates whether the bus transaction associated with the recoverable error was an attempted access to CAAM Secure Memory</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
