nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>C0CCTRL</name>
          <description>CCB 0 CHA Control Register</description>
          <addressOffset>0x80034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCB</name>
              <description>Reset CCB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DO_NOT_CCB</name>
                  <description>Do Not Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_CCB</name>
                  <description>Reset CCB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES</name>
              <description>Reset AESA. Writing a 1 to this bit resets the AES Accelerator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DO_NOT_RESET_AESA</name>
                  <description>Do Not Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_AESA</name>
                  <description>Reset AES Accelerator</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DES</name>
              <description>Reset DESA. Writing a 1 to this bit resets the DES Accelerator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DO_NOT_RESET_DESA</name>
                  <description>Do Not Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_DESA</name>
                  <description>Reset DES Accelerator</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PK</name>
              <description>Reset PKHA. Writing a 1 to this bit resets the Public Key Hardware Accelerator.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DO_NOT_RESET_PKHA</name>
                  <description>Do Not Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_PKHA</name>
                  <description>Reset Public Key Hardware Accelerator</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MD</name>
              <description>Reset MDHA. Writing a 1 to this bit resets the Message Digest Hardware Accelerator.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DO_NOT_RESET_MDHA</name>
                  <description>Do Not Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_MDHA</name>
                  <description>Reset Message Digest Hardware Accelerator</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRC</name>
              <description>Reset CRCA. Writing a 1 to this bit resets the CRC Accelerator.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DO_NOT_RESET_CRCA</name>
                  <description>Do Not Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_CRCA</name>
                  <description>Reset CRC Accelerator</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNG</name>
              <description>Reset Random Number Generator. Writing a 1 to this bit resets the Random Number Generator.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DO_NOT_RESET_RNG</name>
                  <description>Do Not Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_RNG</name>
                  <description>Reset Random Number Generator Block.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UA0</name>
              <description>Unload the PKHA A0 Memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_UNLOAD_PKHA_A0</name>
                  <description>Don't unload the PKHA A0 Memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOAD_PKHA_A0</name>
                  <description>Unload the PKHA A0 Memory into OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UA1</name>
              <description>Unload the PKHA A1 Memory</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_UNLOAD_PKHA_A1</name>
                  <description>Don't unload the PKHA A1 Memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOAD_PKHA_A1</name>
                  <description>Unload the PKHA A1 Memory into OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UA2</name>
              <description>Unload the PKHA A2 Memory</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_UNLOAD_PKHA_A2</name>
                  <description>Don't unload the PKHA A2 Memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOAD_PKHA_A2</name>
                  <description>Unload the PKHA A2 Memory into OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UA3</name>
              <description>Unload the PKHA A3 Memory</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_UNLOAD_PKHA_A3</name>
                  <description>Don't unload the PKHA A3 Memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOAD_PKHA_A3</name>
                  <description>Unload the PKHA A3 Memory into OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UB0</name>
              <description>Unload the PKHA B0 Memory</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_UNLOAD_PKHA_B0</name>
                  <description>Don't unload the PKHA B0 Memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOAD_PKHA_B0</name>
                  <description>Unload the PKHA B0 Memory into OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UB1</name>
              <description>Unload the PKHA B1 Memory</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_UNLOAD_PKHA_B1</name>
                  <description>Don't unload the PKHA B1 Memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOAD_PKHA_B1</name>
                  <description>Unload the PKHA B1 Memory into OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UB2</name>
              <description>Unload the PKHA B2 Memory</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_UNLOAD_PKHA_B2</name>
                  <description>Don't unload the PKHA B2 Memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOAD_PKHA_B2</name>
                  <description>Unload the PKHA B2 Memory into OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UB3</name>
              <description>Unload the PKHA B3 Memory</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_UNLOAD_PKHA_B3</name>
                  <description>Don't unload the PKHA B3 Memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOAD_PKHA_B3</name>
                  <description>Unload the PKHA B3 Memory into OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UN</name>
              <description>Unload the PKHA N Memory</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_UNLOAD_PKHA_N</name>
                  <description>Don't unload the PKHA N Memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOAD_PKHA_N</name>
                  <description>Unload the PKHA N Memory into OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UA</name>
              <description>Unload the PKHA A Memory</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_UNLOAD_PKHA_A</name>
                  <description>Don't unload the PKHA A Memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOAD_PKHA_A</name>
                  <description>Unload the PKHA A Memory into OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UB</name>
              <description>Unload the PKHA B Memory</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_UNLOAD_PKHA_B</name>
                  <description>Don't unload the PKHA B Memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOAD_PKHA_B</name>
                  <description>Unload the PKHA B Memory into OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>C0ICTL</name>
          <description>CCB 0 Interrupt Control Register</description>
          <addressOffset>0x8003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADI</name>
              <description>AESA done interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DDI</name>
              <description>DESA done interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PDI</name>
              <description>PKHA (Public Key) done interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MDI</name>
              <description>MDHA (hashing) done interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CDI</name>
              <description>CRCA done interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RNDI</name>
              <description>RNG done interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AEI</name>
              <description>AESA Error Interrupt asserted.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AESA_ERROR</name>
                  <description>No AESA error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESA_ERROR</name>
                  <description>AESA error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEI</name>
              <description>DESA Error Interrupt asserted.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DESA_ERROR</name>
                  <description>No DESA error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DESA_ERROR</name>
                  <description>DESA error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEI</name>
              <description>PKHA (Public Key) Error Interrupt asserted.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PKHA_ERROR</name>
                  <description>No PKHA error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKHA_ERROR</name>
                  <description>PKHA error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEI</name>
              <description>MDHA (hashing) Error Interrupt asserted.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MDHA_ERROR</name>
                  <description>No MDHA error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDHA_ERROR</name>
                  <description>MDHA error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEI</name>
              <description>CRCA Error Interrupt asserted.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CRCA_ERROR</name>
                  <description>No CRCA error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRCA_ERROR</name>
                  <description>CRCA error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNEI</name>
              <description>RNG Error Interrupt asserted.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_RNG_ERROR</name>
                  <description>No RNG error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RNG_ERROR</name>
                  <description>RNG error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
