nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>C0CWR</name>
          <description>CCB 0 Clear Written Register</description>
          <addressOffset>0x80044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1M</name>
              <description>Clear the Class 1 Mode Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_C1_MODE</name>
                  <description>Don't clear the Class 1 Mode Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_C1_MODE</name>
                  <description>Clear the Class 1 Mode Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C1DS</name>
              <description>Clear the Class 1 Data Size Register</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_C1_DATA_SIZE</name>
                  <description>Don't clear the Class 1 Data Size Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_C1_DATA_SIZE</name>
                  <description>Clear the Class 1 Data Size Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C1ICV</name>
              <description>Clear the Class 1 ICV Size Register</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_C1_ICV_SIZE</name>
                  <description>Don't clear the Class 1 ICV Size Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_C1_ICV_SIZE</name>
                  <description>Clear the Class 1 ICV Size Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C1C</name>
              <description>Clear the Class 1 Context Register</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_C1_CTXR</name>
                  <description>Don't clear the Class 1 Context Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_C1_CTXR</name>
                  <description>Clear the Class 1 Context Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C1K</name>
              <description>Clear the Class 1 Key Register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_C1_KEYR</name>
                  <description>Don't clear the Class 1 Key Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_C1_KEYR</name>
                  <description>Clear the Class 1 Key Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPKA</name>
              <description>Clear the PKHA A Size Register</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_PKHA_A_SIZE</name>
                  <description>Don't clear the PKHA A Size Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_PKHA_A_SIZE</name>
                  <description>Clear the PKHA A Size Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPKB</name>
              <description>Clear the PKHA B Size Register</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_PKHA_B_SIZE</name>
                  <description>Don't clear the PKHA B Size Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_PKHA_B_SIZE</name>
                  <description>Clear the PKHA B Size Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPKN</name>
              <description>Clear the PKHA N Size Register</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_PKHA_N_SIZE</name>
                  <description>Don't clear the PKHA N Size Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_PKHA_N_SIZE</name>
                  <description>Clear the PKHA N Size Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPKE</name>
              <description>Clear the PKHA E Size Register</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_PKHA_E_SIZE</name>
                  <description>Don't clear the PKHA E Size Register..</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_PKHA_E_SIZE</name>
                  <description>Clear the PKHA E Size Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C2M</name>
              <description>Clear the Class 2 Mode Register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_C2_MODE</name>
                  <description>Don't clear the Class 2 Mode Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_C2_MODE</name>
                  <description>Clear the Class 2 Mode Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C2DS</name>
              <description>Clear the Class 2 Data Size Registers</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_C2_DATA_SIZE</name>
                  <description>Don't clear the Class 2 Data Size Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_C2_DATA_SIZE</name>
                  <description>Clear the Class 2 Data Size Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C2C</name>
              <description>Clear the Class 2 Context Register</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_C2_CTXR</name>
                  <description>Don't clear the Class 2 Context Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_C2_CTXR</name>
                  <description>Clear the Class 2 Context Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C2K</name>
              <description>Clear the Class 2 Key Register</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_C2_KEYR</name>
                  <description>Don't clear the Class 2 Key Register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_C2_KEYR</name>
                  <description>Clear the Class 2 Key Register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDS</name>
              <description>Clear Descriptor Sharing signal</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_SD_SIGNAL</name>
                  <description>Don't clear the shared descriptor signal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_SD_SIGNAL</name>
                  <description>Clear the shared descriptor signal.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C2D</name>
              <description>Clear Class 2 Done Interrupt. Writing a 1 to this bit clears the Class 2 done interrupt.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_C2_DONE_INT</name>
                  <description>Don't clear the Class 2 done interrrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_C2_DONE_INT</name>
                  <description>Clear the Class 2 done interrrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C1D</name>
              <description>Clear Class 1 Done Interrupt. Writing a 1 to this bit clears the Class 1 done interrupt.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_C1_DONE_INT</name>
                  <description>Don't clear the Class 1 done interrrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_C1_DONE_INT</name>
                  <description>Clear the Class 1 done interrrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C2RST</name>
              <description>Reset Class 2 CHA</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_RESET_C2_CHA</name>
                  <description>Don't reset the Class 2 CHA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_C2_CHA</name>
                  <description>Reset the Class 2 CHA.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C1RST</name>
              <description>Reset Class 1 CHA</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_RESET_C1_CHA</name>
                  <description>Don't reset the Class 1 CHA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_C1_CHA</name>
                  <description>Reset the Class 1 CHA.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COF</name>
              <description>Clear Output FIFO. Writing a 1 to this bit causes the Output FIFO to be cleared.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_OFIFO</name>
                  <description>Don't clear the OFIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_OFIFO</name>
                  <description>Clear the OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIF</name>
              <description>Clear Input FIFO (and NFIFO)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_CLEAR_IFIFO</name>
                  <description>Don't clear the IFIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_IFIFO</name>
                  <description>Clear the IFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
