nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>C0C2KEYR22</name>
          <description>CCB 0 Class 2 Key Register Word 22</description>
          <addressOffset>0x80658</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2KEY</name>
              <description>Class 2 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2KEYR23</name>
          <description>CCB 0 Class 2 Key Register Word 23</description>
          <addressOffset>0x8065C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2KEY</name>
              <description>Class 2 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2KEYR24</name>
          <description>CCB 0 Class 2 Key Register Word 24</description>
          <addressOffset>0x80660</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2KEY</name>
              <description>Class 2 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2KEYR25</name>
          <description>CCB 0 Class 2 Key Register Word 25</description>
          <addressOffset>0x80664</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2KEY</name>
              <description>Class 2 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2KEYR26</name>
          <description>CCB 0 Class 2 Key Register Word 26</description>
          <addressOffset>0x80668</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2KEY</name>
              <description>Class 2 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2KEYR27</name>
          <description>CCB 0 Class 2 Key Register Word 27</description>
          <addressOffset>0x8066C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2KEY</name>
              <description>Class 2 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2KEYR28</name>
          <description>CCB 0 Class 2 Key Register Word 28</description>
          <addressOffset>0x80670</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2KEY</name>
              <description>Class 2 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2KEYR29</name>
          <description>CCB 0 Class 2 Key Register Word 29</description>
          <addressOffset>0x80674</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2KEY</name>
              <description>Class 2 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2KEYR30</name>
          <description>CCB 0 Class 2 Key Register Word 30</description>
          <addressOffset>0x80678</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2KEY</name>
              <description>Class 2 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2KEYR31</name>
          <description>CCB 0 Class 2 Key Register Word 31</description>
          <addressOffset>0x8067C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2KEY</name>
              <description>Class 2 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0FIFOSTA</name>
          <description>CCB 0 FIFO Status Register</description>
          <addressOffset>0x807C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DECOOQHEAD</name>
              <description>This is the current head of the DECO Alignment Block queue located within the Output Data FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAOQHEAD</name>
              <description>This is the current head of the DMA queue located within the Output Data FIFO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>C2IQHEAD</name>
              <description>This is the current head of the Class 2 Alignment Block queue located within the Input Data FIFO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>C1IQHEAD</name>
              <description>This is the current head of the Class 1 Alignment Block queue located within the Input Data FIFO</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0NFIFO</name>
          <description>CCB 0 iNformation FIFO When STYPE != 10b</description>
          <alternateGroup>NFIFO2</alternateGroup>
          <addressOffset>0x807D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DL</name>
              <description>Data Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AST</name>
              <description>Additional Source Types</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OC</name>
              <description>OFIFO Continuation - This bit causes the final word to not be popped from the Output Data FIFO.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POP_OFIFO_FINAL</name>
                  <description>Allow the final word to be popped from the Output Data FIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DONT_POP_OFIFO_FINAL</name>
                  <description>Don't pop the final word from the Output Data FIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTYPE</name>
              <description>Pad Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BND</name>
              <description>Boundary padding</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_PAD</name>
                  <description>Don't pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAD_TO_BOUNDARY</name>
                  <description>Pad to the next 16-byte boundary.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTYPE</name>
              <description>Data Type</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STYPE</name>
              <description>Source Type</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FC1</name>
              <description>Flush Class 1. Flush the remainder of the data out of the Class 1 alignment block.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_FLUSH_C1</name>
                  <description>Don't flush Class 1 data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLUSH_C1</name>
                  <description>Flush Class 1 data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC2</name>
              <description>Flush Class 2</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_FLUSH_C2</name>
                  <description>Don't flush Class 2 data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLUSH_C2</name>
                  <description>Flush Class 2 data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LC1</name>
              <description>Last Class 1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LAST_C1</name>
                  <description>This is not the last Class 1 data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST_C1</name>
                  <description>This is the last Class 1 data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LC2</name>
              <description>Last Class 2</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LAST_C2</name>
                  <description>This is not the last Class 2 data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST_C2</name>
                  <description>This is the last Class 2 data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEST</name>
              <description>Destination</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECO</name>
                  <description>DECO Alignment Block. If DTYPE == Eh, data sent to the DECO Alignment Block is dropped. This is used to skip over input data. An error is generated if a DTYPE other than Eh (drop) or Fh (message) is used with the DECO Alignment Block destination.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLASS_1</name>
                  <description>Class 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLASS_2</name>
                  <description>Class 2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLASS_1_2</name>
                  <description>Both Class 1 and Class 2.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
