nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>C0NFIFO_2</name>
          <description>CCB 0 iNformation FIFO When STYPE == 10b</description>
          <alternateGroup>NFIFO2</alternateGroup>
          <addressOffset>0x807D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PL</name>
              <description>Pad Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PS</name>
              <description>Pad Snoop</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FROM_PAD_BLOCK</name>
                  <description>C2 CHA snoops pad data from padding block.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FROM_OFIFO</name>
                  <description>C2 CHA snoops pad data from OFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BM</name>
              <description>Boundary Minus 1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOUND_PAD_NOT_MINUS_1</name>
                  <description>When padding, pad to power-of-2 boundary.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOUND_PAD_MINUS_1</name>
                  <description>When padding, pad to power-of-2 boundary minus 1 byte.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Prediction Resistance - If PTYPE specifies random data, setting PR=1 causes the RNG to supply random data for prediction resistance (i</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PRED_RES</name>
                  <description>No prediction resistance.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRED_RES</name>
                  <description>Prediction resistance.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTYPE</name>
              <description>Pad Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_0</name>
                  <description>All Zero.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANDOM_NON_0</name>
                  <description>Random with nonzero bytes.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCREMENT_START_1</name>
                  <description>Incremented (starting with 01h), followed by a byte containing the value N-1, i.e., if N==1, a single byte is output with value 0h.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANDOM</name>
                  <description>Random.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_0_LAST_BYTE_NUMBER_OF_BYTES</name>
                  <description>All Zero with last byte containing the number of 0 bytes, i.e., if N==1, a single byte is output with value 0h.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANDOM_NON_0_LAST_BYTE_0</name>
                  <description>Random with nonzero bytes with last byte 0.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_NUMBER_OF_BYTES_MINUS_1</name>
                  <description>N bytes of padding all containing the value N-1.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANDOM_NON_0_LAST_BYTE_NUMBER_OF_BYTES</name>
                  <description>Random with nonzero bytes, with the last byte containing the value N-1.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BND</name>
              <description>Boundary padding</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PADDING</name>
                  <description>Don't add boundary padding.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PADDING</name>
                  <description>Add boundary padding.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTYPE</name>
              <description>Data Type</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STYPE</name>
              <description>Source Type</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FC1</name>
              <description>Flush Class 1. Flush the remainder of the data out of the Class 1 alignment block.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_FLUSH_C1</name>
                  <description>Don't flush the Class 1 data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLUSH_C1</name>
                  <description>Flush the Class 1 data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC2</name>
              <description>Flush Class 2</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_FLUSH_C2</name>
                  <description>Don't flush the Class 2 data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLUSH_C2</name>
                  <description>Flush the Class 2 data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LC1</name>
              <description>Last Class 1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LC1_DATA</name>
                  <description>This is not the last Class 1 data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LC1_DATA</name>
                  <description>This is the last Class 1 data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LC2</name>
              <description>Last Class 2</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LC2_DATA</name>
                  <description>This is not the last Class 2 data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LC2_DATA</name>
                  <description>This is the last Class 2 data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEST</name>
              <description>Destination</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECO</name>
                  <description>DECO Alignment Block. If DTYPE is Eh, data sent to the DECO Alignment Block is dropped. This is used to skip over input data. An error is generated if a DTYPE other than Eh (drop) or Fh (message) is used with the DECO Alignment Block destination.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLASS_1</name>
                  <description>Class 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLASS_2</name>
                  <description>Class 2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLASS_1_2</name>
                  <description>Both Class 1 and Class 2.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>C0IFIFO</name>
          <description>CCB 0 Input Data FIFO</description>
          <addressOffset>0x807E0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IFIFO</name>
              <description>Input Data FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0OFIFO</name>
          <description>CCB 0 Output Data FIFO</description>
          <addressOffset>0x807F0</addressOffset>
          <size>64</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFIFO</name>
              <description>Output FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0JQCR_MS</name>
          <description>DECO0 Job Queue Control Register, most-significant half</description>
          <addressOffset>0x80800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID</name>
              <description>Job ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRC</name>
              <description>Job Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JR0</name>
                  <description>Job Ring 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR1</name>
                  <description>Job Ring 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR2</name>
                  <description>Job Ring 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR3</name>
                  <description>Job Ring 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTIC</name>
                  <description>RTIC</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMTD</name>
              <description>Allow Make Trusted Descriptor</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMTD_NOT_SET</name>
                  <description>The Allowed Make Trusted Descriptor bit was NOT set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMTD_SET</name>
                  <description>The Allowed Make Trusted Descriptor bit was set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOB</name>
              <description>Shared Descriptor burst</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SD_NOT_LOADED</name>
                  <description>Shared Descriptor has NOT been loaded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SD_LOADED</name>
                  <description>Shared Descriptor HAS been loaded.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWS</name>
              <description>Double word swap. Causes/allows dword swapping of addresses, and MOVE and MATH immediate values.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DWS</name>
                  <description>Double Word Swap is NOT set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DWS</name>
                  <description>Double Word Swap is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHR_FROM</name>
              <description>Share From</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ILE</name>
              <description>Immediate Little Endian</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_BYTE_SWAP</name>
                  <description>No byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE_SWAP</name>
                  <description>Byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOUR</name>
              <description>Four Words. job queue controller is passing at least 4 words of the Descriptor to DECO.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_FOUR_WORDS</name>
                  <description>DECO has not been given at least four words of the descriptor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_WORDS</name>
                  <description>DECO has been given at least four words of the descriptor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WHL</name>
              <description>Whole Descriptor</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_WHOLE_DESC</name>
                  <description>DECO has not been given the whole descriptor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WHOLE_DESC</name>
                  <description>DECO has been given the whole descriptor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SING</name>
              <description>Single Step Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SINGLE_STEP_MODE</name>
                  <description>Do not tell DECO to execute the descriptor in single-step mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_STEP_MODE</name>
                  <description>Tell DECO to execute the descriptor in single-step mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STEP</name>
              <description>Step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_STEP</name>
                  <description>DECO has not been told to execute the next command in the descriptor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEP</name>
                  <description>DECO has been told to execute the next command in the descriptor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>D0JQCR_LS</name>
          <description>DECO0 Job Queue Control Register, least-significant half</description>
          <addressOffset>0x80804</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DAR</name>
          <description>DECO0 Descriptor Address Register</description>
          <addressOffset>0x80808</addressOffset>
          <size>64</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPTR</name>
              <description>Descriptor Pointer. Memory address of the Descriptor. Needed for write-back purposes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>36</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
