nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>D0DESB44</name>
          <description>DECO0 Descriptor Buffer Word 44</description>
          <addressOffset>0x80AB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB45</name>
          <description>DECO0 Descriptor Buffer Word 45</description>
          <addressOffset>0x80AB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB46</name>
          <description>DECO0 Descriptor Buffer Word 46</description>
          <addressOffset>0x80AB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB47</name>
          <description>DECO0 Descriptor Buffer Word 47</description>
          <addressOffset>0x80ABC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB48</name>
          <description>DECO0 Descriptor Buffer Word 48</description>
          <addressOffset>0x80AC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB49</name>
          <description>DECO0 Descriptor Buffer Word 49</description>
          <addressOffset>0x80AC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB50</name>
          <description>DECO0 Descriptor Buffer Word 50</description>
          <addressOffset>0x80AC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB51</name>
          <description>DECO0 Descriptor Buffer Word 51</description>
          <addressOffset>0x80ACC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB52</name>
          <description>DECO0 Descriptor Buffer Word 52</description>
          <addressOffset>0x80AD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB53</name>
          <description>DECO0 Descriptor Buffer Word 53</description>
          <addressOffset>0x80AD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB54</name>
          <description>DECO0 Descriptor Buffer Word 54</description>
          <addressOffset>0x80AD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB55</name>
          <description>DECO0 Descriptor Buffer Word 55</description>
          <addressOffset>0x80ADC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB56</name>
          <description>DECO0 Descriptor Buffer Word 56</description>
          <addressOffset>0x80AE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB57</name>
          <description>DECO0 Descriptor Buffer Word 57</description>
          <addressOffset>0x80AE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB58</name>
          <description>DECO0 Descriptor Buffer Word 58</description>
          <addressOffset>0x80AE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB59</name>
          <description>DECO0 Descriptor Buffer Word 59</description>
          <addressOffset>0x80AEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB60</name>
          <description>DECO0 Descriptor Buffer Word 60</description>
          <addressOffset>0x80AF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB61</name>
          <description>DECO0 Descriptor Buffer Word 61</description>
          <addressOffset>0x80AF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB62</name>
          <description>DECO0 Descriptor Buffer Word 62</description>
          <addressOffset>0x80AF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB63</name>
          <description>DECO0 Descriptor Buffer Word 63</description>
          <addressOffset>0x80AFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DJR</name>
          <description>DECO0 Debug Job Register</description>
          <addressOffset>0x80E00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID</name>
              <description>Job ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRC</name>
              <description>Job Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JR0</name>
                  <description>Job Ring 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR1</name>
                  <description>Job Ring 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR2</name>
                  <description>Job Ring 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR3</name>
                  <description>Job Ring 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTIC</name>
                  <description>RTIC</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JDDS</name>
              <description>Job Descriptor DID Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_SEQ_DID</name>
                  <description>Non-SEQ DID</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEQ_DID</name>
                  <description>SEQ DID</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMTD</name>
              <description>Allow Make Trusted Descriptor</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMTD_NOT_SET</name>
                  <description>The Allowed Make Trusted Descriptor bit was NOT set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMTD_SET</name>
                  <description>The Allowed Make Trusted Descriptor bit was set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GSD</name>
              <description>Got Shared Descriptor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DID_NOT_GET_SD</name>
                  <description>Shared Descriptor was NOT obtained from another DECO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GOT_SD</name>
                  <description>Shared Descriptor was obtained from another DECO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWS</name>
              <description>Double Word Swap. Double word swapping was set.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DWS</name>
                  <description>Double Word Swap is NOT set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DWS</name>
                  <description>Double Word Swap is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHR_FROM</name>
              <description>Share From</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ILE</name>
              <description>Immediate Little Endian</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_BYTE_SWAP</name>
                  <description>No byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE_SWAP</name>
                  <description>Byte-swapping is performed for immediate data transferred to or from the Descriptor Buffer.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOUR</name>
              <description>Four Words</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_FOUR_WORDS</name>
                  <description>DECO has not been given at least four words of the descriptor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_WORDS</name>
                  <description>DECO has been given at least four words of the descriptor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WHL</name>
              <description>Whole Descriptor</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_WHOLE_DESC</name>
                  <description>DECO has not been given the whole descriptor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WHOLE_DESC</name>
                  <description>DECO has been given the whole descriptor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SING</name>
              <description>Single Step Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SINGLE_STEP_MODE</name>
                  <description>DECO has not been told to execute the descriptor in single-step mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_STEP_MODE</name>
                  <description>DECO has been told to execute the descriptor in single-step mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STEP</name>
              <description>Step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_STEP</name>
                  <description>DECO has not been told to execute the next command in the descriptor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEP</name>
                  <description>DECO has been told to execute the next command in the descriptor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
