nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>CSISR</name>
          <description>CSI Status Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80004000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DRDY</name>
              <description>RXFIFO Data Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DRDY_0</name>
                  <description>No data (word) is ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRDY_1</name>
                  <description>At least 1 datum (word) is ready in RXFIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECC_INT</name>
              <description>CCIR Error Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECC_INT_0</name>
                  <description>No error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECC_INT_1</name>
                  <description>Error is detected in CCIR coding</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRESP_ERR_INT</name>
              <description>Hresponse Error Interrupt Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HRESP_ERR_INT_0</name>
                  <description>No hresponse error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HRESP_ERR_INT_1</name>
                  <description>Hresponse error is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COF_INT</name>
              <description>Change Of Field Interrupt Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COF_INT_0</name>
                  <description>Video field has no change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COF_INT_1</name>
                  <description>Change of video field is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>F1_INT</name>
              <description>CCIR Field 1 Interrupt Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>F1_INT_0</name>
                  <description>Field 1 of video is not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F1_INT_1</name>
                  <description>Field 1 of video is about to start.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>F2_INT</name>
              <description>CCIR Field 2 Interrupt Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>F2_INT_0</name>
                  <description>Field 2 of video is not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>F2_INT_1</name>
                  <description>Field 2 of video is about to start</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOF_INT</name>
              <description>Start of Frame Interrupt Status. Indicates when SOF is detected. (Cleared by writing 1)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOF_INT_0</name>
                  <description>SOF is not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOF_INT_1</name>
                  <description>SOF is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOF_INT</name>
              <description>End of Frame (EOF) Interrupt Status. Indicates when EOF is detected. (Cleared by writing 1)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EOF_INT_0</name>
                  <description>EOF is not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOF_INT_1</name>
                  <description>EOF is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RxFF_INT</name>
              <description>RXFIFO Full Interrupt Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RxFF_INT_0</name>
                  <description>RxFIFO is not full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxFF_INT_1</name>
                  <description>RxFIFO is full.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_TSF_DONE_FB1</name>
              <description>DMA Transfer Done in Frame Buffer1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_TSF_DONE_FB1_0</name>
                  <description>DMA transfer is not completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_TSF_DONE_FB1_1</name>
                  <description>DMA transfer is completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_TSF_DONE_FB2</name>
              <description>DMA Transfer Done in Frame Buffer2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_TSF_DONE_FB2_0</name>
                  <description>DMA transfer is not completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_TSF_DONE_FB2_1</name>
                  <description>DMA transfer is completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATFF_INT</name>
              <description>STATFIFO Full Interrupt Status</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STATFF_INT_0</name>
                  <description>STATFIFO is not full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATFF_INT_1</name>
                  <description>STATFIFO is full.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_TSF_DONE_SFF</name>
              <description>DMA Transfer Done from StatFIFO</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_TSF_DONE_SFF_0</name>
                  <description>DMA transfer is not completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_TSF_DONE_SFF_1</name>
                  <description>DMA transfer is completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF_OR_INT</name>
              <description>RxFIFO Overrun Interrupt Status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RF_OR_INT_0</name>
                  <description>RXFIFO has not overflowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_OR_INT_1</name>
                  <description>RXFIFO has overflowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SF_OR_INT</name>
              <description>STATFIFO Overrun Interrupt Status</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SF_OR_INT_0</name>
                  <description>STATFIFO has not overflowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SF_OR_INT_1</name>
                  <description>STATFIFO has overflowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_FIELD1_DONE</name>
              <description>When DMA field 0 is complete, this bit will be set to 1(clear by writing 1).</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_FIELD0_DONE</name>
              <description>When DMA field 0 is complete, this bit will be set to 1(clear by writing 1).</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASEADDR_CHHANGE_ERROR</name>
              <description>When using base address switching enable, this bit will be 1 when switching occur before DMA complete</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSIDMASA_STATFIFO</name>
          <description>CSI DMA Start Address Register - for STATFIFO</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_START_ADDR_SFF</name>
              <description>DMA Start Address for STATFIFO</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSIDMATS_STATFIFO</name>
          <description>CSI DMA Transfer Size Register - for STATFIFO</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_TSF_SIZE_SFF</name>
              <description>DMA Transfer Size for STATFIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSIDMASA_FB1</name>
          <description>CSI DMA Start Address Register - for Frame Buffer1</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_START_ADDR_FB1</name>
              <description>DMA Start Address in Frame Buffer1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSIDMASA_FB2</name>
          <description>CSI DMA Transfer Size Register - for Frame Buffer2</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_START_ADDR_FB2</name>
              <description>DMA Start Address in Frame Buffer2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSIFBUF_PARA</name>
          <description>CSI Frame Buffer Parameter Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FBUF_STRIDE</name>
              <description>Frame Buffer Parameter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEINTERLACE_STRIDE</name>
              <description>DEINTERLACE_STRIDE is only used in the deinterlace mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSIIMAG_PARA</name>
          <description>CSI Image Parameter Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMAGE_HEIGHT</name>
              <description>Image Height. Indicates how many pixels in a column of the image from the sensor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IMAGE_WIDTH</name>
              <description>Image Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
