nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>GPC_CPU_MODE_CTRL_0</name>
      <description>no description available</description>
      <alternatePeripheral>AIPSTZ4</alternatePeripheral>
      <groupName>GPC_CPU_MODE_CTRL</groupName>
      <headerStructName>GPC_CPU_MODE_CTRL</headerStructName>
      <baseAddress>0x40C00000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CM_AUTHEN_CTRL</name>
          <description>CM Authentication Control</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USER</name>
              <description>Allow user mode access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONSECURE</name>
              <description>Allow non-secure mode access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_SETTING</name>
              <description>Lock NONSECURE and USER</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHITE_LIST</name>
              <description>Domain ID white list</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_LIST</name>
              <description>White list lock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_CFG</name>
              <description>Configuration lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_INT_CTRL</name>
          <description>CM Interrupt Control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SP_REQ_NOT_ALLOWED_SLEEP_INT_EN</name>
              <description>sp_req_not_allowed_for_sleep interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SP_REQ_NOT_ALLOWED_WAKEUP_INT_EN</name>
              <description>sp_req_not_allowed_for_wakeup interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SP_REQ_NOT_ALLOWED_SOFT_INT_EN</name>
              <description>sp_req_not_allowed_for_soft interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SP_REQ_NOT_ALLOWED_SLEEP_INT</name>
              <description>sp_req_not_allowed_for_sleep interrupt status and clear register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SP_REQ_NOT_ALLOWED_WAKEUP_INT</name>
              <description>sp_req_not_allowed_for_wakeup interrupt status and clear register</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SP_REQ_NOT_ALLOWED_SOFT_INT</name>
              <description>sp_req_not_allowed_for_soft interrupt status and clear register</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_MISC</name>
          <description>Miscellaneous</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NMI_STAT</name>
              <description>Non-masked interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLEEP_HOLD_EN</name>
              <description>Allow cpu_sleep_hold_req assert during CPU low power status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP_HOLD_STAT</name>
              <description>Status of cpu_sleep_hold_ack_b</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER_CPU</name>
              <description>Master CPU</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_MODE_CTRL</name>
          <description>CPU mode control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_MODE_TARGET</name>
              <description>The CPU mode the CPU platform should transit to on next sleep event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU_MODE_TARGET_0</name>
                  <description>Stay in RUN mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_MODE_TARGET_1</name>
                  <description>Transit to WAIT mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_MODE_TARGET_2</name>
                  <description>Transit to STOP mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_MODE_TARGET_3</name>
                  <description>Transit to SUSPEND mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WFE_EN</name>
              <description>WFE assertion can be sleep event</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_MODE_STAT</name>
          <description>CM CPU mode Status</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_MODE_CURRENT</name>
              <description>Current CPU mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_MODE_PREVIOUS</name>
              <description>Previous CPU mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLEEP_TRANS_BUSY</name>
              <description>Busy on CPU mode transition of sleep, not include set point trans busy.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WAKEUP_TRANS_BUSY</name>
              <description>Busy on CPU mode transition of wakeup, not include set point trans busy.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLEEPING_IDLE</name>
              <description>Completed CPU mode and set point transition of sleep sequence, in a sleeping_idle state.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLEEP_REQUEST</name>
              <description>Status of sleep_request input port</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WFE_REQUEST</name>
              <description>Status of standby_wfe input port</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WAKEUP_REQUEST</name>
              <description>&quot;ORed&quot; of all unmasked IRQ in.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_STATE</name>
              <description>CPU mode trans FSM state.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_PIN_STAT</name>
          <description>CM pin Status</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSAR_REQUEST_STAT</name>
              <description>cpu_mode_trans_ssar_request pin status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPCG_REQUEST_STAT</name>
              <description>cpu_mode_trans_lpcg_request pin status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_REQUEST_STAT</name>
              <description>cpu_mode_trans_pll_request pin status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_REQUEST_STAT</name>
              <description>cpu_mode_trans_iso_request pin status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESET_REQUEST_STAT</name>
              <description>cpu_mode_trans_reset_request pin status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POWER_REQUEST_STAT</name>
              <description>cpu_mode_trans_power_request pin status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_REQUEST_STAT</name>
              <description>cpu_mode_trans_sp_request pin status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBY_IN_REQUEST_STAT</name>
              <description>cpu_mode_trans_stby_in_request pin status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBY_OUT_REQUEST_STAT</name>
              <description>cpu_mode_trans_stby_out_request pin status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSAR_DONE_STAT</name>
              <description>cpu_mode_trans_ssar_done pin status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPCG_DONE_STAT</name>
              <description>cpu_mode_trans_lpcg_done pin status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_DONE_STAT</name>
              <description>cpu_mode_trans_pll_done pin status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_DONE_STAT</name>
              <description>cpu_mode_trans_iso_done pin status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESET_DONE_STAT</name>
              <description>cpu_mode_trans_reset_done pin status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POWER_DONE_STAT</name>
              <description>cpu_mode_trans_power_done pin status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_DONE_STAT</name>
              <description>cpu_mode_trans_sp_done pin status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBY_IN_DONE_STAT</name>
              <description>cpu_mode_trans_stby_in_done pin status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBY_OUT_DONE_STAT</name>
              <description>cpu_mode_trans_stby_out_done pin status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_MODE_STAT</name>
              <description>cpu_power_mode pin status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEBUG_WAKEUP_ACK_STAT</name>
              <description>debug wakeup acknowledge pin status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_IRQ_WAKEUP_MASK_0</name>
          <description>CM IRQ0~31 wakeup mask</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_WAKEUP_MASK_0_31</name>
              <description>&quot;1&quot; means the IRQ cannot wakeup CPU platform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_IRQ_WAKEUP_MASK_1</name>
          <description>CM IRQ32~63 wakeup mask</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_WAKEUP_MASK_32_63</name>
              <description>&quot;1&quot; means the IRQ cannot wakeup CPU platform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_IRQ_WAKEUP_MASK_2</name>
          <description>CM IRQ64~95 wakeup mask</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_WAKEUP_MASK_64_95</name>
              <description>&quot;1&quot; means the IRQ cannot wakeup CPU platform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_IRQ_WAKEUP_MASK_3</name>
          <description>CM IRQ96~127 wakeup mask</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_WAKEUP_MASK_96_127</name>
              <description>&quot;1&quot; means the IRQ cannot wakeup CPU platform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_IRQ_WAKEUP_MASK_4</name>
          <description>CM IRQ128~159 wakeup mask</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_WAKEUP_MASK_128_159</name>
              <description>&quot;1&quot; means the IRQ cannot wakeup CPU platform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_IRQ_WAKEUP_MASK_5</name>
          <description>CM IRQ160~191 wakeup mask</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_WAKEUP_MASK_160_191</name>
              <description>&quot;1&quot; means the IRQ cannot wakeup CPU platform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_IRQ_WAKEUP_MASK_6</name>
          <description>CM IRQ192~223 wakeup mask</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_WAKEUP_MASK_192_223</name>
              <description>&quot;1&quot; means the IRQ cannot wakeup CPU platform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_IRQ_WAKEUP_MASK_7</name>
          <description>CM IRQ224~255 wakeup mask</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ_WAKEUP_MASK_224_255</name>
              <description>&quot;1&quot; means the IRQ cannot wakeup CPU platform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_NON_IRQ_WAKEUP_MASK</name>
          <description>CM non-irq wakeup mask</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVENT_WAKEUP_MASK</name>
              <description>&quot;1&quot; means the event cannot wakeup CPU platform</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUG_WAKEUP_MASK</name>
              <description>&quot;1&quot; means the debug_wakeup_request cannot wakeup CPU platform</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
