nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>STBY_LDO_OUT_CTRL</name>
          <description>STBY LDO out control</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_LDO_OUT_STAT</name>
          <description>STBY LDO out status</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_BANDGAP_OUT_CTRL</name>
          <description>STBY bandgap out control</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_BANDGAP_OUT_STAT</name>
          <description>STBY BANDGAP out status</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_PLDO_OUT_CTRL</name>
          <description>STBY pldo out control</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_PLDO_OUT_STAT</name>
          <description>STBY PLDO out status</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_BIAS_OUT_CTRL</name>
          <description>STBY bias out control</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_BIAS_OUT_STAT</name>
          <description>STBY bias out status</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_PLL_OUT_CTRL</name>
          <description>STBY PLL out control</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_PLL_OUT_STAT</name>
          <description>STBY PLL out status</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_LPCG_OUT_CTRL</name>
          <description>STBY LPCG out control</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_LPCG_OUT_STAT</name>
          <description>STBY LPCG out status</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
