nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SRC</name>
      <description>SRC</description>
      <groupName>SRC</groupName>
      <baseAddress>0x40C04000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x334</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SCR</name>
          <description>SRC Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BT_RELEASE_M4</name>
              <description>cm4 core reset will be held until boot core write this bit to 1 to release it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BT_RELEASE_M4_0</name>
                  <description>cm4 core reset is asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT_RELEASE_M4_1</name>
                  <description>cm4 core reset is released</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BT_RELEASE_M7</name>
              <description>cm7 core reset will be held until boot core write this bit to 1 to release it.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BT_RELEASE_M7_0</name>
                  <description>cm7 core reset is asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT_RELEASE_M7_1</name>
                  <description>cm7 core reset is released</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRMR</name>
          <description>SRC Reset Mode Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WDOG_RESET_MODE</name>
              <description>Wdog reset mode configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG_RESET_MODE_0</name>
                  <description>reset system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG_RESET_MODE_1</name>
                  <description>invalid configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG_RESET_MODE_2</name>
                  <description>invalid configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG_RESET_MODE_3</name>
                  <description>do not reset anything</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG3_RESET_MODE</name>
              <description>Wdog3 reset mode configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG3_RESET_MODE_0</name>
                  <description>reset system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG3_RESET_MODE_1</name>
                  <description>invalid configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG3_RESET_MODE_2</name>
                  <description>invalid configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG3_RESET_MODE_3</name>
                  <description>do not reset anything</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG4_RESET_MODE</name>
              <description>Wdog4 reset mode configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG4_RESET_MODE_0</name>
                  <description>reset system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG4_RESET_MODE_1</name>
                  <description>invalid configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG4_RESET_MODE_2</name>
                  <description>invalid configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG4_RESET_MODE_3</name>
                  <description>do not reset anything</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4LOCKUP_RESET_MODE</name>
              <description>M4 core lockup reset mode configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M4LOCKUP_RESET_MODE_0</name>
                  <description>reset system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4LOCKUP_RESET_MODE_1</name>
                  <description>invalid configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4LOCKUP_RESET_MODE_2</name>
                  <description>invalid configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4LOCKUP_RESET_MODE_3</name>
                  <description>do not reset anything</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7LOCKUP_RESET_MODE</name>
              <description>M7 core lockup reset mode configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7LOCKUP_RESET_MODE_0</name>
                  <description>reset system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7LOCKUP_RESET_MODE_1</name>
                  <description>invalid configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7LOCKUP_RESET_MODE_2</name>
                  <description>invalid configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7LOCKUP_RESET_MODE_3</name>
                  <description>do not reset anything</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4REQ_RESET_MODE</name>
              <description>M4 request reset configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M4REQ_RESET_MODE_0</name>
                  <description>reset system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4REQ_RESET_MODE_1</name>
                  <description>invalid configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4REQ_RESET_MODE_2</name>
                  <description>invalid configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4REQ_RESET_MODE_3</name>
                  <description>do not reset anything</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7REQ_RESET_MODE</name>
              <description>M7 request reset configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7REQ_RESET_MODE_0</name>
                  <description>reset system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7REQ_RESET_MODE_1</name>
                  <description>invalid configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7REQ_RESET_MODE_2</name>
                  <description>invalid configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7REQ_RESET_MODE_3</name>
                  <description>do not reset anything</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMPSENSE_RESET_MODE</name>
              <description>Tempsense reset mode configuration</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEMPSENSE_RESET_MODE_0</name>
                  <description>reset system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSE_RESET_MODE_1</name>
                  <description>invalid configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSE_RESET_MODE_2</name>
                  <description>invalid configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSE_RESET_MODE_3</name>
                  <description>do not reset anything</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSU_RESET_MODE</name>
              <description>CSU reset mode configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSU_RESET_MODE_0</name>
                  <description>reset system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSU_RESET_MODE_1</name>
                  <description>invalid configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSU_RESET_MODE_2</name>
                  <description>invalid configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSU_RESET_MODE_3</name>
                  <description>do not reset anything</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JTAGSW_RESET_MODE</name>
              <description>Jtag SW reset mode configuration</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JTAGSW_RESET_MODE_0</name>
                  <description>reset system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAGSW_RESET_MODE_1</name>
                  <description>invalid configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAGSW_RESET_MODE_2</name>
                  <description>invalid configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAGSW_RESET_MODE_3</name>
                  <description>do not reset anything</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERVOLT_RESET_MODE</name>
              <description>Jtag SW reset mode configuration</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERVOLT_RESET_MODE_0</name>
                  <description>reset system</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERVOLT_RESET_MODE_1</name>
                  <description>invalid configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERVOLT_RESET_MODE_2</name>
                  <description>invalid configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERVOLT_RESET_MODE_3</name>
                  <description>do not reset anything</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SBMR1</name>
          <description>SRC Boot Mode Register 1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_CFG1</name>
              <description>Refer to fusemap.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_CFG2</name>
              <description>Refer to fusemap.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_CFG3</name>
              <description>Refer to fusemap.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_CFG4</name>
              <description>Refer to fusemap.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SBMR2</name>
          <description>SRC Boot Mode Register 2</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_CONFIG</name>
              <description>SECONFIG[1] shows the state of the SECONFIG[1] fuse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BT_FUSE_SEL</name>
              <description>BT_FUSE_SEL (connected to gpio bt_fuse_sel) shows the state of the BT_FUSE_SEL fuse</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BMOD</name>
              <description>BMOD[1:0] shows the latched state of the BOOT_MODE1 and BOOT_MODE0 signals on the rising edge of POR_B</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
