nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>SETPOINT_USBPHY1</name>
          <description>Slice SetPoint Config Register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPOINT0</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT0_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT0_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT1</name>
              <description>no description available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT1_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT1_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT2</name>
              <description>no description available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT2_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT2_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT3</name>
              <description>no description available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT3_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT3_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT4</name>
              <description>no description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT4_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT4_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT5</name>
              <description>no description available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT5_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT5_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT6</name>
              <description>no description available</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT6_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT6_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT7</name>
              <description>no description available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT7_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT7_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT8</name>
              <description>no description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT8_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT8_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT9</name>
              <description>no description available</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT9_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT9_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT10</name>
              <description>no description available</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT10_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT10_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT11</name>
              <description>no description available</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT11_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT11_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT12</name>
              <description>no description available</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT12_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT12_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT13</name>
              <description>no description available</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT13_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT13_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT14</name>
              <description>no description available</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT14_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT14_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT15</name>
              <description>no description available</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT15_0</name>
                  <description>slice reset will be de-asserted when system in set point n</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT15_1</name>
                  <description>slice reset will be asserted when system in set point n</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
