nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>DOMAIN_USBPHY2</name>
          <description>Slice Domain Config Register</description>
          <addressOffset>0x32C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU0_RUN</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU0_RUN_0</name>
                  <description>slice reset will be de-asserted when cpu0 in run mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU0_RUN_1</name>
                  <description>slice reset will be asserted when cpu0 in run mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_WAIT</name>
              <description>no description available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU0_WAIT_0</name>
                  <description>slice reset will be de-asserted when cpu0 in wait mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU0_WAIT_1</name>
                  <description>slice reset will be asserted when cpu0 in wait mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_STOP</name>
              <description>no description available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU0_STOP_0</name>
                  <description>slice reset will be de-asserted when cpu0 in stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU0_STOP_1</name>
                  <description>slice reset will be asserted when cpu0 in stop mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_SUSP</name>
              <description>no description available</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU0_SUSP_0</name>
                  <description>slice reset will be de-asserted when cpu0 in suspend mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU0_SUSP_1</name>
                  <description>slice reset will be asserted when cpu0 in suspend mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1_RUN</name>
              <description>no description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_RUN_0</name>
                  <description>slice reset will be de-asserted when cpu1 in run mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU1_RUN_1</name>
                  <description>slice reset will be asserted when cpu1 in run mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1_WAIT</name>
              <description>no description available</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_WAIT_0</name>
                  <description>slice reset will be de-asserted when cpu1 in wait mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU1_WAIT_1</name>
                  <description>slice reset will be asserted when cpu1 in wait mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1_STOP</name>
              <description>no description available</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_STOP_0</name>
                  <description>slice reset will be de-asserted when cpu1 in stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU1_STOP_1</name>
                  <description>slice reset will be asserted when cpu1 in stop mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU1_SUSP</name>
              <description>no description available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU1_SUSP_0</name>
                  <description>slice reset will be de-asserted when cpu1 in suspend mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU1_SUSP_1</name>
                  <description>slice reset will be asserted when cpu1 in suspend mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU2_RUN</name>
              <description>no description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU2_RUN_0</name>
                  <description>slice reset will be de-asserted when cpu2 in run mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU2_RUN_1</name>
                  <description>slice reset will be asserted when cpu2 in run mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU2_WAIT</name>
              <description>no description available</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU2_WAIT_0</name>
                  <description>slice reset will be de-asserted when cpu2 in wait mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU2_WAIT_1</name>
                  <description>slice reset will be asserted when cpu2 in wait mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU2_STOP</name>
              <description>no description available</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU2_STOP_0</name>
                  <description>slice reset will be de-asserted when cpu2 in stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU2_STOP_1</name>
                  <description>slice reset will be asserted when cpu2 in stop mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU2_SUSP</name>
              <description>no description available</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU2_SUSP_0</name>
                  <description>slice reset will be de-asserted when cpu2 in suspend mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU2_SUSP_1</name>
                  <description>slice reset will be asserted when cpu2 in suspend mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU3_RUN</name>
              <description>no description available</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU3_RUN_0</name>
                  <description>slice reset will be de-asserted when cpu3 in run mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU3_RUN_1</name>
                  <description>slice reset will be asserted when cpu3 in run mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU3_WAIT</name>
              <description>no description available</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU3_WAIT_0</name>
                  <description>slice reset will be de-asserted when cpu3 in wait mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU3_WAIT_1</name>
                  <description>slice reset will be asserted when cpu3 in wait mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU3_STOP</name>
              <description>no description available</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU3_STOP_0</name>
                  <description>slice reset will be de-asserted when cpu3 in stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU3_STOP_1</name>
                  <description>slice reset will be asserted when cpu3 in stop mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU3_SUSP</name>
              <description>no description available</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU3_SUSP_0</name>
                  <description>slice reset will be de-asserted when cpu3 in suspend mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU3_SUSP_1</name>
                  <description>slice reset will be asserted when cpu3 in suspend mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT_USBPHY2</name>
          <description>Slice Status Register</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UNDER_RST</name>
              <description>This is a Read Only bit. It indicate if the reset is in process.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNDER_RST_0</name>
                  <description>the reset is finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDER_RST_1</name>
                  <description>the reset is in process</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_BY_HW</name>
              <description>This bit indicate if the reset is caused by the power mode transfer.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RST_BY_HW_0</name>
                  <description>the reset is not caused by the power mode transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST_BY_HW_1</name>
                  <description>the reset is caused by the power mode transfer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_BY_SW</name>
              <description>This bit indicate if the reset is caused by setting SW_RESET bit or SW_ASS_RESET bit.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RST_BY_SW_0</name>
                  <description>the reset is not caused by software setting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST_BY_SW_1</name>
                  <description>the reset is caused by software setting</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
