nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>IOMUXC_LPSR</name>
      <description>IOMUXC LPSR</description>
      <groupName>IOMUXC_LPSR</groupName>
      <baseAddress>0x40C08000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_00</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_00 SW MUX Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_can3_TX</name>
                  <description>Select mux mode: ALT0 mux port: FLEXCAN3_TX of instance: FLEXCAN3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_mic_CLK</name>
                  <description>Select mux mode: ALT1 mux port: MIC_CLK of instance: MIC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_mqs_RIGHT</name>
                  <description>Select mux mode: ALT2 mux port: MQS_RIGHT of instance: MQS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ARM_CM4_EVENTO</name>
                  <description>Select mux mode: ALT3 mux port: ARM_CM4_EVENTO of instance: CM4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO0</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO00 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpuart12_TX</name>
                  <description>Select mux mode: ALT6 mux port: LPUART12_TXD of instance: LPUART12</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_sai4_MCLK</name>
                  <description>Select mux mode: ALT7 mux port: SAI4_MCLK of instance: SAI4</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO0</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO00 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_00</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_01</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_01 SW MUX Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_can3_RX</name>
                  <description>Select mux mode: ALT0 mux port: FLEXCAN3_RX of instance: FLEXCAN3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_mic_BITSTREAM0</name>
                  <description>Select mux mode: ALT1 mux port: MIC_BITSTREAM0 of instance: MIC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_mqs_LEFT</name>
                  <description>Select mux mode: ALT2 mux port: MQS_LEFT of instance: MQS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ARM_CM4_EVENTI</name>
                  <description>Select mux mode: ALT3 mux port: ARM_CM4_EVENTI of instance: CM4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO1</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO01 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpuart12_RX</name>
                  <description>Select mux mode: ALT6 mux port: LPUART12_RXD of instance: LPUART12</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO1</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO01 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_01</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_02</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_02 SW MUX Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_src_BOOT_MODE0</name>
                  <description>Select mux mode: ALT0 mux port: SRC_BOOT_MODE00 of instance: SRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpspi5_SCK</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI5_SCK of instance: LPSPI5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai4_TX_DATA</name>
                  <description>Select mux mode: ALT2 mux port: SAI4_TX_DATA of instance: SAI4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_mqs_RIGHT</name>
                  <description>Select mux mode: ALT3 mux port: MQS_RIGHT of instance: MQS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO2</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO02 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO2</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO02 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_02</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_03</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_03 SW MUX Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_src_BOOT_MODE1</name>
                  <description>Select mux mode: ALT0 mux port: SRC_BOOT_MODE01 of instance: SRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpspi5_PCS0</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI5_PCS0 of instance: LPSPI5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai4_TX_SYNC</name>
                  <description>Select mux mode: ALT2 mux port: SAI4_TX_SYNC of instance: SAI4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_mqs_LEFT</name>
                  <description>Select mux mode: ALT3 mux port: MQS_LEFT of instance: MQS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO3</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO03 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO3</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO03 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_03</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_04</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_04 SW MUX Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpi2c5_SDA</name>
                  <description>Select mux mode: ALT0 mux port: LPI2C5_SDA of instance: LPI2C5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpspi5_SDO</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI5_SOUT of instance: LPSPI5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai4_TX_BCLK</name>
                  <description>Select mux mode: ALT2 mux port: SAI4_TX_BCLK of instance: SAI4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart12_RTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART12_RTS_B of instance: LPUART12</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO4</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO04 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpuart11_TX</name>
                  <description>Select mux mode: ALT6 mux port: LPUART11_TXD of instance: LPUART11</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO4</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO04 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_04</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_05</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_05 SW MUX Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpi2c5_SCL</name>
                  <description>Select mux mode: ALT0 mux port: LPI2C5_SCL of instance: LPI2C5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpspi5_SDI</name>
                  <description>Select mux mode: ALT1 mux port: LPSPI5_SIN of instance: LPSPI5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai4_MCLK</name>
                  <description>Select mux mode: ALT2 mux port: SAI4_MCLK of instance: SAI4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart12_CTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART12_CTS_B of instance: LPUART12</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO05 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpuart11_RX</name>
                  <description>Select mux mode: ALT6 mux port: LPUART11_RXD of instance: LPUART11</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_nmi_glue_NMI</name>
                  <description>Select mux mode: ALT7 mux port: NMI_GLUE_NMI of instance: nmi_glue</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO5</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO05 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_05</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
