nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>GPR21</name>
          <description>GPR21 General Purpose Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APC_R3_ENCRYPT_ENABLE</name>
              <description>APC memory region-3 encryption enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock the write to bit 15:0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR22</name>
          <description>GPR22 General Purpose Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APC_R4_ENCRYPT_ENABLE</name>
              <description>APC memory region-4 encryption enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock the write to bit 15:0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR23</name>
          <description>GPR23 General Purpose Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APC_R5_ENCRYPT_ENABLE</name>
              <description>APC memory region-5 encryption enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock the write to bit 15:0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR24</name>
          <description>GPR24 General Purpose Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APC_R6_ENCRYPT_ENABLE</name>
              <description>APC memory region-6 encryption enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock the write to bit 15:0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR25</name>
          <description>GPR25 General Purpose Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APC_R7_ENCRYPT_ENABLE</name>
              <description>APC memory region-7 encryption enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APC_VALID</name>
              <description>APC global enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock the write to bit 15:0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR26</name>
          <description>GPR26 General Purpose Register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CM7_INIT_VTOR</name>
              <description>Vector table offset register out of reset. See the ARM v7-M Architecture Reference Manual for more information about the vector table offset register (VTOR).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELD_0</name>
              <description>General purpose bits</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR34</name>
          <description>GPR34 General Purpose Register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xE00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO_LPSR_HIGH_RANGE</name>
              <description>GPIO_LPSR IO bank supply voltage range selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_LPSR_LOW_RANGE</name>
              <description>GPIO_LPSR IO bank supply voltage range selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M7_NMI_MASK</name>
              <description>Mask CM7 NMI pin input</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M4_NMI_MASK</name>
              <description>Mask CM4 NMI pin input</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M4_GPC_SLEEP_SEL</name>
              <description>CM4 sleep request selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M4_NMI_CLEAR</name>
              <description>Clear CM4 NMI holding register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPHY1_WAKEUP_IRQ_CLEAR</name>
              <description>Clear USBPHY1 wakeup interrupt holding register</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPHY2_WAKEUP_IRQ_CLEAR</name>
              <description>Clear USBPHY1 wakeup interrupt holding register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_ERR_RESP</name>
              <description>Security error response enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR35</name>
          <description>GPR35 General Purpose Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC1_IPG_DOZE</name>
              <description>ADC2 doze mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_STOP_REQ</name>
              <description>ADC2 stop request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_IPG_STOP_MODE</name>
              <description>ADC2 stop mode selection, cannot change when ADC2_STOP_REQ is asserted.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_IPG_DOZE</name>
              <description>ADC2 doze mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_STOP_REQ</name>
              <description>ADC2 stop request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_IPG_STOP_MODE</name>
              <description>ADC2 stop mode selection, cannot change when ADC2_STOP_REQ is asserted.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAAM_IPG_DOZE</name>
              <description>CAN3 doze mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAAM_STOP_REQ</name>
              <description>CAAM stop request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN1_IPG_DOZE</name>
              <description>CAN1 doze mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN1_STOP_REQ</name>
              <description>CAN1 stop request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN2_IPG_DOZE</name>
              <description>CAN2 doze mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN2_STOP_REQ</name>
              <description>CAN2 stop request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN3_IPG_DOZE</name>
              <description>CAN3 doze mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN3_STOP_REQ</name>
              <description>CAN3 stop request</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDMA_STOP_REQ</name>
              <description>EDMA stop request</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDMA_LPSR_STOP_REQ</name>
              <description>EDMA_LPSR stop request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET_IPG_DOZE</name>
              <description>ENET doze mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET_STOP_REQ</name>
              <description>ENET stop request</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET1G_IPG_DOZE</name>
              <description>ENET1G doze mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENET1G_STOP_REQ</name>
              <description>ENET1G stop request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXIO1_IPG_DOZE</name>
              <description>FLEXIO2 doze mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXIO2_IPG_DOZE</name>
              <description>FLEXIO2 doze mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXSPI1_IPG_DOZE</name>
              <description>FLEXSPI1 doze mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXSPI1_STOP_REQ</name>
              <description>FLEXSPI1 stop request</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXSPI2_IPG_DOZE</name>
              <description>FLEXSPI2 doze mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXSPI2_STOP_REQ</name>
              <description>FLEXSPI2 stop request</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
