nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>FIFO_STAT</name>
          <description>PDM FIFO Status register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIFOOVF0</name>
              <description>FIFO Overflow Exception flag for Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF1</name>
              <description>FIFO Overflow Exception flag for Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF2</name>
              <description>FIFO Overflow Exception flag for Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF3</name>
              <description>FIFO Overflow Exception flag for Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF4</name>
              <description>FIFO Overflow Exception flag for Channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF5</name>
              <description>FIFO Overflow Exception flag for Channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF6</name>
              <description>FIFO Overflow Exception flag for Channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVF7</name>
              <description>FIFO Overflow Exception flag for Channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND0</name>
              <description>FIFO Underflow Exception flag for Channel 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO Underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND1</name>
              <description>FIFO Underflow Exception flag for Channel 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO Underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND2</name>
              <description>FIFO Underflow Exception flag for Channel 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO Underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND3</name>
              <description>FIFO Underflow Exception flag for Channel 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO Underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND4</name>
              <description>FIFO Underflow Exception flag for Channel 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO Underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND5</name>
              <description>FIFO Underflow Exception flag for Channel 5</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO Underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND6</name>
              <description>FIFO Underflow Exception flag for Channel 6</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO Underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOUND7</name>
              <description>FIFO Underflow Exception flag for Channel 7</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by FIFO Underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by FIFO underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DATACH[%s]</name>
          <description>PDM Output Result Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Channel n Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
