nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>RDC_SEMAPHORE1</name>
      <description>SEMA42</description>
      <groupName>RDC_SEMAPHORE</groupName>
      <prependToName>RDC_SEMAPHORE1_</prependToName>
      <headerStructName>RDC_SEMAPHORE</headerStructName>
      <baseAddress>0x40C44000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x44</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>64</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63</dimIndex>
          <name>GATE%s</name>
          <description>Gate Register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor with master_index = 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor with master_index = 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>The gate has been locked by processor with master_index = 2.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_4</name>
                  <description>The gate has been locked by processor with master_index = 3.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_5</name>
                  <description>The gate has been locked by processor with master_index = 4.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_6</name>
                  <description>The gate has been locked by processor with master_index = 5.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_7</name>
                  <description>The gate has been locked by processor with master_index = 6.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_8</name>
                  <description>The gate has been locked by processor with master_index = 7.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_9</name>
                  <description>The gate has been locked by processor with master_index = 8.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_10</name>
                  <description>The gate has been locked by processor with master_index = 9.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_11</name>
                  <description>The gate has been locked by processor with master_index = 10.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_12</name>
                  <description>The gate has been locked by processor with master_index = 11.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_13</name>
                  <description>The gate has been locked by processor with master_index = 12.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_14</name>
                  <description>The gate has been locked by processor with master_index = 13.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_15</name>
                  <description>The gate has been locked by processor with master_index = 14.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDOM</name>
              <description>Read-only bits. They indicate which domain had currently locked the gate.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDOM_0</name>
                  <description>The gate is locked by domain 0. (True if bits [3:0] do not equal 0000.)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOM_1</name>
                  <description>The gate has been locked by domain 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOM_2</name>
                  <description>The gate has been locked by domain 2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOM_3</name>
                  <description>The gate has been locked by domain 3.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTGT_W</name>
          <description>Reset Gate Write</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RSTGDP</name>
              <description>Reset Gate Data Pattern</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTGTN</name>
              <description>Reset Gate Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTGT_R</name>
          <description>Reset Gate Read</description>
          <addressOffset>0x42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RSTGMS</name>
              <description>Reset Gate Bus Master</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTGSM</name>
              <description>Reset Gate Finite State Machine</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSTGSM_0</name>
                  <description>Idle, waiting for the first data pattern write.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTGSM_1</name>
                  <description>Waiting for the second data pattern write.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTGSM_2</name>
                  <description>The 2-write sequence has completed. Generate the specified gate reset(s). After the reset is performed, this machine returns to the idle (waiting for first data pattern write) state. The &quot;01&quot; state persists for only one clock cycle. Software will never be able to observe this state.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTGSM_3</name>
                  <description>This state encoding is never used and therefore reserved.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTGTN</name>
              <description>Reset Gate Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
