nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>KEY_MANAGER__PUF</name>
      <description>PUF</description>
      <groupName>PUF</groupName>
      <baseAddress>0x40C82000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Quiddikey Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZEROIZE</name>
              <description>Begin Zeroize operation for Quiddikey and go to Error state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSET</name>
                  <description>not in ZEROIZE status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>in ZEROIZE status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENROLL</name>
              <description>Begin Enroll operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSET</name>
                  <description>not in ENROLL status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>in ENROLL status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Begin Start operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSET</name>
                  <description>not in START status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>in START status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENERATEKEY</name>
              <description>Begin Set Intrinsic Key operation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSET</name>
                  <description>not in GET_IK status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>in GET_IK status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETKEY</name>
              <description>Begin Set User Key operation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSET</name>
                  <description>not in SET_UK status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>in SET_UK status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GETKEY</name>
              <description>Begin Get Key operation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNSET</name>
                  <description>not in GET_KEY status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>in GET_KEY status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYINDEX</name>
          <description>Quiddikey Key Index Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYIDX</name>
              <description>puf_key_index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INDEX0</name>
                  <description>USE INDEX0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX1</name>
                  <description>USE INDEX1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX2</name>
                  <description>USE INDEX2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX3</name>
                  <description>USE INDEX3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX4</name>
                  <description>USE INDEX4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX5</name>
                  <description>USE INDEX5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX6</name>
                  <description>USE INDEX6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX7</name>
                  <description>USE INDEX7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX8</name>
                  <description>USE INDEX8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX9</name>
                  <description>USE INDEX9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX10</name>
                  <description>USE INDEX10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX11</name>
                  <description>USE INDEX11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX12</name>
                  <description>USE INDEX12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX13</name>
                  <description>USE INDEX13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX14</name>
                  <description>USE INDEX14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX15</name>
                  <description>USE INDEX15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
