nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>ANADIG_LDO_SNVS_DIG</name>
      <description>MX6RT_ANADIG_REGISTER</description>
      <alternatePeripheral>ANADIG_LDO_SNVS</alternatePeripheral>
      <groupName>ANADIG</groupName>
      <baseAddress>0x40C84000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x544</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PMU_LDO_SNVS_DIG</name>
          <description>PMU_LDO_SNVS_DIG_REGISTER</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REG_LP_EN</name>
              <description>REG_LP_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_OVERRIDE</name>
              <description>test_override</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_EN</name>
              <description>REG_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_TEST</name>
              <description>EN_TEST</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CP_CONFIG</name>
              <description>CP_CONFIG</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RES_CONFIG</name>
              <description>RES_CONFIG</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM</name>
              <description>trim</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENB_PULLDOWN</name>
              <description>ENB_PULLDOWN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_STABLE</name>
              <description>REG_STABLE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ANADIG_MISC</name>
      <description>MX6RT_ANADIG_REGISTER</description>
      <alternatePeripheral>ANADIG_LDO_SNVS</alternatePeripheral>
      <groupName>ANADIG</groupName>
      <baseAddress>0x40C84000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x944</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MISC_DIFPROG</name>
          <description>MISC_DIFPROG_REGISTER</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHIPID</name>
              <description>CHIPID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LVDS_CTRL</name>
          <description>LVDS_CTRL_REGISTER</description>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVDS_IPP_IBE</name>
              <description>lvds_ipp_ibe</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDS_IPP_OBE</name>
              <description>lvds_ipp_obe</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDS_DIV4_EN</name>
              <description>lvds_div4_en</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDS_ANA_TEST_EN</name>
              <description>lvds_ana_test_en</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDS_SOURCE</name>
              <description>lvds_source</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDS_I_TRIM</name>
              <description>lvds_i_trim</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWPWR_SETTLE_DETECT_EN_LPSR1P8</name>
              <description>lowpwr_settle_detect_en_lpsr1p8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_CLK_SR_EN</name>
              <description>bypass_clk_sr_en</description>
              <bitOffset>9</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_RC_48M</name>
              <description>sel_rc_48M</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDS_CLK_SEL</name>
              <description>lvds_clk_sel</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC_AI_CTRL</name>
          <description>VDDSOC_AI_CTRL_REGISTER</description>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC_AI_ADDR</name>
              <description>VDDSOC_AI_ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDSOC_AIRWB</name>
              <description>VDDSOC_AIRWB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC_AI_WDATA</name>
          <description>VDDSOC_AI_WDATA_REGISTER</description>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC_AI_WDATA</name>
              <description>VDDSOC_AI_WDATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC_AI_RDATA</name>
          <description>VDDSOC_AI_RDATA_REGISTER</description>
          <addressOffset>0x840</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC_AI_RDATA</name>
              <description>VDDSOC_AI_RDATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC2PLL_AI_CTRL_1G</name>
          <description>VDDSOC2PLL_AI_CTRL_1G_REGISTER</description>
          <addressOffset>0x850</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC2PLL_AIADDR_1G</name>
              <description>VDDSOC2PLL_AIADDR_1G</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDSOC2PLL_AITOGGLE_1G</name>
              <description>VDDSOC2PLL_AITOGGLE_1G</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDSOC2PLL_AITOGGLE_DONE_1G</name>
              <description>VDDSOC2PLL_AITOGGLE_DONE_1G</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDSOC2PLL_AIRWB_1G</name>
              <description>VDDSOC2PLL_AIRWB_1G</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC2PLL_AI_WDATA_1G</name>
          <description>VDDSOC2PLL_AI_WDATA_1G_REGISTER</description>
          <addressOffset>0x860</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC2PLL_AI_WDATA_1G</name>
              <description>VDDSOC2PLL_AI_WDATA_1G</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC2PLL_AI_RDATA_1G</name>
          <description>VDDSOC2PLL_AI_RDATA_1G_REGISTER</description>
          <addressOffset>0x870</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC2PLL_AI_RDATA_1G</name>
              <description>VDDSOC2PLL_AI_RDATA_1G</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC2PLL_AI_CTRL_AUDIO</name>
          <description>VDDSOC_AI_CTRL_AUDIO_REGISTER</description>
          <addressOffset>0x880</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC2PLL_AI_ADDR_AUDIO</name>
              <description>VDDSOC2PLL_AI_ADDR_AUDIO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDSOC2PLL_AITOGGLE_AUDIO</name>
              <description>VDDSOC2PLL_AITOGGLE_AUDIO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDSOC2PLL_AITOGGLE_DONE_AUDIO</name>
              <description>VDDSOC2PLL_AITOGGLE_DONE_AUDIO</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDSOC2PLL_AIRWB_AUDIO</name>
              <description>VDDSOC_AIRWB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC2PLL_AI_WDATA_AUDIO</name>
          <description>VDDSOC_AI_WDATA_AUDIO_REGISTER</description>
          <addressOffset>0x890</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC2PLL_AI_WDATA_AUDIO</name>
              <description>VDDSOC2PLL_AI_WDATA_AUDIO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC2PLL_AI_RDATA_AUDIO</name>
          <description>VDDSOC2PLL_AI_RDATA_REGISTER</description>
          <addressOffset>0x8A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC2PLL_AI_RDATA_AUDIO</name>
              <description>VDDSOC2PLL_AI_RDATA_AUDIO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC2PLL_AI_CTRL_VIDEO</name>
          <description>VDDSOC2PLL_AI_CTRL_VIDEO_REGISTER</description>
          <addressOffset>0x8B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC2PLL_AIADDR_VIDEO</name>
              <description>VDDSOC2PLL_AIADDR_VIDEO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDSOC2PLL_AITOGGLE_VIDEO</name>
              <description>VDDSOC2PLL_AITOGGLE_VIDEO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDSOC2PLL_AITOGGLE_DONE_VIDEO</name>
              <description>VDDSOC2PLL_AITOGGLE_DONE_VIDEO</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDSOC2PLL_AIRWB_VIDEO</name>
              <description>VDDSOC2PLL_AIRWB_VIDEO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC2PLL_AI_WDATA_VIDEO</name>
          <description>VDDSOC2PLL_AI_WDATA_VIDEO_REGISTER</description>
          <addressOffset>0x8C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC2PLL_AI_WDATA_VIDEO</name>
              <description>VDDSOC2PLL_AI_WDATA_VIDEO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDSOC2PLL_AI_RDATA_VIDEO</name>
          <description>VDDSOC2PLL_AI_RDATA_VIDEO_REGISTER</description>
          <addressOffset>0x8D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDSOC2PLL_AI_RDATA_VIDEO</name>
              <description>VDDSOC2PLL_AI_RDATA_VIDEO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDLPSR_AI_CTRL</name>
          <description>VDDSOC_AI_CTRL_REGISTER</description>
          <addressOffset>0x8E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDLPSR_AI_ADDR</name>
              <description>VDDLPSR_AI_ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDLPSR_AIRWB</name>
              <description>VDDLPSR_AIRWB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDLPSR_AI_WDATA</name>
          <description>VDDLPSR_AI_WDATA_REGISTER</description>
          <addressOffset>0x8F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDLPSR_AI_WDATA</name>
              <description>VDD_LPSR_AI_WDATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDLPSR_AI_RDATA_REFTOP</name>
          <description>VDDLPSR_AI_RDATA_REFTOP_REGISTER</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDLPSR_AI_RDATA_REFTOP</name>
              <description>VDDLPSR_AI_RDATA_REFTOP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDLPSR_AI_RDATA_TMPSNS</name>
          <description>VDDLPSR_AI_RDATA_TMPSNS_REGISTER</description>
          <addressOffset>0x910</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDLPSR_AI_RDATA_TMPSNS</name>
              <description>VDDLPSR_AI_RDATA_TMPSNS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDLPSR_AI400M_CTRL</name>
          <description>VDDLPSR_AI400M_CTRL_REGISTER</description>
          <addressOffset>0x920</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDLPSR_AI400M_ADDR</name>
              <description>VDDLPSR_AI400M_ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDLPSR_AITOGGLE_400M</name>
              <description>VDDLPSR_AITOGGLE_400M</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDLPSR_AITOGGLE_DONE_400M</name>
              <description>VDDLPSR_AITOGGLE_DONE_400M</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDDLPSR_AI400M_RWB</name>
              <description>VDDLPSR_AI400M_RWB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDLPSR_AI400M_WDATA</name>
          <description>VDDLPSR_AI400M_WDATA_REGISTER</description>
          <addressOffset>0x930</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDLPSR_AI400M_WDATA</name>
              <description>VDDLPSR_AI400M_WDATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDLPSR_AI400M_RDATA</name>
          <description>VDDLPSR_AI400M_RDATA_REGISTER</description>
          <addressOffset>0x940</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDDLPSR_AI400M_RDATA</name>
              <description>VDDLPSR_AI400M_RDATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
