nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>ANADIG_OSC</name>
      <description>MX6RT_ANADIG_REGISTER</description>
      <alternatePeripheral>ANADIG_LDO_SNVS</alternatePeripheral>
      <groupName>ANADIG</groupName>
      <baseAddress>0x40C84000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x114</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ANATOP_CTRL</name>
          <description>ANATOP_CTRL_REGISTER</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANATOP_MODE</name>
              <description>ANATOP_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_SW_FORCE</name>
              <description>TRIM_SW_FORCE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_SW_FORCE_16M</name>
              <description>TRIM_SW_FORCE_16M</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_48M_CTRL</name>
          <description>OSC_48M_CTRL_REGISTER</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x17901F2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TTEST_CURRENT</name>
              <description>rc48m_ttest_current_lv</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEN</name>
              <description>rc48m_ten_lv</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTEST_BG</name>
              <description>rc48m_ttest_bg_lv</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUPDATE</name>
              <description>rc48m_tupdate_lv</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTRIM_COARSE</name>
              <description>rc48m_ttrim_coarse_lv</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTRIM_FINE</name>
              <description>rc48m_ttrim_fine_lv</description>
              <bitOffset>10</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TTRIM_RANGE</name>
              <description>rc48m_ttrim_range_lv</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_TEMPCO</name>
              <description>TRIM_TEMPCO</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RC_48M_DIV2_EN</name>
              <description>rc_48m_div2_en</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RC_48M_DIV2_CONTROL_MODE</name>
              <description>rc_48m_div2_control_mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RC_48M_CONTROL_MODE</name>
              <description>rc_48m_control_mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_24M_CTRL</name>
          <description>OSC_24M_CTRL_REGISTER</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYPASS_CLK</name>
              <description>osc24m_bypass_clk_1p8v</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN</name>
              <description>osc24m_bypass_en_lv</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_EN</name>
              <description>osc24m_lp_en_lv</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC_COMP_MODE</name>
              <description>osc24m_osc_comp_mode_lv</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC_EN</name>
              <description>osc24m_osc_en_lv</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC_TEST_EN</name>
              <description>osc24m_osc_test_en_lv</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC_TESTALC_EN</name>
              <description>osc24m_osc_testalc_en_lv</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC_24M_GATE</name>
              <description>osc_24m_gate</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC_24M_STABLE</name>
              <description>osc_24m_stable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_24M_CONTROL_MODE</name>
              <description>osc_24m_control_mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_32K_CTRL</name>
          <description>OSC_32K_CTRL_REGISTER</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTC_XTAL_SOURCE</name>
              <description>This bit is reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_200M_CTRL0</name>
          <description>OSC_200M_CTRL0_REGISTER</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSC200M_AI_BUSY</name>
              <description>osc200m_ai_busy</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_200M_CTRL1</name>
          <description>OSC_200M_CTRL1_REGISTER</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWD</name>
              <description>power down control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKGATE_200MEG</name>
              <description>clock gate control for 200m</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKGATE_25MEG</name>
              <description>clock gate control for 25m</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RC_400M_CONTROL_MODE</name>
              <description>rc_400m_control_mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_200M_CTRL2</name>
          <description>OSC_200M_CTRL2_REGISTER</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE_CLK</name>
              <description>ENABLE_CLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNE_BYP</name>
              <description>TUNE_BYP</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC_TUNE_VAL</name>
              <description>OSC_TUNE_VAL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_4M16M_CTRL</name>
          <description>OSC_4M16M_CTRL_REGISTER</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_LPO1K</name>
              <description>rc4m_en_LPO1K_1p8v</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_IRC4M16M</name>
              <description>rc4m_en_irc4M16M_1p8v</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_16M</name>
              <description>sel_16M</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_POWER_SAVE</name>
              <description>en_power_save</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANALOG_TEST</name>
              <description>analog_test</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCE_SEL_16M</name>
              <description>source_sel_16M</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>off_mode</name>
              <description>off_mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RC_16M_CONTROL_MODE</name>
              <description>rc_16m_control_mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_4M16M_TRIM</name>
          <description>OSC_4M16M_TRIM_REGISTER</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xE800057</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM_DLY</name>
              <description>rc4m_trim_dly_1p8v</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_TEMPCO</name>
              <description>trim_tempco</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_LPO1K</name>
              <description>rc4m_trim_LPO1K_1p8v</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_IREF</name>
              <description>trim_iref</description>
              <bitOffset>14</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_FINE</name>
              <description>rc4m_trim_fine_1p8v</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RC4M_trim_COARSE_1P8V</name>
              <description>trim_coarse</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_OTP_TRIM_VALUE_48M</name>
          <description>OSC_OTP_TIM_VALUE_48M_REGISTER</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSC_48M_TRIM_TEMPCO</name>
              <description>osc_48m_trim_tempco</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_48M_TRIM_RANGE</name>
              <description>osc_48m_trim_range</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_48M_TRIM_FINE</name>
              <description>osc_48m_trim_fine</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_48M_TRIM_COARSE</name>
              <description>osc_48m_trim_coarse</description>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_48M_TRIM_EN</name>
              <description>osc_48m_trim_en</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_OTP_TRIM_VALUE_16M</name>
          <description>OSC_OTP_TRIM_VALUE_16M_REGISTER</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSC_16M_TRIM_DLY</name>
              <description>osc_16m_trim_dly</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_16M_TRIM_COARSE</name>
              <description>osc_16m_trim_coarse</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_16M_TRIM_FINE</name>
              <description>osc_16m_trim_fine</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_16M_TRIM_IREF</name>
              <description>osc_16m_trim_iref</description>
              <bitOffset>14</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_16M_TRIM_LP01K</name>
              <description>osc_16m_trim_LP01K</description>
              <bitOffset>19</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_16M_TRIM_TEMPCO</name>
              <description>osc_16m_trim_tempco</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC_16M_TRIM_EN</name>
              <description>osc_16m_trim_en</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_OTP_TRIM_VALUE_XTAL_FREQ</name>
          <description>OSC_OTP_TRIM_VALUE_XTAL_FREQ_REGISTER</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XTAL_TRIM_PLL_CTRL0_DIV_SEL</name>
              <description>xtal_trim_pll_ctrl0_div_sel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XTAL_TRIM_EN</name>
              <description>xtal_trim_en</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_OTP_TRIM_VALUE_200M</name>
          <description>OSC_OTP_TRIM_VALUE_200M_REGISTER</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RC200M_TUNE_VAL</name>
              <description>rc200m_tune_val</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC200M_TUNE_BYP</name>
              <description>rc200m_tune_byp</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC200M_TRIM_EN</name>
              <description>rc200m_trim_en</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
