nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>ANADIG_PMU</name>
      <description>MX6RT_ANADIG_REGISTER</description>
      <alternatePeripheral>ANADIG_LDO_SNVS</alternatePeripheral>
      <groupName>ANADIG</groupName>
      <baseAddress>0x40C84000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7D4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PMU_LDO_PLL</name>
          <description>PMU_LDO_PLL_REGISTER</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDO_PLL_ENABLE</name>
              <description>LDO_PLL_ENABLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_PLL_CONTROL_MODE</name>
              <description>LDO_PLL_CONTROL_MODE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_PLL_AI_TOGGLE</name>
              <description>ldo_pll_ai_toggle</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_PLL_AI_BUSY</name>
              <description>ldo_pll_busy</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_BIAS_CTRL</name>
          <description>PMU_BIAS_CTRL_REGISTER</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WB_CFG_1P8</name>
              <description>wb_cfg_1p8_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_VDD_SEL_1P8</name>
              <description>wb_vdd_sel_1p8</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_IN_SP_1P8</name>
              <description>wb_in_sp_1p8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_PW_LVL_1P8</name>
              <description>wb_pw_lvl_1p8</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_NW_LVL_1P8</name>
              <description>wb_nw_lvl_1p8</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_BIAS_CTRL2</name>
          <description>PMU_BIAS_CTRL2_REGISTER</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WB_TST_EN_1P8</name>
              <description>TST_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_TST_MD</name>
              <description>TMOD_wb_tst_md_1p8</description>
              <bitOffset>1</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_PWR_SW_EN_1P8</name>
              <description>MODSEL_wb_tst_md_1p8</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_ADJ_1P8</name>
              <description>wb_adj_1p8</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FBB_M7_CONTROL_MODE</name>
              <description>fbb_m7_control_mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RBB_SOC_CONTROL_MODE</name>
              <description>rbb_soc_control_mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RBB_LPSR_CONTROL_MODE</name>
              <description>rbb_lpsr_control_mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_EN</name>
              <description>wb_en</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_TST_DIG_OUT</name>
              <description>Digital output for test purpose</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WB_OK</name>
              <description>Digital Output pin. Turn on/off acknowledge bit from regulator</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_REF_CTRL</name>
          <description>PMU_REF_CTRL_REGISTER</description>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_AI_TOGGLE</name>
              <description>ref_ai_toggle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_AI_BUSY</name>
              <description>ref_ai_busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REF_ENABLE</name>
              <description>ref_enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_CONTROL_MODE</name>
              <description>ref_control_mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_PLL_VOL_REF_BUFFER</name>
              <description>en_pll_vol_ref_buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_POWER_DETECT_CTRL</name>
          <description>PMU_POWER_DETECT_CTRL_REGISTER</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CKGB_LPSR1P0</name>
              <description>ckgb_lpsr1p0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_PLL_ENABLE_SP</name>
          <description>LDO_PLL_ENABLE_SP_REGISTER</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ON_OFF_SETPOINT0</name>
              <description>ON_OFF_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT1</name>
              <description>ON_OFF_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT2</name>
              <description>ON_OFF_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT3</name>
              <description>ON_OFF_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT4</name>
              <description>ON_OFF_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT5</name>
              <description>ON_OFF_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT6</name>
              <description>ON_OFF_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT7</name>
              <description>ON_OFF_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT8</name>
              <description>ON_OFF_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT9</name>
              <description>ON_OFF_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT10</name>
              <description>ON_OFF_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT11</name>
              <description>ON_OFF_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT12</name>
              <description>ON_OFF_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT13</name>
              <description>ON_OFF_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT14</name>
              <description>ON_OFF_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT15</name>
              <description>ON_OFF_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_ANA_ENABLE_SP</name>
          <description>LDO_LPSR_ANA_ENABLE_SP_REGISTER</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ON_OFF_SETPOINT0</name>
              <description>ON_OFF_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT1</name>
              <description>ON_OFF_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT2</name>
              <description>ON_OFF_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT3</name>
              <description>ON_OFF_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT4</name>
              <description>ON_OFF_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT5</name>
              <description>ON_OFF_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT6</name>
              <description>ON_OFF_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT7</name>
              <description>ON_OFF_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT8</name>
              <description>ON_OFF_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT9</name>
              <description>ON_OFF_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT10</name>
              <description>ON_OFF_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT11</name>
              <description>ON_OFF_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT12</name>
              <description>ON_OFF_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT13</name>
              <description>ON_OFF_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT14</name>
              <description>ON_OFF_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT15</name>
              <description>ON_OFF_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_ANA_LP_MODE_SP</name>
          <description>LDO_LPSR_ANA_LP_MODE_SP_REGISTER</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LP_MODE_SETPOINT0</name>
              <description>LP_MODE_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT1</name>
              <description>LP_MODE_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT2</name>
              <description>LP_MODE_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT3</name>
              <description>LP_MODE_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT4</name>
              <description>LP_MODE_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT5</name>
              <description>LP_MODE_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT6</name>
              <description>LP_MODE_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT7</name>
              <description>LP_MODE_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT8</name>
              <description>LP_MODE_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT9</name>
              <description>LP_MODE_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT10</name>
              <description>LP_MODE_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT11</name>
              <description>LP_MODE_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT12</name>
              <description>LP_MODE_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT13</name>
              <description>LP_MODE_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT14</name>
              <description>LP_MODE_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPONIT15</name>
              <description>LP_MODE_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
