nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>LDO_LPSR_DIG_TRG_SP3</name>
          <description>LDO_LPSR_DIG_TRG_SP3_REGISTER</description>
          <addressOffset>0x6A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOLTAGE_SETPOINT12</name>
              <description>VOLTAGE_SETPOINT12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT13</name>
              <description>VOLTAGE_SETPOINT13</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT14</name>
              <description>VOLTAGE_SETPOINT14</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT15</name>
              <description>VOLTAGE_SETPOINT15</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_DIG_LP_MODE_SP</name>
          <description>LDO_LPSR_DIG_LP_MODE_SP_REGISTER</description>
          <addressOffset>0x6B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LP_MODE_SETPOINT0</name>
              <description>LP_MODE_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT1</name>
              <description>LP_MODE_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT2</name>
              <description>LP_MODE_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT3</name>
              <description>LP_MODE_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT4</name>
              <description>LP_MODE_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT5</name>
              <description>LP_MODE_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT6</name>
              <description>LP_MODE_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT7</name>
              <description>LP_MODE_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT8</name>
              <description>LP_MODE_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT9</name>
              <description>LP_MODE_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT10</name>
              <description>LP_MODE_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT11</name>
              <description>LP_MODE_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT12</name>
              <description>LP_MODE_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT13</name>
              <description>LP_MODE_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT14</name>
              <description>LP_MODE_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_SETPOINT15</name>
              <description>LP_MODE_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_DIG_TRACKING_EN_SP</name>
          <description>LDO_LPSR_DIG_TRACKING_EN_SP_REGISTER</description>
          <addressOffset>0x6C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRACKING_EN_SETPOINT0</name>
              <description>TRACKING_EN_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT1</name>
              <description>TRACKING_EN_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT2</name>
              <description>TRACKING_EN_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT3</name>
              <description>TRACKING_EN_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT4</name>
              <description>TRACKING_EN_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT5</name>
              <description>TRACKING_EN_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT6</name>
              <description>TRACKING_EN_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT7</name>
              <description>TRACKING_EN_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT8</name>
              <description>TRACKING_EN_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT9</name>
              <description>TRACKING_EN_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT10</name>
              <description>TRACKING_EN_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT11</name>
              <description>TRACKING_EN_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT12</name>
              <description>TRACKING_EN_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT13</name>
              <description>TRACKING_EN_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT14</name>
              <description>TRACKING_EN_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT15</name>
              <description>TRACKING_EN_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_DIG_BYPASS_EN_SP</name>
          <description>LDO_LPSR_DIG_BYPASS_EN_SP_REGISTER</description>
          <addressOffset>0x6D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYPASS_EN_SETPOINT0</name>
              <description>BYPASS_EN_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT1</name>
              <description>BYPASS_EN_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT2</name>
              <description>BYPASS_EN_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT3</name>
              <description>BYPASS_EN_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT4</name>
              <description>BYPASS_EN_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT5</name>
              <description>BYPASS_EN_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT6</name>
              <description>BYPASS_EN_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT7</name>
              <description>BYPASS_EN_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT8</name>
              <description>BYPASS_EN_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT9</name>
              <description>BYPASS_EN_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT10</name>
              <description>BYPASS_EN_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT11</name>
              <description>BYPASS_EN_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT12</name>
              <description>BYPASS_EN_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT13</name>
              <description>BYPASS_EN_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT14</name>
              <description>BYPASS_EN_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT15</name>
              <description>BYPASS_EN_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_DIG_STBY_EN_SP</name>
          <description>LDO_LPSR_DIG_STBY_EN_SP_REGISTER</description>
          <addressOffset>0x6E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_EN_SETPOINT0</name>
              <description>STBY_EN_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT1</name>
              <description>STBY_EN_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT2</name>
              <description>STBY_EN_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT3</name>
              <description>STBY_EN_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT4</name>
              <description>STBY_EN_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT5</name>
              <description>STBY_EN_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT6</name>
              <description>STBY_EN_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT7</name>
              <description>STBY_EN_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT8</name>
              <description>STBY_EN_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT9</name>
              <description>STBY_EN_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT10</name>
              <description>STBY_EN_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT11</name>
              <description>STBY_EN_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT12</name>
              <description>STBY_EN_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT13</name>
              <description>STBY_EN_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT14</name>
              <description>STBY_EN_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT15</name>
              <description>STBY_EN_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
