nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>RBB_SOC_CONFIGURE</name>
          <description>RBB_SOC_CONFIGURE_REGISTER</description>
          <addressOffset>0x7A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WB_CFG_PW</name>
              <description>wb_cfg_pw</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_CFG_NW</name>
              <description>wb_cfg_nw</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCILLATOR_BITS</name>
              <description>oscillator_bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGULATOR_STRENGTH</name>
              <description>regulator_strength</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REFTOP_OTP_TRIM_VALUE</name>
          <description>REFTOP_OTP_TRIM_VALUE_REGISTER</description>
          <addressOffset>0x7B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REFTOP_IBZTCADJ</name>
              <description>REFTOP_IBZTCADJ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REFTOP_VBGADJ</name>
              <description>REFTOP_VBGADJ</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REFTOP_TRIM_EN</name>
              <description>REFTOP_TRIM_EN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WB_OTP_TRIM_VALUE</name>
          <description>WB_OTP_TRIM_VALUE_REGISTER</description>
          <addressOffset>0x7C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WB_CFG_9</name>
              <description>WB_CFG_9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WB_CFG_11_10</name>
              <description>WB_CFG_11_10</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WB_NW_LVL</name>
              <description>WB_NW_LVL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WB_PW_LVL</name>
              <description>WB_PW_LVL</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WB_ADJ</name>
              <description>WB_ADJ</description>
              <bitOffset>11</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WB_IN_SP</name>
              <description>WB_IN_SP</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WB_TRIM_EN</name>
              <description>WB_TRIM_EN</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSR_1P8_LDO_OTP_TRIM_VALUE</name>
          <description>LPSR_1P8_LDO_OTP_TRIM_VALUE_REGISTER</description>
          <addressOffset>0x7D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPSR_LDO_1P8_TRIM</name>
              <description>LPSR_LDO_1P8_TRIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPSR_LDO_1P8_TRIM_EN</name>
              <description>LPSR_LDO_1P8_TRIM_EN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ANADIG_PWRDET</name>
      <description>MX6RT_ANADIG_REGISTER</description>
      <alternatePeripheral>ANADIG_LDO_SNVS</alternatePeripheral>
      <groupName>ANADIG</groupName>
      <baseAddress>0x40C84000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x424</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PWRDET</name>
          <description>PWRDET_REGISTER</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN_CURMIR</name>
              <description>en_curmir</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_UA_CURMIR</name>
              <description>en_ua_curmir</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_NA_CURMIR</name>
              <description>en_na_curmir</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_V2V</name>
              <description>en_v2v</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_V2V_BUF</name>
              <description>en_v2v_buf</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>V2V_TEST_EN</name>
              <description>v2v_test_en</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>V2V_1VTRIM</name>
              <description>v2v_1vtrim</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>V2V_TEST_SEL</name>
              <description>v2v_test_sel</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWPWR_SETTLE_DETECT_EN</name>
              <description>lowpwr_settle_detect_en</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWPWR_SETTLE_DETECT_SEL</name>
              <description>lowpwr_settle_detect_sel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWPWR_SETTLE_DELAY_EN</name>
              <description>lowpwr_settle_delay_en</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_TEST_EN</name>
              <description>ps_test_en</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PS_TEST_SEL</name>
              <description>ps_test_sel</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDD_SOC_OK</name>
              <description>vdd_soc_ok</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
