nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0">
      <name>PGMC_BPC1</name>
      <description>no description available</description>
      <groupName>PGMC_BPC</groupName>
      <baseAddress>0x40C88200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0">
      <name>PGMC_BPC2</name>
      <description>no description available</description>
      <groupName>PGMC_BPC</groupName>
      <baseAddress>0x40C88400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0">
      <name>PGMC_BPC3</name>
      <description>no description available</description>
      <groupName>PGMC_BPC</groupName>
      <baseAddress>0x40C88600</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0">
      <name>PGMC_BPC4</name>
      <description>no description available</description>
      <groupName>PGMC_BPC</groupName>
      <baseAddress>0x40C88800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0">
      <name>PGMC_BPC5</name>
      <description>no description available</description>
      <groupName>PGMC_BPC</groupName>
      <baseAddress>0x40C88A00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0">
      <name>PGMC_BPC6</name>
      <description>no description available</description>
      <groupName>PGMC_BPC</groupName>
      <baseAddress>0x40C88C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0">
      <name>PGMC_BPC7</name>
      <description>no description available</description>
      <groupName>PGMC_BPC</groupName>
      <baseAddress>0x40C88E00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>PGMC_BPC0_MIF</name>
      <description>no description available</description>
      <groupName>PGMC_MIF</groupName>
      <headerStructName>PGMC_MIF</headerStructName>
      <baseAddress>0x40C88100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MPC_AUTHEN_CTRL</name>
          <description>MPC Authentication Control</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_CFG</name>
              <description>Configuration lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_STAT</name>
          <description>MIF Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xA000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_STATE</name>
              <description>Memory low power level status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLEEP_STATE</name>
              <description>SLEEP status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IG_STATE</name>
              <description>IG status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LS_STATE</name>
              <description>LS status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HS_STATE</name>
              <description>HS status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STDBY_STATE</name>
              <description>STDBY status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARR_HF_STATE</name>
              <description>ARR_HF_OFF status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARR_LF_STATE</name>
              <description>ARR_LF_OFF status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_HF_STATE</name>
              <description>PER_HF_OFF status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_LF_STATE</name>
              <description>PER_LF_OFF status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INITN_STATE</name>
              <description>INITN status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSW1_STATE</name>
              <description>PSW1_OFF status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSW2_STATE</name>
              <description>PSW2_OFF status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_STATE</name>
              <description>ISO_EN status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_MLPL_SLEEP</name>
          <description>MIF MLPL control of SLEEP</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_CTRL</name>
              <description>Signal behavior at each MLPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_VDD_OK</name>
              <description>Bypass vdd_ok, locked by LOCK_CFG field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_SLEEP</name>
          <description>MIF Delay of SLEEP</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before asserting signal to high, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before de-asserting signal to low, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_MLPL_IG</name>
          <description>MIF MLPL control of IG</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x60</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_CTRL</name>
              <description>Signal behavior at each MLPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_IG</name>
          <description>MIF Delay of IG</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before asserting signal to high, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before de-asserting signal to low, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_MLPL_LS</name>
          <description>MIF MLPL control of LS</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_CTRL</name>
              <description>Signal behavior at each MLPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_LS</name>
          <description>MIF Delay of LS</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before asserting signal to high, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before de-asserting signal to low, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_MLPL_HS</name>
          <description>MIF MLPL control of HS</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_CTRL</name>
              <description>Signal behavior at each MLPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_HS</name>
          <description>MIF Delay of HS</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before asserting signal to high, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before de-asserting signal to low, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_MLPL_STDBY</name>
          <description>MIF MLPL control of STDBY</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_CTRL</name>
              <description>Signal behavior at each MLPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_STDBY</name>
          <description>MIF Delay of STDBY</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before asserting signal to high, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before de-asserting signal to low, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_MLPL_ARR_PDN</name>
          <description>MIF MLPL control of array power down</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_CTRL</name>
              <description>Signal behavior at each MLPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_ARR_HF</name>
          <description>MIF Delay of array high-fanout power switch</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before turn off the high-fanout power switch, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before turn on the high-fanout power switch, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_ARR_LF</name>
          <description>MIF Delay of array low-fanout power switch</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before turn off the low-fanout power switch, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before turn on the low-fanout power switch, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_MLPL_PER_PDN</name>
          <description>MIF MLPL control of peripheral power down</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_CTRL</name>
              <description>Signal behavior at each MLPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_PER_HF</name>
          <description>MIF Delay of peripheral high-fanout power switch</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before turn off the low-fanout power switch, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before turn on the low-fanout power switch, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_PER_LF</name>
          <description>MIF Delay of peripheral low-fanout power switch</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before turn off the low-fanout power switch, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before turn on the low-fanout power switch, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_MLPL_INITN</name>
          <description>MIF MLPL control of INITN</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x35FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_CTRL</name>
              <description>Signal behavior at each MLPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_VDD_OK</name>
              <description>Bypass vdd_ok, locked by LOCK_CFG field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_INITN</name>
          <description>MIF Delay of INITN</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before asserting signal to high, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before de-asserting signal to low, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_MLPL_PSW1_OFF</name>
          <description>MIF MLPL control of power switch 1 off</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xE000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_CTRL</name>
              <description>Signal behavior at each MLPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
