nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>MIF_DLY_PSW1_OFF</name>
          <description>MIF Delay of power switch 1 off</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before asserting signal to high, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before de-asserting signal to low, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_MLPL_PSW2_OFF</name>
          <description>MIF MLPL control of power switch 2 off</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x9FFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_CTRL</name>
              <description>Signal behavior at each MLPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_PSW2_OFF</name>
          <description>MIF Delay of power switch 2 off</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before asserting signal to high, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before de-asserting signal to low, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_MLPL_ISO</name>
          <description>MIF MLPL control of isolation enable</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xCA00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_CTRL</name>
              <description>Signal behavior at each MLPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIF_DLY_ISO</name>
          <description>MIF Delay of isolation enable</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_HI_DLY</name>
              <description>Delay before asserting signal to high, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRE_LO_DLY</name>
              <description>Delay before de-asserting signal to low, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0_MIF">
      <name>PGMC_BPC1_MIF</name>
      <description>no description available</description>
      <groupName>PGMC_MIF</groupName>
      <baseAddress>0x40C88300</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0_MIF">
      <name>PGMC_BPC2_MIF</name>
      <description>no description available</description>
      <groupName>PGMC_MIF</groupName>
      <baseAddress>0x40C88500</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0_MIF">
      <name>PGMC_BPC3_MIF</name>
      <description>no description available</description>
      <groupName>PGMC_MIF</groupName>
      <baseAddress>0x40C88700</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0_MIF">
      <name>PGMC_CPC0_MIF0</name>
      <description>no description available</description>
      <groupName>PGMC_MIF</groupName>
      <baseAddress>0x40C89100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0_MIF">
      <name>PGMC_CPC0_MIF1</name>
      <description>no description available</description>
      <groupName>PGMC_MIF</groupName>
      <baseAddress>0x40C89200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0_MIF">
      <name>PGMC_CPC1_MIF0</name>
      <description>no description available</description>
      <groupName>PGMC_MIF</groupName>
      <baseAddress>0x40C8A100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PGMC_BPC0_MIF">
      <name>PGMC_CPC1_MIF1</name>
      <description>no description available</description>
      <groupName>PGMC_MIF</groupName>
      <baseAddress>0x40C8A200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>PGMC_CPC0</name>
      <description>no description available</description>
      <groupName>PGMC_CPC</groupName>
      <headerStructName>PGMC_CPC</headerStructName>
      <baseAddress>0x40C89000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CPC_AUTHEN_CTRL</name>
          <description>CPC Authentication Control</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USER</name>
              <description>Allow user mode access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONSECURE</name>
              <description>Allow non-secure mode access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_SETTING</name>
              <description>Lock NONSECURE and USER</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHITE_LIST</name>
              <description>Domain ID white list</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_LIST</name>
              <description>White list lock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_CFG</name>
              <description>Configuration lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_MISC</name>
          <description>CPC Miscellaneous</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CPC_CORE_MODE</name>
          <description>CPC Core Mode</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTRL_MODE</name>
              <description>Control mode, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTRL_MODE_0</name>
                  <description>Not affected by any low power mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTRL_MODE_1</name>
                  <description>Controlled by CPU power mode of the domain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_CORE_POWER_CTRL</name>
          <description>CPC core power control</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWR_OFF_AT_WAIT</name>
              <description>Power off when domain enters WAIT mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWR_OFF_AT_STOP</name>
              <description>Power off when domain enters STOP mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWR_OFF_AT_SUSPEND</name>
              <description>Power off when domain enters SUSPEND mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO_ON_SOFT</name>
              <description>Software isolation on trigger</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSW_OFF_SOFT</name>
              <description>Software power off trigger</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSW_ON_SOFT</name>
              <description>Software power on trigger</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO_OFF_SOFT</name>
              <description>Software isolation off trigger</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_CORE_PDN_CTRL</name>
          <description>CPC core power down control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3C0F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLY_PRE_PSW_LF_OFF</name>
              <description>Delay from receiving power off request to low fanout power switch shut off, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_PRE_PSW_HF_OFF</name>
              <description>Delay from receiving power off request to high fanout power switch shut off, locked by LOCK_CFG field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_PRE_ISO_ON</name>
              <description>Delay from receiving iso_on request to isolation enable, locked by LOCK_CFG field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_CORE_PUP_CTRL</name>
          <description>CPC core power up control</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLY_PRE_PSW_LF_ON</name>
              <description>Delay from receiving power on request to low fanout power switch truns on, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_PRE_PSW_HF_ON</name>
              <description>Delay from receiving power on request to high fanout power switch truns on, locked by LOCK_CFG field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_PRE_ISO_OFF</name>
              <description>Delay from receiving iso off request to isolation disable, locked by LOCK_CFG field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_CORE_POWER_STAT</name>
          <description>CPC core power status</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CM_ISO_REQUEST</name>
              <description>CPU mode trans iso request of 4 domains</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CM_PWR_REQUEST</name>
              <description>CPU mode trans power request of 4 domains</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_POWER_MODE</name>
              <description>CPU power mode of assigned domain</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_FSM_STAT</name>
              <description>isolation FSM state</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSW_FSM_STAT</name>
              <description>power switch FSM state</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POWER_STABLE</name>
              <description>Power supply stable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_STAT</name>
              <description>Isolation status</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSW_LF_STAT</name>
              <description>Low fanout power switch status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSW_HF_STAT</name>
              <description>High fanout power switch status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_CORE_PSW_ACK_CTRL</name>
          <description>CPC core power switch acknowledge control</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LF_CNT_CFG</name>
              <description>Low fanout count configure, useage is depending on CNT_MODE, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HF_CNT_CFG</name>
              <description>High fanout count configure, useage is depending on CNT_MODE, locked by LOCK_CFG field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Raise power_on/off done response once power switches change</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Raise power_on/off done response once getting power switche acknowledge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore power switches acknowledge, the delay counter starts to count once switches change</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once switches change, then raise power_on/off done response when either acknowledge received or counting to LF/HF_CNT_CFG value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LF_ACK_INVERT</name>
              <description>Low fanout acknowledge value is inverted from power switch control, locked by LOCK_CFG field</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HF_ACK_INVERT</name>
              <description>High fanout acknowledge value is inverted from power switch control, locked by LOCK_CFG field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_CORE_PSW_ACK_STAT</name>
          <description>CPC core power switch acknowledge status</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LF_ACK_CNT</name>
              <description>Low fanout acknowledge count, record the delay from power switch change to acknowledge received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HF_ACK_CNT</name>
              <description>High fanout acknowledge count, record the delay from power switch change to acknowledge received</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LF_ACK_STAT</name>
              <description>Low fanout acknowledge status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HF_ACK_STAT</name>
              <description>High fanout acknowledge status</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
