nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>CPC_FLAG</name>
          <description>CPC flag</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CORE_PDN_FLAG</name>
              <description>set to 1 after core power switch off, cleared by writing 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_CACHE_MODE</name>
          <description>CPC Cache Mode</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTRL_MODE</name>
              <description>Control mode, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTRL_MODE_0</name>
                  <description>Not affected by any low power mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTRL_MODE_1</name>
                  <description>Controlled by CPU power mode of the domain</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTRL_MODE_2</name>
                  <description>Controlled by set point</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_CACHE_CM_CTRL</name>
          <description>CPC cache CPU mode control</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3330</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_AT_RUN</name>
              <description>Memory low power level at RUN mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_WAIT</name>
              <description>Memory low power level at WAIT mode, locked by LOCK_CFG field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_STOP</name>
              <description>Memory low power level at STOP mode, locked by LOCK_CFG field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SUSPEND</name>
              <description>Memory low power level at STOP mode, locked by LOCK_CFG field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_SOFT</name>
              <description>Memory low power level software change request, keep 1 until MLPL transition complete</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_CACHE_SP_CTRL_0</name>
          <description>CPC cache set point control 0</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_AT_SP0</name>
              <description>Memory low power level at set point 0, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP1</name>
              <description>Memory low power level at set point 1, locked by LOCK_CFG field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP2</name>
              <description>Memory low power level at set point 2, locked by LOCK_CFG field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP3</name>
              <description>Memory low power level at set point 3, locked by LOCK_CFG field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP4</name>
              <description>Memory low power level at set point 4, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP5</name>
              <description>Memory low power level at set point 5, locked by LOCK_CFG field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP6</name>
              <description>Memory low power level at set point 6, locked by LOCK_CFG field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP7</name>
              <description>Memory low power level at set point 7, locked by LOCK_CFG field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_CACHE_SP_CTRL_1</name>
          <description>CPC cache set point control 1</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_AT_SP8</name>
              <description>Memory low power level at set point 8, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP9</name>
              <description>Memory low power level at set point 9, locked by LOCK_CFG field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP10</name>
              <description>Memory low power level at set point 10, locked by LOCK_CFG field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP11</name>
              <description>Memory low power level at set point 11, locked by LOCK_CFG field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP12</name>
              <description>Memory low power level at set point 12, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP13</name>
              <description>Memory low power level at set point 13, locked by LOCK_CFG field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP14</name>
              <description>Memory low power level at set point 14, locked by LOCK_CFG field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP15</name>
              <description>Memory low power level at set point 15, locked by LOCK_CFG field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_CACHE_STAT</name>
          <description>CPC cache status</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURRENT_MLPL</name>
              <description>Current memory low power level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy requesting low power level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_FSM_STAT</name>
              <description>memory FSM state</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_LMEM_MODE</name>
          <description>CPC local memory Mode</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTRL_MODE</name>
              <description>Control mode, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTRL_MODE_0</name>
                  <description>Not affected by any low power mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTRL_MODE_1</name>
                  <description>Controlled by CPU power mode of the domain</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTRL_MODE_2</name>
                  <description>Controlled by set point</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_LMEM_CM_CTRL</name>
          <description>CPC local memory CPU mode control</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_AT_RUN</name>
              <description>Memory low power level at RUN mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_WAIT</name>
              <description>Memory low power level at WAIT mode, locked by LOCK_CFG field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_STOP</name>
              <description>Memory low power level at STOP mode, locked by LOCK_CFG field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SUSPEND</name>
              <description>Memory low power level at STOP mode, locked by LOCK_CFG field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_SOFT</name>
              <description>Memory low power level software change request, keep 1 until MLPL transition complete</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_LMEM_SP_CTRL_0</name>
          <description>CPC local memory set point control 0</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_AT_SP0</name>
              <description>Memory low power level at set point 0, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP1</name>
              <description>Memory low power level at set point 1, locked by LOCK_CFG field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP2</name>
              <description>Memory low power level at set point 2, locked by LOCK_CFG field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP3</name>
              <description>Memory low power level at set point 3, locked by LOCK_CFG field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP4</name>
              <description>Memory low power level at set point 4, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP5</name>
              <description>Memory low power level at set point 5, locked by LOCK_CFG field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP6</name>
              <description>Memory low power level at set point 6, locked by LOCK_CFG field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP7</name>
              <description>Memory low power level at set point 7, locked by LOCK_CFG field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_LMEM_SP_CTRL_1</name>
          <description>CPC local memory set point control 1</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_AT_SP8</name>
              <description>Memory low power level at set point 8, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP9</name>
              <description>Memory low power level at set point 9, locked by LOCK_CFG field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP10</name>
              <description>Memory low power level at set point 10, locked by LOCK_CFG field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP11</name>
              <description>Memory low power level at set point 11, locked by LOCK_CFG field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP12</name>
              <description>Memory low power level at set point 12, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP13</name>
              <description>Memory low power level at set point 13, locked by LOCK_CFG field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP14</name>
              <description>Memory low power level at set point 14, locked by LOCK_CFG field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP15</name>
              <description>Memory low power level at set point 15, locked by LOCK_CFG field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPC_LMEM_STAT</name>
          <description>CPC local memory status</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURRENT_MLPL</name>
              <description>Current low power level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy requesting low power level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_FSM_STAT</name>
              <description>memory FSM state</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
