nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SNVS</name>
      <description>SNVS</description>
      <groupName>SNVS</groupName>
      <baseAddress>0x40C90000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SNVS_HP_WRAPPER</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>SNVS_HP_WRAPPER_TZ</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>SNVS_LP_WRAPPER</name>
        <value>68</value>
      </interrupt>
      <registers>
        <register>
          <name>HPLR</name>
          <description>SNVS_HP Lock Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZMK_WSL</name>
              <description>Zeroizable Master Key Write Soft Lock When set, prevents any writes (software and hardware) to the ZMK registers and the ZMK_HWP, ZMK_VAL, and ZMK_ECC_EN fields of the LPMKCR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ALLOWED</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_NOT_ALLOWED</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZMK_RSL</name>
              <description>Zeroizable Master Key Read Soft Lock When set, prevents any software reads to the ZMK Registers and ZMK_ECC_VALUE field of the LPMKCR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ_ALLOWED</name>
                  <description>Read access is allowed (only in software Programming mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ_NOT_ALLOWED</name>
                  <description>Read access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRTC_SL</name>
              <description>Secure Real Time Counter Soft Lock When set, prevents any writes to the SRTC Registers, SRTC_ENV, and SRTC_INV_EN bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ALLOWED</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_NOT_ALLOWED</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPCALB_SL</name>
              <description>LP Calibration Soft Lock When set, prevents any writes to the LP Calibration Value (LPCALB_VAL) and LP Calibration Enable (LPCALB_EN)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ALLOWED</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_NOT_ALLOWED</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MC_SL</name>
              <description>Monotonic Counter Soft Lock When set, prevents any writes (increments) to the MC Registers and MC_ENV bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ALLOWED</name>
                  <description>Write access (increment) is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_NOT_ALLOWED</name>
                  <description>Write access (increment) is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPR_SL</name>
              <description>General Purpose Register Soft Lock When set, prevents any writes to the GPR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ALLOWED</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_NOT_ALLOWED</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSVCR_SL</name>
              <description>LP Security Violation Control Register Soft Lock When set, prevents any writes to the LPSVCR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPTGFCR_SL</name>
              <description>LP Tamper Glitch Filter Configuration Register Soft Lock When set, prevents any writes to the LPTGFCR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSECR_SL</name>
              <description>LP Security Events Configuration Register Soft Lock When set, prevents any writes to the LPSECR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MKS_SL</name>
              <description>Master Key Select Soft Lock When set, prevents any writes to the MASTER_KEY_SEL field of the LPMKCR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPSVCR_L</name>
              <description>HP Security Violation Control Register Lock When set, prevents any writes to the HPSVCR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPSICR_L</name>
              <description>HP Security Interrupt Control Register Lock When set, prevents any writes to the HPSICR</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAC_L</name>
              <description>High Assurance Counter Lock When set, prevents any writes to HPHACIVR, HPHACR, and HAC_EN bit of HPCOMR</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AT1_SL</name>
              <description>Active Tamper 1 Soft Lock When set, prevents any writes to the Active Tamper 1 registers</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AT2_SL</name>
              <description>Active Tamper 2 Soft Lock When set, prevents any writes to the Active Tamper 2 registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AT3_SL</name>
              <description>Active Tamper 3 Soft Lock When set, prevents any writes to the Active Tamper 3 registers</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AT4_SL</name>
              <description>Active Tamper 4 Soft Lock When set, prevents any writes to the Active Tamper 4 registers</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AT5_SL</name>
              <description>Active Tamper 5 Soft Lock When set, prevents any writes to the Active Tamper 5 registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE_ACCESS_ALLOWED</name>
                  <description>Write access is allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS_NOT_ALLOWED</name>
                  <description>Write access is not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
