nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>HPSICR</name>
          <description>SNVS_HP Security Interrupt Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SV0_EN</name>
              <description>Security Violation 0 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 0 security violation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 0 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 0 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV1_EN</name>
              <description>Security Violation 1 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 1 security violation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 1 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 1 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV2_EN</name>
              <description>Security Violation 2 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 2 security violation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 2 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 2 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV3_EN</name>
              <description>Security Violation 3 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 3 security violation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 3 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 3 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV4_EN</name>
              <description>Security Violation 4 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 4 security violation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 4 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 4 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV5_EN</name>
              <description>Security Violation 5 Interrupt Enable Setting this bit to 1 enables generation of the security interrupt to the host processor upon detection of the Security Violation 5 security violation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 5 Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Security Violation 5 Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSVI_EN</name>
              <description>LP Security Violation Interrupt Enable This bit enables generating of the security interrupt to the host processor upon security violation signal from the LP section</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LP Security Violation Interrupt is Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LP Security Violation Interrupt is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HPSVCR</name>
          <description>SNVS_HP Security Violation Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SV0_CFG</name>
              <description>Security Violation 0 Security Violation Configuration This field configures the Security Violation 0 Security Violation Input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_FATAL</name>
                  <description>Security Violation 0 is a non-fatal violation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FATAL</name>
                  <description>Security Violation 0 is a fatal violation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV1_CFG</name>
              <description>Security Violation 1 Security Violation Configuration This field configures the Security Violation 1 Security Violation Input</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_FATAL</name>
                  <description>Security Violation 1 is a non-fatal violation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FATAL</name>
                  <description>Security Violation 1 is a fatal violation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV2_CFG</name>
              <description>Security Violation 2 Security Violation Configuration This field configures the Security Violation 2 Security Violation Input</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_FATAL</name>
                  <description>Security Violation 2 is a non-fatal violation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FATAL</name>
                  <description>Security Violation 2 is a fatal violation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV3_CFG</name>
              <description>Security Violation 3 Security Violation Configuration This field configures the Security Violation 3 Security Violation Input</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_FATAL</name>
                  <description>Security Violation 3 is a non-fatal violation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FATAL</name>
                  <description>Security Violation 3 is a fatal violation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV4_CFG</name>
              <description>Security Violation 4 Security Violation Configuration This field configures the Security Violation 4 Security Violation Input</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_FATAL</name>
                  <description>Security Violation 4 is a non-fatal violation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FATAL</name>
                  <description>Security Violation 4 is a fatal violation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV5_CFG</name>
              <description>Security Violation 5 Security Violation Configuration This field configures the Security Violation 5 Security Violation Input</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Security Violation 5 is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_FATAL</name>
                  <description>Security Violation 5 is a non-fatal violation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FATAL</name>
                  <description>Security Violation 5 is a fatal violation</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSV_CFG</name>
              <description>LP Security Violation Configuration This field configures the LP security violation source.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LP security violation is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_FATAL</name>
                  <description>LP security violation is a non-fatal violation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FATAL</name>
                  <description>LP security violation is a fatal violation</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HPSR</name>
          <description>SNVS_HP Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80003000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPTA</name>
              <description>HP Time Alarm Indicates that the HP Time Alarm has occurred since this bit was last cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREPORT</name>
                  <description>No time alarm interrupt occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPORTED</name>
                  <description>A time alarm interrupt occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PI</name>
              <description>Periodic Interrupt Indicates that periodic interrupt has occurred since this bit was last cleared.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREPORT</name>
                  <description>No periodic interrupt occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPORTED</name>
                  <description>A periodic interrupt occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDIS</name>
              <description>Low Power Disable If 1, the low power section has been disabled by means of an input signal to SNVS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BTN</name>
              <description>Button Value of the BTN input</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BI</name>
              <description>Button Interrupt Signal ipi_snvs_btn_int_b was asserted.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SSM_STATE</name>
              <description>System Security Monitor State This field contains the encoded state of the SSM's state machine</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INIT</name>
                  <description>Init</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARD_FAIL</name>
                  <description>Hard Fail</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFT_FAIL</name>
                  <description>Soft Fail</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERMEDIATE</name>
                  <description>Init Intermediate (transition state between Init and Check - SSM stays in this state only one clock cycle)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHECK</name>
                  <description>Check</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_SECURE</name>
                  <description>Non-Secure</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUSTED</name>
                  <description>Trusted</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE</name>
                  <description>Secure</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECURITY_CONFIG</name>
              <description>Security Configuration This field reflects the settings of the sys_secure_boot input and the three security configuration inputs to SNVS</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAB_CONFIG</name>
                  <description>FAB configuration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_CONFIG</name>
                  <description>OPEN configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_CONFIG</name>
                  <description>OPEN configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_CONFIG</name>
                  <description>OPEN configuration</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIELD_RETURN_CONFIG</name>
                  <description>FIELD RETURN configuration</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAB_CONFIG</name>
                  <description>FAB configuration</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOSED_CONFIG</name>
                  <description>CLOSED configuration</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOSED_CONFIG</name>
                  <description>CLOSED configuration</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOSED_CONFIG</name>
                  <description>CLOSED configuration</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTPMK_ZERO</name>
              <description>One Time Programmable Master Key is Equal to Zero</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OTPMK_NOT_ZERO</name>
                  <description>The OTPMK is not zero.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTPMK_IS_ZERO</name>
                  <description>The OTPMK is zero.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZMK_ZERO</name>
              <description>Zeroizable Master Key is Equal to Zero</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZMK_NOT_ZERO</name>
                  <description>The ZMK is not zero.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZMK_IS_ZERO</name>
                  <description>The ZMK is zero.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
