nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>HPSVSR</name>
          <description>SNVS_HP Security Violation Status Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SV0</name>
              <description>Security Violation 0 security violation was detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREPORT</name>
                  <description>No Security Violation 0 security violation was detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPORTED</name>
                  <description>Security Violation 0 security violation was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV1</name>
              <description>Security Violation 1 security violation was detected.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREPORT</name>
                  <description>No Security Violation 1 security violation was detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPORTED</name>
                  <description>Security Violation 1 security violation was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV2</name>
              <description>Security Violation 2 security violation was detected.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREPORT</name>
                  <description>No Security Violation 2 security violation was detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPORTED</name>
                  <description>Security Violation 2 security violation was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV3</name>
              <description>Security Violation 3 security violation was detected.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREPORT</name>
                  <description>No Security Violation 3 security violation was detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPORTED</name>
                  <description>Security Violation 3 security violation was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV4</name>
              <description>Security Violation 4 security violation was detected.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREPORT</name>
                  <description>No Security Violation 4 security violation was detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPORTED</name>
                  <description>Security Violation 4 security violation was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV5</name>
              <description>Security Violation 5 security violation was detected.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREPORT</name>
                  <description>No Security Violation 5 security violation was detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPORTED</name>
                  <description>Security Violation 5 security violation was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_SV</name>
              <description>Software Security Violation This bit is a read-only copy of the SW_SV bit in the HP Command Register</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SW_FSV</name>
              <description>Software Fatal Security Violation This bit is a read-only copy of the SW_FSV bit in the HP Command Register</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SW_LPSV</name>
              <description>LP Software Security Violation This bit is a read-only copy of the SW_LPSV bit in the HP Command Register</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZMK_SYNDROME</name>
              <description>Zeroizable Master Key Syndrome The ZMK syndrome indicates the single-bit error location and parity for the ZMK register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZMK_ECC_FAIL</name>
              <description>Zeroizable Master Key Error Correcting Code Check Failure When set, this bit triggers a bad key violation to the SSM and a security violation to the SNVS_LP section, which clears security sensitive data</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREPORT</name>
                  <description>ZMK ECC Failure was not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPORTED</name>
                  <description>ZMK ECC Failure was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_SEC_VIO</name>
              <description>LP Security Violation A security volation was detected in the SNVS low power section.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPHACIVR</name>
          <description>SNVS_HP High Assurance Counter IV Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HAC_COUNTER_IV</name>
              <description>High Assurance Counter Initial Value This register is used to set the starting count value to the high assurance counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPHACR</name>
          <description>SNVS_HP High Assurance Counter Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HAC_COUNTER</name>
              <description>High Assurance Counter When the HAC_EN bit is set and the SSM is in the soft fail state, this counter starts to count down with the system clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPRTCMR</name>
          <description>SNVS_HP Real Time Counter MSB Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTC</name>
              <description>HP Real Time Counter The most-significant 15 bits of the RTC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPRTCLR</name>
          <description>SNVS_HP Real Time Counter LSB Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTC</name>
              <description>HP Real Time Counter least-significant 32 bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPTAMR</name>
          <description>SNVS_HP Time Alarm MSB Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPTA_MS</name>
              <description>HP Time Alarm, most-significant 15 bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPTALR</name>
          <description>SNVS_HP Time Alarm LSB Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPTA_LS</name>
              <description>HP Time Alarm, 32 least-significant bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
