nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>ROMPATCHSR</name>
          <description>ROMC Status Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>ROMC Source Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMP0MATCHED</name>
                  <description>Address Comparator 0 matched</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMP1MATCHED</name>
                  <description>Address Comparator 1 matched</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMP15MATCHED</name>
                  <description>Address Comparator 15 matched</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW</name>
              <description>ROMC AHB Multiple Address Comparator Match Indicator</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCOLLISION</name>
                  <description>No event or comparator collisions have occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COLLISION</name>
                  <description>A collision has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DCDC</name>
      <description>DCDC</description>
      <groupName>DCDC</groupName>
      <baseAddress>0x40CA8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL0</name>
          <description>DCDC Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable DCDC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIG_EN</name>
              <description>Enable the VDDIO switching converter output. The switching converter is enabled by default.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STBY_EN</name>
              <description>Set to &quot;1&quot; to make DCDC enter into standby mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_MODE_EN</name>
              <description>Set to &quot;1&quot; to make DCDC enter into low power mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_LP_MODE_EN</name>
              <description>Set to &quot;1&quot; to make DCDC enter into low power mode for GPC standby request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_DCDC_CNT</name>
              <description>Enable internal count for DCDC_OK timeout</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wait</name>
                  <description>Wait DCDC_OK for ACK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable_count</name>
                  <description>Enable internal count for DCDC_OK timeout</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIM_HOLD</name>
              <description>Hold trim input</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>sample</name>
                  <description>Sample trim input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hold</name>
                  <description>Hold trim input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONTROL_MODE</name>
              <description>Control mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>static</name>
                  <description>Static control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpc</name>
                  <description>Controlled by GPC set points</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL1</name>
          <description>DCDC Control Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0B100C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDD1P8CTRL_TRG</name>
              <description>Target value of VDD1P45 in buck mode, 25mV each step from 0x00 to 0x1F: 0x1F: 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDD1P0CTRL_TRG</name>
              <description>Target value of VDD1P0 in buck mode, 25mV each step from 0x00 to 0x1F: 0x1F: 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDD1P8CTRL_STBY_TRG</name>
              <description>Target value of VDD1P45 in standby mode, 25mV each step from 0x00 to 0x1F: 0x1F: 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDD1P0CTRL_STBY_TRG</name>
              <description>Target value of VDD1P0 in standby mode, 25mV each step from 0x00 to 0x1F: 0x1F: 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG0</name>
          <description>DCDC Register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4030511</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWD_ZCD</name>
              <description>Power Down Zero Cross Detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Zero cross detetion function powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Zero cross detetion function powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE_AUTO_CLK_SWITCH</name>
              <description>Disable Auto Clock Switch</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>xtal_clk</name>
                  <description>If DISABLE_AUTO_CLK_SWITCH is set to 0 and 24M xtal is OK, the clock source will switch from internal ring OSC to 24M xtal automatically</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sel_clk</name>
                  <description>If DISABLE_AUTO_CLK_SWITCH is set to 1, SEL_CLK will determine which clock source the DCDC uses</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_CLK</name>
              <description>Select Clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>int_rng_osc</name>
                  <description>DCDC uses internal ring oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xtal_24M</name>
                  <description>DCDC uses 24M xtal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_OSC_INT</name>
              <description>Power down internal osc</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Internal oscillator powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Internal oscillator powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_CUR_SNS_CMP</name>
              <description>Power down signal of the current detector</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Current Detector powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Current Detector powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CUR_SNS_THRSH</name>
              <description>Current Sense (detector) Threshold</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWD_OVERCUR_DET</name>
              <description>Power down overcurrent detection comparator</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Overcurrent detection comparator is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Overcurrent detection comparator is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERCUR_TRIG_ADJ</name>
              <description>Overcurrent Trigger Adjust</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWD_CMP_DCDC_IN_DET</name>
              <description>Set to &quot;1&quot; to power down the low voltage detection comparator</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Low voltage detection comparator is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Low voltage detection comparator is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_HIGH_VDD1P8_DET</name>
              <description>Power Down High Voltage Detection for VDD1P8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Overvoltage detection comparator for the VDD1P8 output is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Overvoltage detection comparator for the VDD1P8 output is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_HIGH_VDD1P0_DET</name>
              <description>Power Down High Voltage Detection for VDD1P0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Overvoltage detection comparator for the VDD1P0 output is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Overvoltage detection comparator for the VDD1P0 output is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_OVERLOAD_THRSH</name>
              <description>Low Power Overload Threshold</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_OVERLOAD_FREQ_SEL</name>
              <description>Low Power Overload Frequency Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_HIGH_HYS</name>
              <description>Low Power High Hysteric Value</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lp_12p5mV</name>
                  <description>Adjust hysteretic value in low power to 12.5mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lp_25mV</name>
                  <description>Adjust hysteretic value in low power to 25mV</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWD_CMP_OFFSET</name>
              <description>power down the out-of-range detection comparator</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>powered_up</name>
                  <description>Out-of-range comparator powered up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>powered_down</name>
                  <description>Out-of-range comparator powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALOK_DISABLE</name>
              <description>Disable xtalok detection circuit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable xtalok detection circuit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable xtalok detection circuit and always outputs OK signal &quot;1&quot;</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_24M_OK</name>
              <description>24M XTAL OK</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>int_rng_osc</name>
                  <description>DCDC uses internal ring OSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xtal_24M</name>
                  <description>DCDC uses xtal 24M</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS_DC_OK</name>
              <description>DCDC Output OK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_settled</name>
                  <description>DCDC is settling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>settled</name>
                  <description>DCDC already settled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
