nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>DESC_CTRL1_7</name>
          <description>Descriptor Control1 7 Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TRIG_SV</name>
              <description>Software trigger save</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ_NO</name>
                  <description>No software save request/software restore request complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_YES</name>
                  <description>Request a software save operation/software restore operation in progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_TRIG_RT</name>
              <description>Software trigger restore</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ_NO</name>
                  <description>No software restore request/software restore request complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_YES</name>
                  <description>Request a software restore operation/software restore operation in progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POWER_DOMAIN</name>
              <description>This field describes the mapping (0-7) to external request signals from different domains</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP_EN</name>
              <description>Group Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GP_DIS</name>
                  <description>Group disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GP_EN</name>
                  <description>Group enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV_PRIORITY</name>
              <description>Save Priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT_PRIORITY</name>
              <description>Restore Priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESD</name>
              <description>Restore Domain</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RL</name>
              <description>Read Lock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R_UNLOCK</name>
                  <description>Group is unlocked (write access allowed)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_LOCK</name>
                  <description>Group is locked (write access not allowed)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WL</name>
              <description>Write Lock</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W_UNLOCK</name>
                  <description>Group is unlocked (write access allowed)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W_LOCK</name>
                  <description>Group is locked (write access not allowed)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DL</name>
              <description>Domain lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D_UNLOCK</name>
                  <description>Unlock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_LOCK</name>
                  <description>Lock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DESC_ADDR_UP_7</name>
          <description>Descriptor Address Up 7 Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_UP</name>
              <description>Address field (High)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESC_ADDR_DOWN_7</name>
          <description>Descriptor Address Down 7 Register</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_DOWN</name>
              <description>Address field (Low)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESC_CTRL0_8</name>
          <description>Descriptor Control0 8 Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Start index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END</name>
              <description>End index</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SV_ORDER</name>
              <description>Save Order</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SV_START_END</name>
                  <description>Descriptors within the group are processed from start to end</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SV_END_START</name>
                  <description>Descriptors within the group are processed from end to start</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT_ORDER</name>
              <description>Restore order</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT_START_END</name>
                  <description>Descriptors within the group are processed from start to end</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_END_START</name>
                  <description>Descriptors within the group are processed from end to start</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DESC_CTRL1_8</name>
          <description>Descriptor Control1 8 Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TRIG_SV</name>
              <description>Software trigger save</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ_NO</name>
                  <description>No software save request/software restore request complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_YES</name>
                  <description>Request a software save operation/software restore operation in progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_TRIG_RT</name>
              <description>Software trigger restore</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ_NO</name>
                  <description>No software restore request/software restore request complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_YES</name>
                  <description>Request a software restore operation/software restore operation in progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POWER_DOMAIN</name>
              <description>This field describes the mapping (0-7) to external request signals from different domains</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP_EN</name>
              <description>Group Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GP_DIS</name>
                  <description>Group disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GP_EN</name>
                  <description>Group enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV_PRIORITY</name>
              <description>Save Priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT_PRIORITY</name>
              <description>Restore Priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESD</name>
              <description>Restore Domain</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RL</name>
              <description>Read Lock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R_UNLOCK</name>
                  <description>Group is unlocked (write access allowed)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_LOCK</name>
                  <description>Group is locked (write access not allowed)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WL</name>
              <description>Write Lock</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W_UNLOCK</name>
                  <description>Group is unlocked (write access allowed)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W_LOCK</name>
                  <description>Group is locked (write access not allowed)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DL</name>
              <description>Domain lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D_UNLOCK</name>
                  <description>Unlock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_LOCK</name>
                  <description>Lock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DESC_ADDR_UP_8</name>
          <description>Descriptor Address Up 8 Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_UP</name>
              <description>Address field (High)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESC_ADDR_DOWN_8</name>
          <description>Descriptor Address Down 8 Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_DOWN</name>
              <description>Address field (Low)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESC_CTRL0_9</name>
          <description>Descriptor Control0 9 Register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Start index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END</name>
              <description>End index</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SV_ORDER</name>
              <description>Save Order</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SV_START_END</name>
                  <description>Descriptors within the group are processed from start to end</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SV_END_START</name>
                  <description>Descriptors within the group are processed from end to start</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT_ORDER</name>
              <description>Restore order</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT_START_END</name>
                  <description>Descriptors within the group are processed from start to end</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_END_START</name>
                  <description>Descriptors within the group are processed from end to start</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
