nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
          <register>
            <name>CLOCK_ROOT_OPTIONS0</name>
            <description>Clock root low power status</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>OPTION0</name>
                <description>Clock input option 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPTION0_0</name>
                    <description>OSC_RC_16M</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_1</name>
                    <description>OSC_RC_48M</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_2</name>
                    <description>OSC_RC_48M_DIV2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_3</name>
                    <description>OSC_RC_400M</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_5</name>
                    <description>OSC_24M_OUT</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_7</name>
                    <description>PLL_ARM_OUT</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_9</name>
                    <description>PLL_528_OUT</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_10</name>
                    <description>PLL_528_PFD0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_11</name>
                    <description>PLL_528_PFD1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_12</name>
                    <description>PLL_528_PFD2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_13</name>
                    <description>PLL_528_PFD3</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_15</name>
                    <description>PLL_480_OUT</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_16</name>
                    <description>PLL_480_DIV2</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_17</name>
                    <description>PLL_480_PFD0</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_18</name>
                    <description>PLL_480_PFD1</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_19</name>
                    <description>PLL_480_PFD2</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_20</name>
                    <description>PLL_480_PFD3</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_22</name>
                    <description>PLL_1G_OUT</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_23</name>
                    <description>PLL_1G_DIV2</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_24</name>
                    <description>PLL_1G_DIV5</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_26</name>
                    <description>PLL_AUDIO_OUT</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION0_28</name>
                    <description>PLL_VIDEO_OUT</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OPTION1</name>
                <description>Clock input option 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPTION1_0</name>
                    <description>OSC_RC_16M</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_1</name>
                    <description>OSC_RC_48M</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_2</name>
                    <description>OSC_RC_48M_DIV2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_3</name>
                    <description>OSC_RC_400M</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_5</name>
                    <description>OSC_24M_OUT</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_7</name>
                    <description>PLL_ARM_OUT</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_9</name>
                    <description>PLL_528_OUT</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_10</name>
                    <description>PLL_528_PFD0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_11</name>
                    <description>PLL_528_PFD1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_12</name>
                    <description>PLL_528_PFD2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_13</name>
                    <description>PLL_528_PFD3</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_15</name>
                    <description>PLL_480_OUT</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_16</name>
                    <description>PLL_480_DIV2</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_17</name>
                    <description>PLL_480_PFD0</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_18</name>
                    <description>PLL_480_PFD1</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_19</name>
                    <description>PLL_480_PFD2</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_20</name>
                    <description>PLL_480_PFD3</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_22</name>
                    <description>PLL_1G_OUT</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_23</name>
                    <description>PLL_1G_DIV2</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_24</name>
                    <description>PLL_1G_DIV5</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_26</name>
                    <description>PLL_AUDIO_OUT</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION1_28</name>
                    <description>PLL_VIDEO_OUT</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OPTION2</name>
                <description>Clock input option2</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPTION2_0</name>
                    <description>OSC_RC_16M</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_1</name>
                    <description>OSC_RC_48M</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_2</name>
                    <description>OSC_RC_48M_DIV2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_3</name>
                    <description>OSC_RC_400M</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_5</name>
                    <description>OSC_24M_OUT</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_7</name>
                    <description>PLL_ARM_OUT</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_9</name>
                    <description>PLL_528_OUT</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_10</name>
                    <description>PLL_528_PFD0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_11</name>
                    <description>PLL_528_PFD1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_12</name>
                    <description>PLL_528_PFD2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_13</name>
                    <description>PLL_528_PFD3</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_15</name>
                    <description>PLL_480_OUT</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_16</name>
                    <description>PLL_480_DIV2</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_17</name>
                    <description>PLL_480_PFD0</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_18</name>
                    <description>PLL_480_PFD1</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_19</name>
                    <description>PLL_480_PFD2</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_20</name>
                    <description>PLL_480_PFD3</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_22</name>
                    <description>PLL_1G_OUT</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_23</name>
                    <description>PLL_1G_DIV2</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_24</name>
                    <description>PLL_1G_DIV5</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_26</name>
                    <description>PLL_AUDIO_OUT</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION2_28</name>
                    <description>PLL_VIDEO_OUT</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OPTION3</name>
                <description>Clock input option3</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPTION3_0</name>
                    <description>OSC_RC_16M</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_1</name>
                    <description>OSC_RC_48M</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_2</name>
                    <description>OSC_RC_48M_DIV2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_3</name>
                    <description>OSC_RC_400M</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_5</name>
                    <description>OSC_24M_OUT</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_7</name>
                    <description>PLL_ARM_OUT</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_9</name>
                    <description>PLL_528_OUT</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_10</name>
                    <description>PLL_528_PFD0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_11</name>
                    <description>PLL_528_PFD1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_12</name>
                    <description>PLL_528_PFD2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_13</name>
                    <description>PLL_528_PFD3</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_15</name>
                    <description>PLL_480_OUT</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_16</name>
                    <description>PLL_480_DIV2</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_17</name>
                    <description>PLL_480_PFD0</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_18</name>
                    <description>PLL_480_PFD1</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_19</name>
                    <description>PLL_480_PFD2</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_20</name>
                    <description>PLL_480_PFD3</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_22</name>
                    <description>PLL_1G_OUT</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_23</name>
                    <description>PLL_1G_DIV2</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_24</name>
                    <description>PLL_1G_DIV5</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_26</name>
                    <description>PLL_AUDIO_OUT</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION3_28</name>
                    <description>PLL_VIDEO_OUT</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
