nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SEMA4</name>
      <description>IPS_Semaphores</description>
      <groupName>SEMA4</groupName>
      <prependToName>SEMA4_</prependToName>
      <baseAddress>0x40CC8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x106</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>Gate00</name>
          <description>Semaphores Gate 0 Register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate01</name>
          <description>Semaphores Gate 1 Register</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate02</name>
          <description>Semaphores Gate 2 Register</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate03</name>
          <description>Semaphores Gate 3 Register</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate04</name>
          <description>Semaphores Gate 4 Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate05</name>
          <description>Semaphores Gate 5 Register</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate06</name>
          <description>Semaphores Gate 6 Register</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate07</name>
          <description>Semaphores Gate 7 Register</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate08</name>
          <description>Semaphores Gate 8 Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate09</name>
          <description>Semaphores Gate 9 Register</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate10</name>
          <description>Semaphores Gate 10 Register</description>
          <addressOffset>0xA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate11</name>
          <description>Semaphores Gate 11 Register</description>
          <addressOffset>0xB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Gate12</name>
          <description>Semaphores Gate 12 Register</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GTFSM</name>
              <description>Gate Finite State Machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GTFSM_0</name>
                  <description>The gate is unlocked (free).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_1</name>
                  <description>The gate has been locked by processor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_2</name>
                  <description>The gate has been locked by processor 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GTFSM_3</name>
                  <description>This state encoding is never used and therefore reserved. Attempted writes of 0x03 are treated as &quot;no operation&quot; and do not affect the gate state machine.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
