nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x800</dimIncrement>
          <name>paci[%s]</name>
          <description>no description available</description>
          <addressOffset>0x4000</addressOffset>
          <cluster>
            <dim>256</dim>
            <dimIncrement>0x8</dimIncrement>
            <name>paci_pdacj[%s]</name>
            <description>no description available</description>
            <addressOffset>0</addressOffset>
            <register>
              <name>PAC_PDAC_W0</name>
              <description>Peripheral Domain Access Control</description>
              <addressOffset>0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>D0ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D1ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D2ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>6</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D3ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>9</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D4ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>12</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D5ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>15</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D6ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>18</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D7ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>21</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>EALO</name>
                  <description>Exclusive Access Lock Owner</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>4</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>PAC_PDAC_W1</name>
              <description>Peripheral Domain Access Control</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>D8ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D9ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D10ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>6</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D11ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>9</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D12ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>12</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D13ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>15</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D14ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>18</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D15ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>21</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>EAL</name>
                  <description>Exclusive Access Lock</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>EAL_0</name>
                      <description>Lock disabled.</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EAL_1</name>
                      <description>Lock disabled until next reset.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EAL_2</name>
                      <description>Lock enabled, lock state = available.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EAL_3</name>
                      <description>Lock enabled, lock state = not available.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DL2</name>
                  <description>Descriptor Lock</description>
                  <bitOffset>29</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DL2_0</name>
                      <description>Lock disabled, descriptor registers can be written..</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DL2_1</name>
                      <description>Lock disabled until the next reset, descriptor registers can be written..</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DL2_2</name>
                      <description>Lock enabled, only domain &quot;x&quot; can only update the DxACP field; no other fields can be written..</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DL2_3</name>
                      <description>Lock enabled, descriptor registers are read-only until the next reset.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>VLD</name>
                  <description>Valid</description>
                  <bitOffset>31</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>VLD_0</name>
                      <description>The PDAC assignment is invalid.</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>VLD_1</name>
                      <description>The PDAC assignment is valid.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <dim>32</dim>
          <dimIncrement>0x400</dimIncrement>
          <name>mrci[%s]</name>
          <description>no description available</description>
          <addressOffset>0x8000</addressOffset>
          <cluster>
            <dim>32</dim>
            <dimIncrement>0x20</dimIncrement>
            <name>mrci_mrgdj[%s]</name>
            <description>no description available</description>
            <addressOffset>0</addressOffset>
            <register>
              <name>MRC_MRGD_W0</name>
              <description>Memory Region Descriptor</description>
              <addressOffset>0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>SRTADDR</name>
                  <description>Start Address</description>
                  <bitOffset>12</bitOffset>
                  <bitWidth>20</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MRC_MRGD_W1</name>
              <description>Memory Region Descriptor</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>SRTADDR</name>
                  <description>Start Address</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>4</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MRC_MRGD_W2</name>
              <description>Memory Region Descriptor</description>
              <addressOffset>0x8</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0xFFF</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>ENDADDR</name>
                  <description>End Address</description>
                  <bitOffset>12</bitOffset>
                  <bitWidth>20</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MRC_MRGD_W3</name>
              <description>Memory Region Descriptor</description>
              <addressOffset>0xC</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>ENDADDR</name>
                  <description>End Address</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>4</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MRC_MRGD_W4</name>
              <description>Memory Region Descriptor</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>RMSG</name>
                  <description>Relay Message</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>4</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DET</name>
                  <description>Detour Switch</description>
                  <bitOffset>28</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DET_0</name>
                      <description>Do not re-route address.</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DET_1</name>
                      <description>Re-route address.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>MRC_MRGD_W5</name>
              <description>Memory Region Descriptor</description>
              <addressOffset>0x14</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>D0ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D1ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D2ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>6</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D3ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>9</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D4ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>12</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D5ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>15</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D6ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>18</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D7ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>21</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>EALO</name>
                  <description>Exclusive Access Lock Owner</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>4</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
