nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO1</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x4012C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO1_Combined_0_15</name>
        <value>100</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_Combined_16_31</name>
        <value>101</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO2</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40130000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO2_Combined_0_15</name>
        <value>102</value>
      </interrupt>
      <interrupt>
        <name>GPIO2_Combined_16_31</name>
        <value>103</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO3</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40134000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO3_Combined_0_15</name>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>GPIO3_Combined_16_31</name>
        <value>105</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO4</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40138000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO4_Combined_0_15</name>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>GPIO4_Combined_16_31</name>
        <value>107</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO5</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x4013C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO5_Combined_0_15</name>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>GPIO5_Combined_16_31</name>
        <value>109</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO6</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40140000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO6_Combined_0_15</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>GPIO6_Combined_16_31</name>
        <value>62</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO7</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40C5C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO8</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40C60000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO9</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40C64000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO10</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40C68000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO11</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40C6C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO12</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40C70000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>GPIO13</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40CA0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO13_Combined_0_31</name>
        <value>93</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CM7_GPIO2">
      <name>CM7_GPIO3</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x4200C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CM7_GPIO2_3</name>
        <value>99</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SystemControl</name>
      <description>System Control Block</description>
      <groupName>SCB</groupName>
      <prependToName>SCB_</prependToName>
      <baseAddress>0xE000E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFAC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ACTLR</name>
          <description>Auxiliary Control Register,</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DISFOLD</name>
              <description>Disables folding of IT instructions.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISFOLD_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPEXCODIS</name>
              <description>Disables FPU exception outputs.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FPEXCODIS_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FPEXCODIS_1</name>
                  <description>FPU exception outputs are disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISRAMODE</name>
              <description>Disables dynamic read allocate mode for Write-Back Write-Allocate memory regions.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISRAMODE_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISRAMODE_1</name>
                  <description>Dynamic disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISITMATBFLUSH</name>
              <description>Disables ITM and DWT ATB flush.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISITMATBFLUSH_1</name>
                  <description>ITM and DWT ATB flush disabled, this bit is always 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISBTACREAD</name>
              <description>Disables BTAC read.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISBTACREAD_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISBTACREAD_1</name>
                  <description>BTAC is not used and only static branch prediction can occur.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISBTACALLOC</name>
              <description>Disables BTAC allocate.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISBTACALLOC_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISBTACALLOC_1</name>
                  <description>No new entries are allocated in Branch Target Address Cache (BTAC), but existing entries can be updated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCRITAXIRUR</name>
              <description>Disables critical AXI Read-Under-Read.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISCRITAXIRUR_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCRITAXIRUR_1</name>
                  <description>An AXI read to Strongly-Ordered or Device memory, or an LDREX to Shareable memory, is not put on AXI if there are any outstanding reads on AXI. Transactions on AXI cannot be interrupted. This bit might reduce the time that these transactions are in progress and might improve worst case interrupt latency. Performance is decreased when this bit is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISDI</name>
              <description>Disables dual-issued.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISDI_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISDI_1</name>
                  <description>Nothing can be dual-issued when this instruction type is in channel 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISISSCH1</name>
              <description>Disables dual-issued.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISISSCH1_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISISSCH1_1</name>
                  <description>Nothing can be dual-issued when this instruction type is in channel 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISDYNADD</name>
              <description>Disables dynamic allocation of ADD and SUB instructions</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISDYNADD_0</name>
                  <description>Normal operation. Some ADD and SUB instrctions are resolved in EX1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISDYNADD_1</name>
                  <description>All ADD and SUB instructions are resolved in EX2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCRITAXIRUW</name>
              <description>Disables critical AXI read-under-write</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISCRITAXIRUW_0</name>
                  <description>Normal operation. This is backwards compatible with r0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCRITAXIRUW_1</name>
                  <description>AXI reads to DEV/SO memory. Exclusive reads to Shareable memory are not initiated on the AXIM AR channel until all outstanding stores on AXI are complete.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISFPUISSOPT</name>
              <description>Disables critical AXI read-under-write</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISFPUISSOPT_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUID</name>
          <description>CPUID Base Register</description>
          <addressOffset>0xD00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x410FC240</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REVISION</name>
              <description>Indicates patch release: 0x0 = Patch 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PARTNO</name>
              <description>Indicates part number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHITECTURE</name>
              <description>ARCHITECTURE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Indicates processor revision: 0x2 = Revision 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPLEMENTER</name>
              <description>Implementer code</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
