nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm7.xml
        <register>
          <name>CM7_ABFSR</name>
          <description>Auxiliary Bus Fault Status Register</description>
          <addressOffset>0xFA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM</name>
              <description>Asynchronous fault on ITCM interface.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCM</name>
              <description>Asynchronous fault on DTCM interface.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBP</name>
              <description>Asynchronous fault on AHBP interface.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIM</name>
              <description>Asynchronous fault on AXIM interface.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPPB</name>
              <description>Asynchronous fault on EPPB interface.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIMTYPE</name>
              <description>Indicates the type of fault on the AXIM interface. Only valid when AXIM is 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXIMTYPE_0</name>
                  <description>OKAY.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXIMTYPE_1</name>
                  <description>EXOKAY.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXIMTYPE_2</name>
                  <description>SLVERR.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXIMTYPE_3</name>
                  <description>DECERR.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA0_DMA16</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>DMA1_DMA17</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>DMA2_DMA18</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>DMA3_DMA19</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA4_DMA20</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>DMA5_DMA21</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>DMA6_DMA22</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>DMA7_DMA23</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>DMA8_DMA24</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>DMA9_DMA25</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA10_DMA26</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>DMA11_DMA27</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA12_DMA28</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>DMA13_DMA29</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA14_DMA30</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>DMA15_DMA31</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>DMA_ERROR</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>CTI0_ERROR</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>CTI1_ERROR</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>CORE</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>LPUART1</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>LPUART2</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>LPUART3</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>LPUART4</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>LPUART5</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>LPUART6</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>LPUART7</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>LPUART8</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>LPUART9</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>LPUART10</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>LPUART11</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>LPUART12</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>LPI2C1</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>LPI2C2</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>LPI2C3</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>LPI2C4</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>LPI2C5</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>LPI2C6</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>LPSPI1</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>LPSPI2</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>LPSPI3</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>LPSPI4</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>LPSPI5</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>LPSPI6</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>CAN1</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>CAN1_ERROR</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>CAN2</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>CAN2_ERROR</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>CAN3</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>CAN3_ERROR</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>FLEXRAM</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>KPP</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>Reserved68</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>GPR_IRQ</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>LCDIF1</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>LCDIF2</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>CSI</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>PXP</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>MIPI_CSI</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>MIPI_DSI</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>GPU2D</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>GPIO6_Combined_0_15</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>GPIO6_Combined_16_31</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>DAC</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>KEY_MANAGER</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>WDOG2</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>SNVS_HP_WRAPPER</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>SNVS_HP_WRAPPER_TZ</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>SNVS_LP_WRAPPER</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>CAAM_IRQ0</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>CAAM_IRQ1</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>CAAM_IRQ2</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>CAAM_IRQ3</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>CAAM_RECORVE_ERRPR</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>CAAM_RTC</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>Reserved91</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>SAI1</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>SAI2</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>SAI3_RX</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>SAI3_TX</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>SAI4_RX</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>SAI4_TX</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>SPDIF</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>ANATOP_TEMP_INT</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>ANATOP_TEMP_LOW_HIGH</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>ANATOP_TEMP_PANIC</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>ANATOP_LP8_BROWNOUT</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>ANATOP_LP0_BROWNOUT</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>ADC1</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>ADC2</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>USBPHY1</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>USBPHY2</name>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>RDC</name>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>GPIO13_Combined_0_31</name>
        <value>93</value>
      </interrupt>
      <interrupt>
        <name>SFA</name>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>DCIC1</name>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>DCIC2</name>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>ASRC</name>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>FLEXRAM_ECC</name>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>CM7_GPIO2_3</name>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_Combined_0_15</name>
        <value>100</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_Combined_16_31</name>
        <value>101</value>
      </interrupt>
      <interrupt>
        <name>GPIO2_Combined_0_15</name>
        <value>102</value>
      </interrupt>
      <interrupt>
        <name>GPIO2_Combined_16_31</name>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>GPIO3_Combined_0_15</name>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>GPIO3_Combined_16_31</name>
        <value>105</value>
      </interrupt>
      <interrupt>
        <name>GPIO4_Combined_0_15</name>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>GPIO4_Combined_16_31</name>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>GPIO5_Combined_0_15</name>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>GPIO5_Combined_16_31</name>
        <value>109</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO1</name>
        <value>110</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO2</name>
        <value>111</value>
      </interrupt>
      <interrupt>
        <name>WDOG1</name>
        <value>112</value>
      </interrupt>
      <interrupt>
        <name>RTWDOG3</name>
        <value>113</value>
      </interrupt>
      <interrupt>
        <name>EWM</name>
        <value>114</value>
      </interrupt>
      <interrupt>
        <name>OCOTP_READ_FUSE_ERROR</name>
        <value>115</value>
      </interrupt>
      <interrupt>
        <name>OCOTP_READ_DONE_ERROR</name>
        <value>116</value>
      </interrupt>
      <interrupt>
        <name>GPC</name>
        <value>117</value>
      </interrupt>
      <interrupt>
        <name>MUA</name>
        <value>118</value>
      </interrupt>
      <interrupt>
        <name>GPT1</name>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>GPT2</name>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>GPT3</name>
        <value>121</value>
      </interrupt>
      <interrupt>
        <name>GPT4</name>
        <value>122</value>
      </interrupt>
      <interrupt>
        <name>GPT5</name>
        <value>123</value>
      </interrupt>
      <interrupt>
        <name>GPT6</name>
        <value>124</value>
      </interrupt>
      <interrupt>
        <name>PWM1_0</name>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>PWM1_1</name>
        <value>126</value>
      </interrupt>
      <interrupt>
        <name>PWM1_2</name>
        <value>127</value>
      </interrupt>
      <interrupt>
        <name>PWM1_3</name>
        <value>128</value>
      </interrupt>
      <interrupt>
        <name>PWM1_FAULT</name>
        <value>129</value>
      </interrupt>
      <interrupt>
        <name>FLEXSPI2</name>
        <value>131</value>
      </interrupt>
      <interrupt>
        <name>SEMC</name>
        <value>132</value>
      </interrupt>
      <interrupt>
        <name>USDHC1</name>
        <value>133</value>
      </interrupt>
      <interrupt>
        <name>USDHC2</name>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>USB_OTG2</name>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>USB_OTG1</name>
        <value>136</value>
      </interrupt>
      <interrupt>
        <name>ENET</name>
        <value>137</value>
      </interrupt>
      <interrupt>
        <name>ENET_1588_Timer</name>
        <value>138</value>
      </interrupt>
      <interrupt>
        <name>ENET_MAC0_Tx_Rx_Done_0</name>
        <value>139</value>
      </interrupt>
      <interrupt>
        <name>ENET_MAC0_Tx_Rx_Done_1</name>
        <value>140</value>
      </interrupt>
      <interrupt>
        <name>ENET_1G</name>
        <value>141</value>
      </interrupt>
      <interrupt>
        <name>ENET_1G_1588_Timer</name>
        <value>142</value>
      </interrupt>
      <interrupt>
        <name>XBAR1_IRQ_0_1</name>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>XBAR1_IRQ_2_3</name>
        <value>144</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ0</name>
        <value>145</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ1</name>
        <value>146</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ2</name>
        <value>147</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_IRQ3</name>
        <value>148</value>
      </interrupt>
      <interrupt>
        <name>ADC_ETC_ERROR_IRQ</name>
        <value>149</value>
      </interrupt>
      <interrupt>
        <name>PIT1</name>
        <value>155</value>
      </interrupt>
      <interrupt>
        <name>PIT2</name>
        <value>156</value>
      </interrupt>
      <interrupt>
        <name>ACMP1</name>
        <value>157</value>
      </interrupt>
      <interrupt>
        <name>ACMP2</name>
        <value>158</value>
      </interrupt>
      <interrupt>
        <name>ACMP3</name>
        <value>159</value>
      </interrupt>
      <interrupt>
        <name>ACMP4</name>
        <value>160</value>
      </interrupt>
      <interrupt>
        <name>Reserved177</name>
        <value>161</value>
      </interrupt>
      <interrupt>
        <name>Reserved178</name>
        <value>162</value>
      </interrupt>
      <interrupt>
        <name>Reserved179</name>
        <value>163</value>
      </interrupt>
      <interrupt>
        <name>Reserved180</name>
        <value>164</value>
      </interrupt>
      <interrupt>
        <name>ENC1</name>
        <value>165</value>
      </interrupt>
      <interrupt>
        <name>ENC2</name>
        <value>166</value>
      </interrupt>
      <interrupt>
        <name>ENC3</name>
        <value>167</value>
      </interrupt>
      <interrupt>
        <name>ENC4</name>
        <value>168</value>
      </interrupt>
      <interrupt>
        <name>Reserved185</name>
        <value>169</value>
      </interrupt>
      <interrupt>
        <name>Reserved186</name>
        <value>170</value>
      </interrupt>
      <interrupt>
        <name>TMR1</name>
        <value>171</value>
      </interrupt>
      <interrupt>
        <name>TMR2</name>
        <value>172</value>
      </interrupt>
      <interrupt>
        <name>TMR3</name>
        <value>173</value>
      </interrupt>
      <interrupt>
        <name>TMR4</name>
        <value>174</value>
      </interrupt>
      <interrupt>
        <name>SEMA4_CP0</name>
        <value>175</value>
      </interrupt>
      <interrupt>
        <name>SEMA4_CP1</name>
        <value>176</value>
      </interrupt>
      <interrupt>
        <name>PWM2_0</name>
        <value>177</value>
      </interrupt>
      <interrupt>
        <name>PWM2_1</name>
        <value>178</value>
      </interrupt>
      <interrupt>
        <name>PWM2_2</name>
        <value>179</value>
      </interrupt>
      <interrupt>
        <name>PWM2_3</name>
        <value>180</value>
      </interrupt>
      <interrupt>
        <name>PWM2_FAULT</name>
        <value>181</value>
      </interrupt>
      <interrupt>
        <name>PWM3_0</name>
        <value>182</value>
      </interrupt>
      <interrupt>
        <name>PWM3_1</name>
        <value>183</value>
      </interrupt>
      <interrupt>
        <name>PWM3_2</name>
        <value>184</value>
      </interrupt>
      <interrupt>
        <name>PWM3_3</name>
        <value>185</value>
      </interrupt>
      <interrupt>
        <name>PWM3_FAULT</name>
        <value>186</value>
      </interrupt>
      <interrupt>
        <name>PWM4_0</name>
        <value>187</value>
      </interrupt>
      <interrupt>
        <name>PWM4_1</name>
        <value>188</value>
      </interrupt>
      <interrupt>
        <name>PWM4_2</name>
        <value>189</value>
      </interrupt>
      <interrupt>
        <name>PWM4_3</name>
        <value>190</value>
      </interrupt>
      <interrupt>
        <name>PWM4_FAULT</name>
        <value>191</value>
      </interrupt>
      <interrupt>
        <name>Reserved208</name>
        <value>192</value>
      </interrupt>
      <interrupt>
        <name>Reserved209</name>
        <value>193</value>
      </interrupt>
      <interrupt>
        <name>Reserved210</name>
        <value>194</value>
      </interrupt>
      <interrupt>
        <name>Reserved211</name>
        <value>195</value>
      </interrupt>
      <interrupt>
        <name>Reserved212</name>
        <value>196</value>
      </interrupt>
      <interrupt>
        <name>Reserved213</name>
        <value>197</value>
      </interrupt>
      <interrupt>
        <name>Reserved214</name>
        <value>198</value>
      </interrupt>
      <interrupt>
        <name>Reserved215</name>
        <value>199</value>
      </interrupt>
      <interrupt>
        <name>Reserved216</name>
        <value>200</value>
      </interrupt>
      <interrupt>
        <name>Reserved217</name>
        <value>201</value>
      </interrupt>
      <interrupt>
        <name>PDM_EVENT</name>
        <value>202</value>
      </interrupt>
      <interrupt>
        <name>PDM_ERROR</name>
        <value>203</value>
      </interrupt>
      <interrupt>
        <name>EMVSIM1</name>
        <value>204</value>
      </interrupt>
      <interrupt>
        <name>EMVSIM2</name>
        <value>205</value>
      </interrupt>
      <interrupt>
        <name>MECC1_INIT</name>
        <value>206</value>
      </interrupt>
      <interrupt>
        <name>MECC1_FATAL_INIT</name>
        <value>207</value>
      </interrupt>
      <interrupt>
        <name>MECC2_INIT</name>
        <value>208</value>
      </interrupt>
      <interrupt>
        <name>MECC2_FATAL_INIT</name>
        <value>209</value>
      </interrupt>
      <interrupt>
        <name>XECC_FLEXSPI1_INIT</name>
        <value>210</value>
      </interrupt>
      <interrupt>
        <name>XECC_FLEXSPI1_FATAL_INIT</name>
        <value>211</value>
      </interrupt>
      <interrupt>
        <name>XECC_FLEXSPI2_INIT</name>
        <value>212</value>
      </interrupt>
      <interrupt>
        <name>XECC_FLEXSPI2_FATAL_INIT</name>
        <value>213</value>
      </interrupt>
      <interrupt>
        <name>XECC_SEMC_INIT</name>
        <value>214</value>
      </interrupt>
      <interrupt>
        <name>XECC_SEMC_FATAL_INIT</name>
        <value>215</value>
      </interrupt>
      <interrupt>
        <name>ENET_QOS</name>
        <value>216</value>
      </interrupt>
      <interrupt>
        <name>ENET_QOS_PMT</name>
        <value>217</value>
      </interrupt>
      <registers>
        <register>
          <name>NVICISER0</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
